Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __RPC1Rbits_t RPC1Rbits __asm__ ("RPC1R") __attribute__((section("sfrs"), address(0xBF801684)));
#define RPC2R RPC2R
extern volatile uint32_t   RPC2R __attribute__((section("sfrs"), address(0xBF801688)));
typedef struct {
  uint32_t RPC2R:5;
} __RPC2Rbits_t;
extern volatile __RPC2Rbits_t RPC2Rbits __asm__ ("RPC2R") __attribute__((section("sfrs"), address(0xBF801688)));
#define RPC4R RPC4R
extern volatile uint32_t   RPC4R __attribute__((section("sfrs"), address(0xBF801690)));
typedef struct {
  uint32_t RPC4R:5;
} __RPC4Rbits_t;
extern volatile __RPC4Rbits_t RPC4Rbits __asm__ ("RPC4R") __attribute__((section("sfrs"), address(0xBF801690)));
#define RPC5R RPC5R
extern volatile uint32_t   RPC5R __attribute__((section("sfrs"), address(0xBF801694)));
typedef struct {
  uint32_t RPC5R:5;
} __RPC5Rbits_t;
extern volatile __RPC5Rbits_t RPC5Rbits __asm__ ("RPC5R") __attribute__((section("sfrs"), address(0xBF801694)));
#define RPC6R RPC6R
extern volatile uint32_t   RPC6R __attribute__((section("sfrs"), address(0xBF801698)));
typedef struct {
  uint32_t RPC6R:5;
} __RPC6Rbits_t;
extern volatile __RPC6Rbits_t RPC6Rbits __asm__ ("RPC6R") __attribute__((section("sfrs"), address(0xBF801698)));
#define RPC7R RPC7R
extern volatile uint32_t   RPC7R __attribute__((section("sfrs"), address(0xBF80169C)));
typedef struct {
  uint32_t RPC7R:5;
} __RPC7Rbits_t;
extern volatile __RPC7Rbits_t RPC7Rbits __asm__ ("RPC7R") __attribute__((section("sfrs"), address(0xBF80169C)));
#define RPC8R RPC8R
extern volatile uint32_t   RPC8R __attribute__((section("sfrs"), address(0xBF8016A0)));
typedef struct {
  uint32_t RPC8R:5;
} __RPC8Rbits_t;
extern volatile __RPC8Rbits_t RPC8Rbits __asm__ ("RPC8R") __attribute__((section("sfrs"), address(0xBF8016A0)));
#define RPC9R RPC9R
extern volatile uint32_t   RPC9R __attribute__((section("sfrs"), address(0xBF8016A4)));
typedef struct {
  uint32_t RPC9R:5;
} __RPC9Rbits_t;
extern volatile __RPC9Rbits_t RPC9Rbits __asm__ ("RPC9R") __attribute__((section("sfrs"), address(0xBF8016A4)));
#define RPC10R RPC10R
extern volatile uint32_t   RPC10R __attribute__((section("sfrs"), address(0xBF8016A8)));
typedef struct {
  uint32_t RPC10R:5;
} __RPC10Rbits_t;
extern volatile __RPC10Rbits_t RPC10Rbits __asm__ ("RPC10R") __attribute__((section("sfrs"), address(0xBF8016A8)));
#define RPC12R RPC12R
extern volatile uint32_t   RPC12R __attribute__((section("sfrs"), address(0xBF8016B0)));
typedef struct {
  uint32_t RPC12R:5;
} __RPC12Rbits_t;
extern volatile __RPC12Rbits_t RPC12Rbits __asm__ ("RPC12R") __attribute__((section("sfrs"), address(0xBF8016B0)));
#define RPC15R RPC15R
extern volatile uint32_t   RPC15R __attribute__((section("sfrs"), address(0xBF8016BC)));
typedef struct {
  uint32_t RPC15R:5;
} __RPC15Rbits_t;
extern volatile __RPC15Rbits_t RPC15Rbits __asm__ ("RPC15R") __attribute__((section("sfrs"), address(0xBF8016BC)));
#define RPD3R RPD3R
extern volatile uint32_t   RPD3R __attribute__((section("sfrs"), address(0xBF8016CC)));
typedef struct {
  uint32_t RPD3R:5;
} __RPD3Rbits_t;
extern volatile __RPD3Rbits_t RPD3Rbits __asm__ ("RPD3R") __attribute__((section("sfrs"), address(0xBF8016CC)));
#define RPD4R RPD4R
extern volatile uint32_t   RPD4R __attribute__((section("sfrs"), address(0xBF8016D0)));
typedef struct {
  uint32_t RPD4R:5;
} __RPD4Rbits_t;
extern volatile __RPD4Rbits_t RPD4Rbits __asm__ ("RPD4R") __attribute__((section("sfrs"), address(0xBF8016D0)));
#define RPD5R RPD5R
extern volatile uint32_t   RPD5R __attribute__((section("sfrs"), address(0xBF8016D4)));
typedef struct {
  uint32_t RPD5R:5;
} __RPD5Rbits_t;
extern volatile __RPD5Rbits_t RPD5Rbits __asm__ ("RPD5R") __attribute__((section("sfrs"), address(0xBF8016D4)));
#define RPD6R RPD6R
extern volatile uint32_t   RPD6R __attribute__((section("sfrs"), address(0xBF8016D8)));
typedef struct {
  uint32_t RPD6R:5;
} __RPD6Rbits_t;
extern volatile __RPD6Rbits_t RPD6Rbits __asm__ ("RPD6R") __attribute__((section("sfrs"), address(0xBF8016D8)));
#define RPE0R RPE0R
extern volatile uint32_t   RPE0R __attribute__((section("sfrs"), address(0xBF801700)));
typedef struct {
  uint32_t RPE0R:5;
} __RPE0Rbits_t;
extern volatile __RPE0Rbits_t RPE0Rbits __asm__ ("RPE0R") __attribute__((section("sfrs"), address(0xBF801700)));
#define RPE1R RPE1R
extern volatile uint32_t   RPE1R __attribute__((section("sfrs"), address(0xBF801704)));
typedef struct {
  uint32_t RPE1R:5;
} __RPE1Rbits_t;
extern volatile __RPE1Rbits_t RPE1Rbits __asm__ ("RPE1R") __attribute__((section("sfrs"), address(0xBF801704)));
#define RPE14R RPE14R
extern volatile uint32_t   RPE14R __attribute__((section("sfrs"), address(0xBF801738)));
typedef struct {
  uint32_t RPE14R:5;
} __RPE14Rbits_t;
extern volatile __RPE14Rbits_t RPE14Rbits __asm__ ("RPE14R") __attribute__((section("sfrs"), address(0xBF801738)));
#define RPE15R RPE15R
extern volatile uint32_t   RPE15R __attribute__((section("sfrs"), address(0xBF80173C)));
typedef struct {
  uint32_t RPE15R:5;
} __RPE15Rbits_t;
extern volatile __RPE15Rbits_t RPE15Rbits __asm__ ("RPE15R") __attribute__((section("sfrs"), address(0xBF80173C)));
#define RPF0R RPF0R
extern volatile uint32_t   RPF0R __attribute__((section("sfrs"), address(0xBF801740)));
typedef struct {
  uint32_t RPF0R:5;
} __RPF0Rbits_t;
extern volatile __RPF0Rbits_t RPF0Rbits __asm__ ("RPF0R") __attribute__((section("sfrs"), address(0xBF801740)));
#define RPF1R RPF1R
extern volatile uint32_t   RPF1R __attribute__((section("sfrs"), address(0xBF801744)));
typedef struct {
  uint32_t RPF1R:5;
} __RPF1Rbits_t;
extern volatile __RPF1Rbits_t RPF1Rbits __asm__ ("RPF1R") __attribute__((section("sfrs"), address(0xBF801744)));
#define RPG0R RPG0R
extern volatile uint32_t   RPG0R __attribute__((section("sfrs"), address(0xBF801780)));
typedef struct {
  uint32_t RPG0R:5;
} __RPG0Rbits_t;
extern volatile __RPG0Rbits_t RPG0Rbits __asm__ ("RPG0R") __attribute__((section("sfrs"), address(0xBF801780)));
#define RPG1R RPG1R
extern volatile uint32_t   RPG1R __attribute__((section("sfrs"), address(0xBF801784)));
typedef struct {
  uint32_t RPG1R:5;
} __RPG1Rbits_t;
extern volatile __RPG1Rbits_t RPG1Rbits __asm__ ("RPG1R") __attribute__((section("sfrs"), address(0xBF801784)));
#define RPG6R RPG6R
extern volatile uint32_t   RPG6R __attribute__((section("sfrs"), address(0xBF801798)));
typedef struct {
  uint32_t RPG6R:5;
} __RPG6Rbits_t;
extern volatile __RPG6Rbits_t RPG6Rbits __asm__ ("RPG6R") __attribute__((section("sfrs"), address(0xBF801798)));
#define RPG7R RPG7R
extern volatile uint32_t   RPG7R __attribute__((section("sfrs"), address(0xBF80179C)));
typedef struct {
  uint32_t RPG7R:5;
} __RPG7Rbits_t;
extern volatile __RPG7Rbits_t RPG7Rbits __asm__ ("RPG7R") __attribute__((section("sfrs"), address(0xBF80179C)));
#define RPG8R RPG8R
extern volatile uint32_t   RPG8R __attribute__((section("sfrs"), address(0xBF8017A0)));
typedef struct {
  uint32_t RPG8R:5;
} __RPG8Rbits_t;
extern volatile __RPG8Rbits_t RPG8Rbits __asm__ ("RPG8R") __attribute__((section("sfrs"), address(0xBF8017A0)));
#define RPG9R RPG9R
extern volatile uint32_t   RPG9R __attribute__((section("sfrs"), address(0xBF8017A4)));
typedef struct {
  uint32_t RPG9R:5;
} __RPG9Rbits_t;
extern volatile __RPG9Rbits_t RPG9Rbits __asm__ ("RPG9R") __attribute__((section("sfrs"), address(0xBF8017A4)));
#define RPG12R RPG12R
extern volatile uint32_t   RPG12R __attribute__((section("sfrs"), address(0xBF8017B0)));
typedef struct {
  uint32_t RPG12R:5;
} __RPG12Rbits_t;
