Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __OC1CONbits_t OC1CONbits __asm__ ("OC1CON") __attribute__((section("sfrs"), address(0xBF824000)));
extern volatile uint32_t        OC1CONCLR __attribute__((section("sfrs"),address(0xBF824004)));
extern volatile uint32_t        OC1CONSET __attribute__((section("sfrs"),address(0xBF824008)));
extern volatile uint32_t        OC1CONINV __attribute__((section("sfrs"),address(0xBF82400C)));
#define OC1R OC1R
extern volatile uint32_t   OC1R __attribute__((section("sfrs"), address(0xBF824010)));
extern volatile uint32_t        OC1RCLR __attribute__((section("sfrs"),address(0xBF824014)));
extern volatile uint32_t        OC1RSET __attribute__((section("sfrs"),address(0xBF824018)));
extern volatile uint32_t        OC1RINV __attribute__((section("sfrs"),address(0xBF82401C)));
#define OC1RS OC1RS
extern volatile uint32_t   OC1RS __attribute__((section("sfrs"), address(0xBF824020)));
extern volatile uint32_t        OC1RSCLR __attribute__((section("sfrs"),address(0xBF824024)));
extern volatile uint32_t        OC1RSSET __attribute__((section("sfrs"),address(0xBF824028)));
extern volatile uint32_t        OC1RSINV __attribute__((section("sfrs"),address(0xBF82402C)));
#define OC2CON OC2CON
extern volatile uint32_t   OC2CON __attribute__((section("sfrs"), address(0xBF824200)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC2CONbits_t;
extern volatile __OC2CONbits_t OC2CONbits __asm__ ("OC2CON") __attribute__((section("sfrs"), address(0xBF824200)));
extern volatile uint32_t        OC2CONCLR __attribute__((section("sfrs"),address(0xBF824204)));
extern volatile uint32_t        OC2CONSET __attribute__((section("sfrs"),address(0xBF824208)));
extern volatile uint32_t        OC2CONINV __attribute__((section("sfrs"),address(0xBF82420C)));
#define OC2R OC2R
extern volatile uint32_t   OC2R __attribute__((section("sfrs"), address(0xBF824210)));
extern volatile uint32_t        OC2RCLR __attribute__((section("sfrs"),address(0xBF824214)));
extern volatile uint32_t        OC2RSET __attribute__((section("sfrs"),address(0xBF824218)));
extern volatile uint32_t        OC2RINV __attribute__((section("sfrs"),address(0xBF82421C)));
#define OC2RS OC2RS
extern volatile uint32_t   OC2RS __attribute__((section("sfrs"), address(0xBF824220)));
extern volatile uint32_t        OC2RSCLR __attribute__((section("sfrs"),address(0xBF824224)));
extern volatile uint32_t        OC2RSSET __attribute__((section("sfrs"),address(0xBF824228)));
extern volatile uint32_t        OC2RSINV __attribute__((section("sfrs"),address(0xBF82422C)));
#define OC3CON OC3CON
extern volatile uint32_t   OC3CON __attribute__((section("sfrs"), address(0xBF824400)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC3CONbits_t;
extern volatile __OC3CONbits_t OC3CONbits __asm__ ("OC3CON") __attribute__((section("sfrs"), address(0xBF824400)));
extern volatile uint32_t        OC3CONCLR __attribute__((section("sfrs"),address(0xBF824404)));
extern volatile uint32_t        OC3CONSET __attribute__((section("sfrs"),address(0xBF824408)));
extern volatile uint32_t        OC3CONINV __attribute__((section("sfrs"),address(0xBF82440C)));
#define OC3R OC3R
extern volatile uint32_t   OC3R __attribute__((section("sfrs"), address(0xBF824410)));
extern volatile uint32_t        OC3RCLR __attribute__((section("sfrs"),address(0xBF824414)));
extern volatile uint32_t        OC3RSET __attribute__((section("sfrs"),address(0xBF824418)));
extern volatile uint32_t        OC3RINV __attribute__((section("sfrs"),address(0xBF82441C)));
#define OC3RS OC3RS
extern volatile uint32_t   OC3RS __attribute__((section("sfrs"), address(0xBF824420)));
extern volatile uint32_t        OC3RSCLR __attribute__((section("sfrs"),address(0xBF824424)));
extern volatile uint32_t        OC3RSSET __attribute__((section("sfrs"),address(0xBF824428)));
extern volatile uint32_t        OC3RSINV __attribute__((section("sfrs"),address(0xBF82442C)));
#define OC4CON OC4CON
extern volatile uint32_t   OC4CON __attribute__((section("sfrs"), address(0xBF824600)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC4CONbits_t;
extern volatile __OC4CONbits_t OC4CONbits __asm__ ("OC4CON") __attribute__((section("sfrs"), address(0xBF824600)));
extern volatile uint32_t        OC4CONCLR __attribute__((section("sfrs"),address(0xBF824604)));
extern volatile uint32_t        OC4CONSET __attribute__((section("sfrs"),address(0xBF824608)));
extern volatile uint32_t        OC4CONINV __attribute__((section("sfrs"),address(0xBF82460C)));
#define OC4R OC4R
extern volatile uint32_t   OC4R __attribute__((section("sfrs"), address(0xBF824610)));
extern volatile uint32_t        OC4RCLR __attribute__((section("sfrs"),address(0xBF824614)));
extern volatile uint32_t        OC4RSET __attribute__((section("sfrs"),address(0xBF824618)));
extern volatile uint32_t        OC4RINV __attribute__((section("sfrs"),address(0xBF82461C)));
#define OC4RS OC4RS
extern volatile uint32_t   OC4RS __attribute__((section("sfrs"), address(0xBF824620)));
extern volatile uint32_t        OC4RSCLR __attribute__((section("sfrs"),address(0xBF824624)));
extern volatile uint32_t        OC4RSSET __attribute__((section("sfrs"),address(0xBF824628)));
extern volatile uint32_t        OC4RSINV __attribute__((section("sfrs"),address(0xBF82462C)));
#define OC5CON OC5CON
extern volatile uint32_t   OC5CON __attribute__((section("sfrs"), address(0xBF824800)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC5CONbits_t;
extern volatile __OC5CONbits_t OC5CONbits __asm__ ("OC5CON") __attribute__((section("sfrs"), address(0xBF824800)));
extern volatile uint32_t        OC5CONCLR __attribute__((section("sfrs"),address(0xBF824804)));
extern volatile uint32_t        OC5CONSET __attribute__((section("sfrs"),address(0xBF824808)));
extern volatile uint32_t        OC5CONINV __attribute__((section("sfrs"),address(0xBF82480C)));
#define OC5R OC5R
extern volatile uint32_t   OC5R __attribute__((section("sfrs"), address(0xBF824810)));
extern volatile uint32_t        OC5RCLR __attribute__((section("sfrs"),address(0xBF824814)));
extern volatile uint32_t        OC5RSET __attribute__((section("sfrs"),address(0xBF824818)));
extern volatile uint32_t        OC5RINV __attribute__((section("sfrs"),address(0xBF82481C)));
#define OC5RS OC5RS
extern volatile uint32_t   OC5RS __attribute__((section("sfrs"), address(0xBF824820)));
extern volatile uint32_t        OC5RSCLR __attribute__((section("sfrs"),address(0xBF824824)));
extern volatile uint32_t        OC5RSSET __attribute__((section("sfrs"),address(0xBF824828)));
extern volatile uint32_t        OC5RSINV __attribute__((section("sfrs"),address(0xBF82482C)));
#define OC6CON OC6CON
extern volatile uint32_t   OC6CON __attribute__((section("sfrs"), address(0xBF824A00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC6CONbits_t;
extern volatile __OC6CONbits_t OC6CONbits __asm__ ("OC6CON") __attribute__((section("sfrs"), address(0xBF824A00)));
extern volatile uint32_t        OC6CONCLR __attribute__((section("sfrs"),address(0xBF824A04)));
extern volatile uint32_t        OC6CONSET __attribute__((section("sfrs"),address(0xBF824A08)));
extern volatile uint32_t        OC6CONINV __attribute__((section("sfrs"),address(0xBF824A0C)));
#define OC6R OC6R
extern volatile uint32_t   OC6R __attribute__((section("sfrs"), address(0xBF824A10)));
extern volatile uint32_t        OC6RCLR __attribute__((section("sfrs"),address(0xBF824A14)));
extern volatile uint32_t        OC6RSET __attribute__((section("sfrs"),address(0xBF824A18)));
extern volatile uint32_t        OC6RINV __attribute__((section("sfrs"),address(0xBF824A1C)));
#define OC6RS OC6RS
extern volatile uint32_t   OC6RS __attribute__((section("sfrs"), address(0xBF824A20)));
extern volatile uint32_t        OC6RSCLR __attribute__((section("sfrs"),address(0xBF824A24)));
extern volatile uint32_t        OC6RSSET __attribute__((section("sfrs"),address(0xBF824A28)));
extern volatile uint32_t        OC6RSINV __attribute__((section("sfrs"),address(0xBF824A2C)));
#define OC7CON OC7CON
extern volatile uint32_t   OC7CON __attribute__((section("sfrs"), address(0xBF824C00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC7CONbits_t;
extern volatile __OC7CONbits_t OC7CONbits __asm__ ("OC7CON") __attribute__((section("sfrs"), address(0xBF824C00)));
extern volatile uint32_t        OC7CONCLR __attribute__((section("sfrs"),address(0xBF824C04)));
extern volatile uint32_t        OC7CONSET __attribute__((section("sfrs"),address(0xBF824C08)));
extern volatile uint32_t        OC7CONINV __attribute__((section("sfrs"),address(0xBF824C0C)));
#define OC7R OC7R
extern volatile uint32_t   OC7R __attribute__((section("sfrs"), address(0xBF824C10)));
extern volatile uint32_t        OC7RCLR __attribute__((section("sfrs"),address(0xBF824C14)));
extern volatile uint32_t        OC7RSET __attribute__((section("sfrs"),address(0xBF824C18)));
extern volatile uint32_t        OC7RINV __attribute__((section("sfrs"),address(0xBF824C1C)));
#define OC7RS OC7RS
extern volatile uint32_t   OC7RS __attribute__((section("sfrs"), address(0xBF824C20)));
extern volatile uint32_t        OC7RSCLR __attribute__((section("sfrs"),address(0xBF824C24)));
extern volatile uint32_t        OC7RSSET __attribute__((section("sfrs"),address(0xBF824C28)));
extern volatile uint32_t        OC7RSINV __attribute__((section("sfrs"),address(0xBF824C2C)));
#define OC8CON OC8CON
extern volatile uint32_t   OC8CON __attribute__((section("sfrs"), address(0xBF824E00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC8CONbits_t;
extern volatile __OC8CONbits_t OC8CONbits __asm__ ("OC8CON") __attribute__((section("sfrs"), address(0xBF824E00)));
extern volatile uint32_t        OC8CONCLR __attribute__((section("sfrs"),address(0xBF824E04)));
extern volatile uint32_t        OC8CONSET __attribute__((section("sfrs"),address(0xBF824E08)));
extern volatile uint32_t        OC8CONINV __attribute__((section("sfrs"),address(0xBF824E0C)));
#define OC8R OC8R
extern volatile uint32_t   OC8R __attribute__((section("sfrs"), address(0xBF824E10)));
extern volatile uint32_t        OC8RCLR __attribute__((section("sfrs"),address(0xBF824E14)));
extern volatile uint32_t        OC8RSET __attribute__((section("sfrs"),address(0xBF824E18)));
extern volatile uint32_t        OC8RINV __attribute__((section("sfrs"),address(0xBF824E1C)));
#define OC8RS OC8RS
extern volatile uint32_t   OC8RS __attribute__((section("sfrs"), address(0xBF824E20)));
extern volatile uint32_t        OC8RSCLR __attribute__((section("sfrs"),address(0xBF824E24)));
extern volatile uint32_t        OC8RSSET __attribute__((section("sfrs"),address(0xBF824E28)));
extern volatile uint32_t        OC8RSINV __attribute__((section("sfrs"),address(0xBF824E2C)));
#define OC9CON OC9CON
extern volatile uint32_t   OC9CON __attribute__((section("sfrs"), address(0xBF825000)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC9CONbits_t;
extern volatile __OC9CONbits_t OC9CONbits __asm__ ("OC9CON") __attribute__((section("sfrs"), address(0xBF825000)));
extern volatile uint32_t        OC9CONCLR __attribute__((section("sfrs"),address(0xBF825004)));
extern volatile uint32_t        OC9CONSET __attribute__((section("sfrs"),address(0xBF825008)));
extern volatile uint32_t        OC9CONINV __attribute__((section("sfrs"),address(0xBF82500C)));
#define OC9R OC9R
extern volatile uint32_t   OC9R __attribute__((section("sfrs"), address(0xBF825010)));
extern volatile uint32_t        OC9RCLR __attribute__((section("sfrs"),address(0xBF825014)));
extern volatile uint32_t        OC9RSET __attribute__((section("sfrs"),address(0xBF825018)));
extern volatile uint32_t        OC9RINV __attribute__((section("sfrs"),address(0xBF82501C)));
#define OC9RS OC9RS
extern volatile uint32_t   OC9RS __attribute__((section("sfrs"), address(0xBF825020)));
extern volatile uint32_t        OC9RSCLR __attribute__((section("sfrs"),address(0xBF825024)));
extern volatile uint32_t        OC9RSSET __attribute__((section("sfrs"),address(0xBF825028)));
extern volatile uint32_t        OC9RSINV __attribute__((section("sfrs"),address(0xBF82502C)));
#define I2C1CON I2C1CON
extern volatile uint32_t   I2C1CON __attribute__((section("sfrs"), address(0xBF826000)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C1CONbits_t;
extern volatile __I2C1CONbits_t I2C1CONbits __asm__ ("I2C1CON") __attribute__((section("sfrs"), address(0xBF826000)));
extern volatile uint32_t        I2C1CONCLR __attribute__((section("sfrs"),address(0xBF826004)));
extern volatile uint32_t        I2C1CONSET __attribute__((section("sfrs"),address(0xBF826008)));
extern volatile uint32_t        I2C1CONINV __attribute__((section("sfrs"),address(0xBF82600C)));
#define I2C1STAT I2C1STAT
extern volatile uint32_t   I2C1STAT __attribute__((section("sfrs"), address(0xBF826010)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C1STATbits_t;
extern volatile __I2C1STATbits_t I2C1STATbits __asm__ ("I2C1STAT") __attribute__((section("sfrs"), address(0xBF826010)));
extern volatile uint32_t        I2C1STATCLR __attribute__((section("sfrs"),address(0xBF826014)));
extern volatile uint32_t        I2C1STATSET __attribute__((section("sfrs"),address(0xBF826018)));
extern volatile uint32_t        I2C1STATINV __attribute__((section("sfrs"),address(0xBF82601C)));
#define I2C1ADD I2C1ADD
extern volatile uint32_t   I2C1ADD __attribute__((section("sfrs"), address(0xBF826020)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C1ADDbits_t;
extern volatile __I2C1ADDbits_t I2C1ADDbits __asm__ ("I2C1ADD") __attribute__((section("sfrs"), address(0xBF826020)));
extern volatile uint32_t        I2C1ADDCLR __attribute__((section("sfrs"),address(0xBF826024)));
extern volatile uint32_t        I2C1ADDSET __attribute__((section("sfrs"),address(0xBF826028)));
extern volatile uint32_t        I2C1ADDINV __attribute__((section("sfrs"),address(0xBF82602C)));
#define I2C1MSK I2C1MSK
extern volatile uint32_t   I2C1MSK __attribute__((section("sfrs"), address(0xBF826030)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C1MSKbits_t;
