Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __SDC6bits_t SDC6bits __asm__ ("SDC6") __attribute__((section("sfrs"), address(0xBF82A5F0)));
extern volatile uint32_t        SDC6CLR __attribute__((section("sfrs"),address(0xBF82A5F4)));
extern volatile uint32_t        SDC6SET __attribute__((section("sfrs"),address(0xBF82A5F8)));
extern volatile uint32_t        SDC6INV __attribute__((section("sfrs"),address(0xBF82A5FC)));
#define PHASE6 PHASE6
extern volatile uint32_t   PHASE6 __attribute__((section("sfrs"), address(0xBF82A600)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE6bits_t;
extern volatile __PHASE6bits_t PHASE6bits __asm__ ("PHASE6") __attribute__((section("sfrs"), address(0xBF82A600)));
extern volatile uint32_t        PHASE6CLR __attribute__((section("sfrs"),address(0xBF82A604)));
extern volatile uint32_t        PHASE6SET __attribute__((section("sfrs"),address(0xBF82A608)));
extern volatile uint32_t        PHASE6INV __attribute__((section("sfrs"),address(0xBF82A60C)));
#define DTR6 DTR6
extern volatile uint32_t   DTR6 __attribute__((section("sfrs"), address(0xBF82A610)));
typedef struct {
  uint32_t DTR:16;
} __DTR6bits_t;
extern volatile __DTR6bits_t DTR6bits __asm__ ("DTR6") __attribute__((section("sfrs"), address(0xBF82A610)));
extern volatile uint32_t        DTR6CLR __attribute__((section("sfrs"),address(0xBF82A614)));
extern volatile uint32_t        DTR6SET __attribute__((section("sfrs"),address(0xBF82A618)));
extern volatile uint32_t        DTR6INV __attribute__((section("sfrs"),address(0xBF82A61C)));
#define ALTDTR6 ALTDTR6
extern volatile uint32_t   ALTDTR6 __attribute__((section("sfrs"), address(0xBF82A620)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR6bits_t;
extern volatile __ALTDTR6bits_t ALTDTR6bits __asm__ ("ALTDTR6") __attribute__((section("sfrs"), address(0xBF82A620)));
extern volatile uint32_t        ALTDTR6CLR __attribute__((section("sfrs"),address(0xBF82A624)));
extern volatile uint32_t        ALTDTR6SET __attribute__((section("sfrs"),address(0xBF82A628)));
extern volatile uint32_t        ALTDTR6INV __attribute__((section("sfrs"),address(0xBF82A62C)));
#define DTCOMP6 DTCOMP6
extern volatile uint32_t   DTCOMP6 __attribute__((section("sfrs"), address(0xBF82A630)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP6bits_t;
extern volatile __DTCOMP6bits_t DTCOMP6bits __asm__ ("DTCOMP6") __attribute__((section("sfrs"), address(0xBF82A630)));
extern volatile uint32_t        DTCOMP6CLR __attribute__((section("sfrs"),address(0xBF82A634)));
extern volatile uint32_t        DTCOMP6SET __attribute__((section("sfrs"),address(0xBF82A638)));
extern volatile uint32_t        DTCOMP6INV __attribute__((section("sfrs"),address(0xBF82A63C)));
#define TRIG6 TRIG6
extern volatile uint32_t   TRIG6 __attribute__((section("sfrs"), address(0xBF82A640)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG6bits_t;
extern volatile __TRIG6bits_t TRIG6bits __asm__ ("TRIG6") __attribute__((section("sfrs"), address(0xBF82A640)));
extern volatile uint32_t        TRIG6CLR __attribute__((section("sfrs"),address(0xBF82A644)));
extern volatile uint32_t        TRIG6SET __attribute__((section("sfrs"),address(0xBF82A648)));
extern volatile uint32_t        TRIG6INV __attribute__((section("sfrs"),address(0xBF82A64C)));
#define TRGCON6 TRGCON6
extern volatile uint32_t   TRGCON6 __attribute__((section("sfrs"), address(0xBF82A650)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON6bits_t;
extern volatile __TRGCON6bits_t TRGCON6bits __asm__ ("TRGCON6") __attribute__((section("sfrs"), address(0xBF82A650)));
extern volatile uint32_t        TRGCON6CLR __attribute__((section("sfrs"),address(0xBF82A654)));
extern volatile uint32_t        TRGCON6SET __attribute__((section("sfrs"),address(0xBF82A658)));
extern volatile uint32_t        TRGCON6INV __attribute__((section("sfrs"),address(0xBF82A65C)));
#define STRIG6 STRIG6
extern volatile uint32_t   STRIG6 __attribute__((section("sfrs"), address(0xBF82A660)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG6bits_t;
extern volatile __STRIG6bits_t STRIG6bits __asm__ ("STRIG6") __attribute__((section("sfrs"), address(0xBF82A660)));
extern volatile uint32_t        STRIG6CLR __attribute__((section("sfrs"),address(0xBF82A664)));
extern volatile uint32_t        STRIG6SET __attribute__((section("sfrs"),address(0xBF82A668)));
extern volatile uint32_t        STRIG6INV __attribute__((section("sfrs"),address(0xBF82A66C)));
#define CAP6 CAP6
extern volatile uint32_t   CAP6 __attribute__((section("sfrs"), address(0xBF82A670)));
typedef struct {
  uint32_t CAP:16;
} __CAP6bits_t;
extern volatile __CAP6bits_t CAP6bits __asm__ ("CAP6") __attribute__((section("sfrs"), address(0xBF82A670)));
extern volatile uint32_t        CAP6CLR __attribute__((section("sfrs"),address(0xBF82A674)));
extern volatile uint32_t        CAP6SET __attribute__((section("sfrs"),address(0xBF82A678)));
extern volatile uint32_t        CAP6INV __attribute__((section("sfrs"),address(0xBF82A67C)));
#define LEBCON6 LEBCON6
extern volatile uint32_t   LEBCON6 __attribute__((section("sfrs"), address(0xBF82A680)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON6bits_t;
extern volatile __LEBCON6bits_t LEBCON6bits __asm__ ("LEBCON6") __attribute__((section("sfrs"), address(0xBF82A680)));
extern volatile uint32_t        LEBCON6CLR __attribute__((section("sfrs"),address(0xBF82A684)));
extern volatile uint32_t        LEBCON6SET __attribute__((section("sfrs"),address(0xBF82A688)));
extern volatile uint32_t        LEBCON6INV __attribute__((section("sfrs"),address(0xBF82A68C)));
#define LEBDLY6 LEBDLY6
extern volatile uint32_t   LEBDLY6 __attribute__((section("sfrs"), address(0xBF82A690)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY6bits_t;
extern volatile __LEBDLY6bits_t LEBDLY6bits __asm__ ("LEBDLY6") __attribute__((section("sfrs"), address(0xBF82A690)));
extern volatile uint32_t        LEBDLY6CLR __attribute__((section("sfrs"),address(0xBF82A694)));
extern volatile uint32_t        LEBDLY6SET __attribute__((section("sfrs"),address(0xBF82A698)));
extern volatile uint32_t        LEBDLY6INV __attribute__((section("sfrs"),address(0xBF82A69C)));
#define AUXCON6 AUXCON6
extern volatile uint32_t   AUXCON6 __attribute__((section("sfrs"), address(0xBF82A6A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON6bits_t;
extern volatile __AUXCON6bits_t AUXCON6bits __asm__ ("AUXCON6") __attribute__((section("sfrs"), address(0xBF82A6A0)));
extern volatile uint32_t        AUXCON6CLR __attribute__((section("sfrs"),address(0xBF82A6A4)));
extern volatile uint32_t        AUXCON6SET __attribute__((section("sfrs"),address(0xBF82A6A8)));
extern volatile uint32_t        AUXCON6INV __attribute__((section("sfrs"),address(0xBF82A6AC)));
#define PTMR6 PTMR6
extern volatile uint32_t   PTMR6 __attribute__((section("sfrs"), address(0xBF82A6B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR6bits_t;
