Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __INDX1CNTbits_t INDX1CNTbits __asm__ ("INDX1CNT") __attribute__((section("sfrs"), address(0xBF82B290)));
extern volatile uint32_t        INDX1CNTCLR __attribute__((section("sfrs"),address(0xBF82B294)));
extern volatile uint32_t        INDX1CNTSET __attribute__((section("sfrs"),address(0xBF82B298)));
extern volatile uint32_t        INDX1CNTINV __attribute__((section("sfrs"),address(0xBF82B29C)));
#define INDX1HLD INDX1HLD
extern volatile uint32_t   INDX1HLD __attribute__((section("sfrs"), address(0xBF82B2A0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX1HLDbits_t;
extern volatile __INDX1HLDbits_t INDX1HLDbits __asm__ ("INDX1HLD") __attribute__((section("sfrs"), address(0xBF82B2A0)));
extern volatile uint32_t        INDX1HLDCLR __attribute__((section("sfrs"),address(0xBF82B2A4)));
extern volatile uint32_t        INDX1HLDSET __attribute__((section("sfrs"),address(0xBF82B2A8)));
extern volatile uint32_t        INDX1HLDINV __attribute__((section("sfrs"),address(0xBF82B2AC)));
#define QEI1ICC QEI1ICC
extern volatile uint32_t   QEI1ICC __attribute__((section("sfrs"), address(0xBF82B2B0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI1ICCbits_t;
extern volatile __QEI1ICCbits_t QEI1ICCbits __asm__ ("QEI1ICC") __attribute__((section("sfrs"), address(0xBF82B2B0)));
extern volatile uint32_t        QEI1ICCCLR __attribute__((section("sfrs"),address(0xBF82B2B4)));
extern volatile uint32_t        QEI1ICCSET __attribute__((section("sfrs"),address(0xBF82B2B8)));
extern volatile uint32_t        QEI1ICCINV __attribute__((section("sfrs"),address(0xBF82B2BC)));
#define QEI1CMPL QEI1CMPL
extern volatile uint32_t   QEI1CMPL __attribute__((section("sfrs"), address(0xBF82B2C0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI1CMPLbits_t;
extern volatile __QEI1CMPLbits_t QEI1CMPLbits __asm__ ("QEI1CMPL") __attribute__((section("sfrs"), address(0xBF82B2C0)));
extern volatile uint32_t        QEI1CMPLCLR __attribute__((section("sfrs"),address(0xBF82B2C4)));
extern volatile uint32_t        QEI1CMPLSET __attribute__((section("sfrs"),address(0xBF82B2C8)));
extern volatile uint32_t        QEI1CMPLINV __attribute__((section("sfrs"),address(0xBF82B2CC)));
#define QEI2CON QEI2CON
extern volatile uint32_t   QEI2CON __attribute__((section("sfrs"), address(0xBF82B400)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI2CONbits_t;
extern volatile __QEI2CONbits_t QEI2CONbits __asm__ ("QEI2CON") __attribute__((section("sfrs"), address(0xBF82B400)));
extern volatile uint32_t        QEI2CONCLR __attribute__((section("sfrs"),address(0xBF82B404)));
extern volatile uint32_t        QEI2CONSET __attribute__((section("sfrs"),address(0xBF82B408)));
extern volatile uint32_t        QEI2CONINV __attribute__((section("sfrs"),address(0xBF82B40C)));
#define QEI2IOC QEI2IOC
extern volatile uint32_t   QEI2IOC __attribute__((section("sfrs"), address(0xBF82B410)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI2IOCbits_t;
extern volatile __QEI2IOCbits_t QEI2IOCbits __asm__ ("QEI2IOC") __attribute__((section("sfrs"), address(0xBF82B410)));
extern volatile uint32_t        QEI2IOCCLR __attribute__((section("sfrs"),address(0xBF82B414)));
extern volatile uint32_t        QEI2IOCSET __attribute__((section("sfrs"),address(0xBF82B418)));
extern volatile uint32_t        QEI2IOCINV __attribute__((section("sfrs"),address(0xBF82B41C)));
#define QEI2STAT QEI2STAT
extern volatile uint32_t   QEI2STAT __attribute__((section("sfrs"), address(0xBF82B420)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI2STATbits_t;
extern volatile __QEI2STATbits_t QEI2STATbits __asm__ ("QEI2STAT") __attribute__((section("sfrs"), address(0xBF82B420)));
extern volatile uint32_t        QEI2STATCLR __attribute__((section("sfrs"),address(0xBF82B424)));
extern volatile uint32_t        QEI2STATSET __attribute__((section("sfrs"),address(0xBF82B428)));
extern volatile uint32_t        QEI2STATINV __attribute__((section("sfrs"),address(0xBF82B42C)));
#define POS2CNT POS2CNT
extern volatile uint32_t   POS2CNT __attribute__((section("sfrs"), address(0xBF82B430)));
typedef struct {
  uint32_t POSCNT:32;
} __POS2CNTbits_t;
extern volatile __POS2CNTbits_t POS2CNTbits __asm__ ("POS2CNT") __attribute__((section("sfrs"), address(0xBF82B430)));
extern volatile uint32_t        POS2CNTCLR __attribute__((section("sfrs"),address(0xBF82B434)));
extern volatile uint32_t        POS2CNTSET __attribute__((section("sfrs"),address(0xBF82B438)));
extern volatile uint32_t        POS2CNTINV __attribute__((section("sfrs"),address(0xBF82B43C)));
#define POS2HLD POS2HLD
extern volatile uint32_t   POS2HLD __attribute__((section("sfrs"), address(0xBF82B440)));
typedef struct {
  uint32_t POSHLD:32;
} __POS2HLDbits_t;
extern volatile __POS2HLDbits_t POS2HLDbits __asm__ ("POS2HLD") __attribute__((section("sfrs"), address(0xBF82B440)));
extern volatile uint32_t        POS2HLDCLR __attribute__((section("sfrs"),address(0xBF82B444)));
extern volatile uint32_t        POS2HLDSET __attribute__((section("sfrs"),address(0xBF82B448)));
extern volatile uint32_t        POS2HLDINV __attribute__((section("sfrs"),address(0xBF82B44C)));
#define VEL2CNT VEL2CNT
extern volatile uint32_t   VEL2CNT __attribute__((section("sfrs"), address(0xBF82B450)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL2CNTbits_t;
extern volatile __VEL2CNTbits_t VEL2CNTbits __asm__ ("VEL2CNT") __attribute__((section("sfrs"), address(0xBF82B450)));
extern volatile uint32_t        VEL2CNTCLR __attribute__((section("sfrs"),address(0xBF82B454)));
extern volatile uint32_t        VEL2CNTSET __attribute__((section("sfrs"),address(0xBF82B458)));
extern volatile uint32_t        VEL2CNTINV __attribute__((section("sfrs"),address(0xBF82B45C)));
#define VEL2HLD VEL2HLD
extern volatile uint32_t   VEL2HLD __attribute__((section("sfrs"), address(0xBF82B460)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL2HLDbits_t;
extern volatile __VEL2HLDbits_t VEL2HLDbits __asm__ ("VEL2HLD") __attribute__((section("sfrs"), address(0xBF82B460)));
extern volatile uint32_t        VEL2HLDCLR __attribute__((section("sfrs"),address(0xBF82B464)));
extern volatile uint32_t        VEL2HLDSET __attribute__((section("sfrs"),address(0xBF82B468)));
extern volatile uint32_t        VEL2HLDINV __attribute__((section("sfrs"),address(0xBF82B46C)));
#define INT2TMR INT2TMR
extern volatile uint32_t   INT2TMR __attribute__((section("sfrs"), address(0xBF82B470)));
typedef struct {
  uint32_t INTTMR:32;
} __INT2TMRbits_t;
extern volatile __INT2TMRbits_t INT2TMRbits __asm__ ("INT2TMR") __attribute__((section("sfrs"), address(0xBF82B470)));
extern volatile uint32_t        INT2TMRCLR __attribute__((section("sfrs"),address(0xBF82B474)));
extern volatile uint32_t        INT2TMRSET __attribute__((section("sfrs"),address(0xBF82B478)));
extern volatile uint32_t        INT2TMRINV __attribute__((section("sfrs"),address(0xBF82B47C)));
#define INT2HLD INT2HLD
extern volatile uint32_t   INT2HLD __attribute__((section("sfrs"), address(0xBF82B480)));
typedef struct {
  uint32_t INTHLD:32;
} __INT2HLDbits_t;
extern volatile __INT2HLDbits_t INT2HLDbits __asm__ ("INT2HLD") __attribute__((section("sfrs"), address(0xBF82B480)));
extern volatile uint32_t        INT2HLDCLR __attribute__((section("sfrs"),address(0xBF82B484)));
extern volatile uint32_t        INT2HLDSET __attribute__((section("sfrs"),address(0xBF82B488)));
extern volatile uint32_t        INT2HLDINV __attribute__((section("sfrs"),address(0xBF82B48C)));
#define INDX2CNT INDX2CNT
extern volatile uint32_t   INDX2CNT __attribute__((section("sfrs"), address(0xBF82B490)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX2CNTbits_t;
extern volatile __INDX2CNTbits_t INDX2CNTbits __asm__ ("INDX2CNT") __attribute__((section("sfrs"), address(0xBF82B490)));
extern volatile uint32_t        INDX2CNTCLR __attribute__((section("sfrs"),address(0xBF82B494)));
extern volatile uint32_t        INDX2CNTSET __attribute__((section("sfrs"),address(0xBF82B498)));
extern volatile uint32_t        INDX2CNTINV __attribute__((section("sfrs"),address(0xBF82B49C)));
#define INDX2HLD INDX2HLD
extern volatile uint32_t   INDX2HLD __attribute__((section("sfrs"), address(0xBF82B4A0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX2HLDbits_t;
extern volatile __INDX2HLDbits_t INDX2HLDbits __asm__ ("INDX2HLD") __attribute__((section("sfrs"), address(0xBF82B4A0)));
extern volatile uint32_t        INDX2HLDCLR __attribute__((section("sfrs"),address(0xBF82B4A4)));
extern volatile uint32_t        INDX2HLDSET __attribute__((section("sfrs"),address(0xBF82B4A8)));
extern volatile uint32_t        INDX2HLDINV __attribute__((section("sfrs"),address(0xBF82B4AC)));
#define QEI2ICC QEI2ICC
extern volatile uint32_t   QEI2ICC __attribute__((section("sfrs"), address(0xBF82B4B0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI2ICCbits_t;
extern volatile __QEI2ICCbits_t QEI2ICCbits __asm__ ("QEI2ICC") __attribute__((section("sfrs"), address(0xBF82B4B0)));
extern volatile uint32_t        QEI2ICCCLR __attribute__((section("sfrs"),address(0xBF82B4B4)));
extern volatile uint32_t        QEI2ICCSET __attribute__((section("sfrs"),address(0xBF82B4B8)));
extern volatile uint32_t        QEI2ICCINV __attribute__((section("sfrs"),address(0xBF82B4BC)));
#define QEI2CMPL QEI2CMPL
extern volatile uint32_t   QEI2CMPL __attribute__((section("sfrs"), address(0xBF82B4C0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI2CMPLbits_t;
