Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __SPI3CON2bits_t SPI3CON2bits __asm__ ("SPI3CON2") __attribute__((section("sfrs"), address(0xBF847440)));
extern volatile uint32_t        SPI3CON2CLR __attribute__((section("sfrs"),address(0xBF847444)));
extern volatile uint32_t        SPI3CON2SET __attribute__((section("sfrs"),address(0xBF847448)));
extern volatile uint32_t        SPI3CON2INV __attribute__((section("sfrs"),address(0xBF84744C)));
#define SPI4CON SPI4CON
extern volatile uint32_t   SPI4CON __attribute__((section("sfrs"), address(0xBF847600)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI4CONbits_t;
extern volatile __SPI4CONbits_t SPI4CONbits __asm__ ("SPI4CON") __attribute__((section("sfrs"), address(0xBF847600)));
extern volatile uint32_t        SPI4CONCLR __attribute__((section("sfrs"),address(0xBF847604)));
extern volatile uint32_t        SPI4CONSET __attribute__((section("sfrs"),address(0xBF847608)));
extern volatile uint32_t        SPI4CONINV __attribute__((section("sfrs"),address(0xBF84760C)));
#define SPI4STAT SPI4STAT
extern volatile uint32_t   SPI4STAT __attribute__((section("sfrs"), address(0xBF847610)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI4STATbits_t;
extern volatile __SPI4STATbits_t SPI4STATbits __asm__ ("SPI4STAT") __attribute__((section("sfrs"), address(0xBF847610)));
extern volatile uint32_t        SPI4STATCLR __attribute__((section("sfrs"),address(0xBF847614)));
extern volatile uint32_t        SPI4STATSET __attribute__((section("sfrs"),address(0xBF847618)));
extern volatile uint32_t        SPI4STATINV __attribute__((section("sfrs"),address(0xBF84761C)));
#define SPI4BUF SPI4BUF
extern volatile uint32_t   SPI4BUF __attribute__((section("sfrs"), address(0xBF847620)));
#define SPI4BRG SPI4BRG
extern volatile uint32_t   SPI4BRG __attribute__((section("sfrs"), address(0xBF847630)));
extern volatile uint32_t        SPI4BRGCLR __attribute__((section("sfrs"),address(0xBF847634)));
extern volatile uint32_t        SPI4BRGSET __attribute__((section("sfrs"),address(0xBF847638)));
extern volatile uint32_t        SPI4BRGINV __attribute__((section("sfrs"),address(0xBF84763C)));
#define SPI4CON2 SPI4CON2
extern volatile uint32_t   SPI4CON2 __attribute__((section("sfrs"), address(0xBF847640)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI4CON2bits_t;
extern volatile __SPI4CON2bits_t SPI4CON2bits __asm__ ("SPI4CON2") __attribute__((section("sfrs"), address(0xBF847640)));
extern volatile uint32_t        SPI4CON2CLR __attribute__((section("sfrs"),address(0xBF847644)));
extern volatile uint32_t        SPI4CON2SET __attribute__((section("sfrs"),address(0xBF847648)));
extern volatile uint32_t        SPI4CON2INV __attribute__((section("sfrs"),address(0xBF84764C)));
#define SPI5CON SPI5CON
extern volatile uint32_t   SPI5CON __attribute__((section("sfrs"), address(0xBF847800)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI5CONbits_t;
extern volatile __SPI5CONbits_t SPI5CONbits __asm__ ("SPI5CON") __attribute__((section("sfrs"), address(0xBF847800)));
extern volatile uint32_t        SPI5CONCLR __attribute__((section("sfrs"),address(0xBF847804)));
extern volatile uint32_t        SPI5CONSET __attribute__((section("sfrs"),address(0xBF847808)));
extern volatile uint32_t        SPI5CONINV __attribute__((section("sfrs"),address(0xBF84780C)));
#define SPI5STAT SPI5STAT
extern volatile uint32_t   SPI5STAT __attribute__((section("sfrs"), address(0xBF847810)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI5STATbits_t;
extern volatile __SPI5STATbits_t SPI5STATbits __asm__ ("SPI5STAT") __attribute__((section("sfrs"), address(0xBF847810)));
extern volatile uint32_t        SPI5STATCLR __attribute__((section("sfrs"),address(0xBF847814)));
extern volatile uint32_t        SPI5STATSET __attribute__((section("sfrs"),address(0xBF847818)));
extern volatile uint32_t        SPI5STATINV __attribute__((section("sfrs"),address(0xBF84781C)));
#define SPI5BUF SPI5BUF
extern volatile uint32_t   SPI5BUF __attribute__((section("sfrs"), address(0xBF847820)));
#define SPI5BRG SPI5BRG
extern volatile uint32_t   SPI5BRG __attribute__((section("sfrs"), address(0xBF847830)));
extern volatile uint32_t        SPI5BRGCLR __attribute__((section("sfrs"),address(0xBF847834)));
extern volatile uint32_t        SPI5BRGSET __attribute__((section("sfrs"),address(0xBF847838)));
extern volatile uint32_t        SPI5BRGINV __attribute__((section("sfrs"),address(0xBF84783C)));
#define SPI5CON2 SPI5CON2
extern volatile uint32_t   SPI5CON2 __attribute__((section("sfrs"), address(0xBF847840)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI5CON2bits_t;
extern volatile __SPI5CON2bits_t SPI5CON2bits __asm__ ("SPI5CON2") __attribute__((section("sfrs"), address(0xBF847840)));
extern volatile uint32_t        SPI5CON2CLR __attribute__((section("sfrs"),address(0xBF847844)));
extern volatile uint32_t        SPI5CON2SET __attribute__((section("sfrs"),address(0xBF847848)));
extern volatile uint32_t        SPI5CON2INV __attribute__((section("sfrs"),address(0xBF84784C)));
#define SPI6CON SPI6CON
extern volatile uint32_t   SPI6CON __attribute__((section("sfrs"), address(0xBF847A00)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI6CONbits_t;
extern volatile __SPI6CONbits_t SPI6CONbits __asm__ ("SPI6CON") __attribute__((section("sfrs"), address(0xBF847A00)));
extern volatile uint32_t        SPI6CONCLR __attribute__((section("sfrs"),address(0xBF847A04)));
extern volatile uint32_t        SPI6CONSET __attribute__((section("sfrs"),address(0xBF847A08)));
extern volatile uint32_t        SPI6CONINV __attribute__((section("sfrs"),address(0xBF847A0C)));
#define SPI6STAT SPI6STAT
extern volatile uint32_t   SPI6STAT __attribute__((section("sfrs"), address(0xBF847A10)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI6STATbits_t;
extern volatile __SPI6STATbits_t SPI6STATbits __asm__ ("SPI6STAT") __attribute__((section("sfrs"), address(0xBF847A10)));
extern volatile uint32_t        SPI6STATCLR __attribute__((section("sfrs"),address(0xBF847A14)));
extern volatile uint32_t        SPI6STATSET __attribute__((section("sfrs"),address(0xBF847A18)));
extern volatile uint32_t        SPI6STATINV __attribute__((section("sfrs"),address(0xBF847A1C)));
#define SPI6BUF SPI6BUF
extern volatile uint32_t   SPI6BUF __attribute__((section("sfrs"), address(0xBF847A20)));
#define SPI6BRG SPI6BRG
extern volatile uint32_t   SPI6BRG __attribute__((section("sfrs"), address(0xBF847A30)));
extern volatile uint32_t        SPI6BRGCLR __attribute__((section("sfrs"),address(0xBF847A34)));
extern volatile uint32_t        SPI6BRGSET __attribute__((section("sfrs"),address(0xBF847A38)));
extern volatile uint32_t        SPI6BRGINV __attribute__((section("sfrs"),address(0xBF847A3C)));
#define SPI6CON2 SPI6CON2
extern volatile uint32_t   SPI6CON2 __attribute__((section("sfrs"), address(0xBF847A40)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI6CON2bits_t;
extern volatile __SPI6CON2bits_t SPI6CON2bits __asm__ ("SPI6CON2") __attribute__((section("sfrs"), address(0xBF847A40)));
extern volatile uint32_t        SPI6CON2CLR __attribute__((section("sfrs"),address(0xBF847A44)));
extern volatile uint32_t        SPI6CON2SET __attribute__((section("sfrs"),address(0xBF847A48)));
extern volatile uint32_t        SPI6CON2INV __attribute__((section("sfrs"),address(0xBF847A4C)));
#define U3MODE U3MODE
extern volatile uint32_t   U3MODE __attribute__((section("sfrs"), address(0xBF848400)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U3MODEbits_t;
extern volatile __U3MODEbits_t U3MODEbits __asm__ ("U3MODE") __attribute__((section("sfrs"), address(0xBF848400)));
extern volatile uint32_t        U3MODECLR __attribute__((section("sfrs"),address(0xBF848404)));
extern volatile uint32_t        U3MODESET __attribute__((section("sfrs"),address(0xBF848408)));
extern volatile uint32_t        U3MODEINV __attribute__((section("sfrs"),address(0xBF84840C)));
#define U3STA U3STA
extern volatile uint32_t   U3STA __attribute__((section("sfrs"), address(0xBF848410)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U3STAbits_t;
extern volatile __U3STAbits_t U3STAbits __asm__ ("U3STA") __attribute__((section("sfrs"), address(0xBF848410)));
extern volatile uint32_t        U3STACLR __attribute__((section("sfrs"),address(0xBF848414)));
extern volatile uint32_t        U3STASET __attribute__((section("sfrs"),address(0xBF848418)));
extern volatile uint32_t        U3STAINV __attribute__((section("sfrs"),address(0xBF84841C)));
#define U3TXREG U3TXREG
extern volatile uint32_t   U3TXREG __attribute__((section("sfrs"), address(0xBF848420)));
#define U3RXREG U3RXREG
extern volatile uint32_t   U3RXREG __attribute__((section("sfrs"), address(0xBF848430)));
#define U3BRG U3BRG
extern volatile uint32_t   U3BRG __attribute__((section("sfrs"), address(0xBF848440)));
typedef struct {
  uint32_t BRG:20;
} __U3BRGbits_t;
