Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __CFD2FIFOSTA23bits_t CFD2FIFOSTA23bits __asm__ ("CFD2FIFOSTA23") __attribute__((section("sfrs"), address(0xBF8815A0)));
extern volatile uint32_t        CFD2FIFOSTA23CLR __attribute__((section("sfrs"),address(0xBF8815A4)));
extern volatile uint32_t        CFD2FIFOSTA23SET __attribute__((section("sfrs"),address(0xBF8815A8)));
extern volatile uint32_t        CFD2FIFOSTA23INV __attribute__((section("sfrs"),address(0xBF8815AC)));
#define CFD2FIFOUA23 CFD2FIFOUA23
extern volatile uint32_t   CFD2FIFOUA23 __attribute__((section("sfrs"), address(0xBF8815B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA23bits_t;
extern volatile __CFD2FIFOUA23bits_t CFD2FIFOUA23bits __asm__ ("CFD2FIFOUA23") __attribute__((section("sfrs"), address(0xBF8815B0)));
extern volatile uint32_t        CFD2FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF8815B4)));
extern volatile uint32_t        CFD2FIFOUA23SET __attribute__((section("sfrs"),address(0xBF8815B8)));
extern volatile uint32_t        CFD2FIFOUA23INV __attribute__((section("sfrs"),address(0xBF8815BC)));
#define CFD2FIFOCON24 CFD2FIFOCON24
extern volatile uint32_t   CFD2FIFOCON24 __attribute__((section("sfrs"), address(0xBF8815C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON24bits_t;
extern volatile __CFD2FIFOCON24bits_t CFD2FIFOCON24bits __asm__ ("CFD2FIFOCON24") __attribute__((section("sfrs"), address(0xBF8815C0)));
extern volatile uint32_t        CFD2FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF8815C4)));
extern volatile uint32_t        CFD2FIFOCON24SET __attribute__((section("sfrs"),address(0xBF8815C8)));
extern volatile uint32_t        CFD2FIFOCON24INV __attribute__((section("sfrs"),address(0xBF8815CC)));
#define CFD2FIFOSTA24 CFD2FIFOSTA24
extern volatile uint32_t   CFD2FIFOSTA24 __attribute__((section("sfrs"), address(0xBF8815D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA24bits_t;
extern volatile __CFD2FIFOSTA24bits_t CFD2FIFOSTA24bits __asm__ ("CFD2FIFOSTA24") __attribute__((section("sfrs"), address(0xBF8815D0)));
extern volatile uint32_t        CFD2FIFOSTA24CLR __attribute__((section("sfrs"),address(0xBF8815D4)));
extern volatile uint32_t        CFD2FIFOSTA24SET __attribute__((section("sfrs"),address(0xBF8815D8)));
extern volatile uint32_t        CFD2FIFOSTA24INV __attribute__((section("sfrs"),address(0xBF8815DC)));
#define CFD2FIFOUA24 CFD2FIFOUA24
extern volatile uint32_t   CFD2FIFOUA24 __attribute__((section("sfrs"), address(0xBF8815E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA24bits_t;
extern volatile __CFD2FIFOUA24bits_t CFD2FIFOUA24bits __asm__ ("CFD2FIFOUA24") __attribute__((section("sfrs"), address(0xBF8815E0)));
extern volatile uint32_t        CFD2FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF8815E4)));
extern volatile uint32_t        CFD2FIFOUA24SET __attribute__((section("sfrs"),address(0xBF8815E8)));
extern volatile uint32_t        CFD2FIFOUA24INV __attribute__((section("sfrs"),address(0xBF8815EC)));
#define CFD2FIFOCON25 CFD2FIFOCON25
extern volatile uint32_t   CFD2FIFOCON25 __attribute__((section("sfrs"), address(0xBF8815F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON25bits_t;
extern volatile __CFD2FIFOCON25bits_t CFD2FIFOCON25bits __asm__ ("CFD2FIFOCON25") __attribute__((section("sfrs"), address(0xBF8815F0)));
extern volatile uint32_t        CFD2FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF8815F4)));
extern volatile uint32_t        CFD2FIFOCON25SET __attribute__((section("sfrs"),address(0xBF8815F8)));
extern volatile uint32_t        CFD2FIFOCON25INV __attribute__((section("sfrs"),address(0xBF8815FC)));
#define CFD2FIFOSTA25 CFD2FIFOSTA25
extern volatile uint32_t   CFD2FIFOSTA25 __attribute__((section("sfrs"), address(0xBF881600)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA25bits_t;
extern volatile __CFD2FIFOSTA25bits_t CFD2FIFOSTA25bits __asm__ ("CFD2FIFOSTA25") __attribute__((section("sfrs"), address(0xBF881600)));
extern volatile uint32_t        CFD2FIFOSTA25CLR __attribute__((section("sfrs"),address(0xBF881604)));
extern volatile uint32_t        CFD2FIFOSTA25SET __attribute__((section("sfrs"),address(0xBF881608)));
extern volatile uint32_t        CFD2FIFOSTA25INV __attribute__((section("sfrs"),address(0xBF88160C)));
#define CFD2FIFOUA25 CFD2FIFOUA25
extern volatile uint32_t   CFD2FIFOUA25 __attribute__((section("sfrs"), address(0xBF881610)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA25bits_t;
extern volatile __CFD2FIFOUA25bits_t CFD2FIFOUA25bits __asm__ ("CFD2FIFOUA25") __attribute__((section("sfrs"), address(0xBF881610)));
extern volatile uint32_t        CFD2FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF881614)));
extern volatile uint32_t        CFD2FIFOUA25SET __attribute__((section("sfrs"),address(0xBF881618)));
extern volatile uint32_t        CFD2FIFOUA25INV __attribute__((section("sfrs"),address(0xBF88161C)));
#define CFD2FIFOCON26 CFD2FIFOCON26
extern volatile uint32_t   CFD2FIFOCON26 __attribute__((section("sfrs"), address(0xBF881620)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON26bits_t;
extern volatile __CFD2FIFOCON26bits_t CFD2FIFOCON26bits __asm__ ("CFD2FIFOCON26") __attribute__((section("sfrs"), address(0xBF881620)));
extern volatile uint32_t        CFD2FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF881624)));
extern volatile uint32_t        CFD2FIFOCON26SET __attribute__((section("sfrs"),address(0xBF881628)));
extern volatile uint32_t        CFD2FIFOCON26INV __attribute__((section("sfrs"),address(0xBF88162C)));
#define CFD2FIFOSTA26 CFD2FIFOSTA26
extern volatile uint32_t   CFD2FIFOSTA26 __attribute__((section("sfrs"), address(0xBF881630)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA26bits_t;
extern volatile __CFD2FIFOSTA26bits_t CFD2FIFOSTA26bits __asm__ ("CFD2FIFOSTA26") __attribute__((section("sfrs"), address(0xBF881630)));
extern volatile uint32_t        CFD2FIFOSTA26CLR __attribute__((section("sfrs"),address(0xBF881634)));
extern volatile uint32_t        CFD2FIFOSTA26SET __attribute__((section("sfrs"),address(0xBF881638)));
extern volatile uint32_t        CFD2FIFOSTA26INV __attribute__((section("sfrs"),address(0xBF88163C)));
#define CFD2FIFOUA26 CFD2FIFOUA26
extern volatile uint32_t   CFD2FIFOUA26 __attribute__((section("sfrs"), address(0xBF881640)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA26bits_t;
extern volatile __CFD2FIFOUA26bits_t CFD2FIFOUA26bits __asm__ ("CFD2FIFOUA26") __attribute__((section("sfrs"), address(0xBF881640)));
extern volatile uint32_t        CFD2FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF881644)));
extern volatile uint32_t        CFD2FIFOUA26SET __attribute__((section("sfrs"),address(0xBF881648)));
extern volatile uint32_t        CFD2FIFOUA26INV __attribute__((section("sfrs"),address(0xBF88164C)));
#define CFD2FIFOCON27 CFD2FIFOCON27
extern volatile uint32_t   CFD2FIFOCON27 __attribute__((section("sfrs"), address(0xBF881650)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON27bits_t;
