Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __CFD3FIFOCON28bits_t CFD3FIFOCON28bits __asm__ ("CFD3FIFOCON28") __attribute__((section("sfrs"), address(0xBF884680)));
extern volatile uint32_t        CFD3FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF884684)));
extern volatile uint32_t        CFD3FIFOCON28SET __attribute__((section("sfrs"),address(0xBF884688)));
extern volatile uint32_t        CFD3FIFOCON28INV __attribute__((section("sfrs"),address(0xBF88468C)));
#define CFD3FIFOSTA28 CFD3FIFOSTA28
extern volatile uint32_t   CFD3FIFOSTA28 __attribute__((section("sfrs"), address(0xBF884690)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA28bits_t;
extern volatile __CFD3FIFOSTA28bits_t CFD3FIFOSTA28bits __asm__ ("CFD3FIFOSTA28") __attribute__((section("sfrs"), address(0xBF884690)));
extern volatile uint32_t        CFD3FIFOSTA28CLR __attribute__((section("sfrs"),address(0xBF884694)));
extern volatile uint32_t        CFD3FIFOSTA28SET __attribute__((section("sfrs"),address(0xBF884698)));
extern volatile uint32_t        CFD3FIFOSTA28INV __attribute__((section("sfrs"),address(0xBF88469C)));
#define CFD3FIFOUA28 CFD3FIFOUA28
extern volatile uint32_t   CFD3FIFOUA28 __attribute__((section("sfrs"), address(0xBF8846A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA28bits_t;
extern volatile __CFD3FIFOUA28bits_t CFD3FIFOUA28bits __asm__ ("CFD3FIFOUA28") __attribute__((section("sfrs"), address(0xBF8846A0)));
extern volatile uint32_t        CFD3FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF8846A4)));
extern volatile uint32_t        CFD3FIFOUA28SET __attribute__((section("sfrs"),address(0xBF8846A8)));
extern volatile uint32_t        CFD3FIFOUA28INV __attribute__((section("sfrs"),address(0xBF8846AC)));
#define CFD3FIFOCON29 CFD3FIFOCON29
extern volatile uint32_t   CFD3FIFOCON29 __attribute__((section("sfrs"), address(0xBF8846B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON29bits_t;
extern volatile __CFD3FIFOCON29bits_t CFD3FIFOCON29bits __asm__ ("CFD3FIFOCON29") __attribute__((section("sfrs"), address(0xBF8846B0)));
extern volatile uint32_t        CFD3FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF8846B4)));
extern volatile uint32_t        CFD3FIFOCON29SET __attribute__((section("sfrs"),address(0xBF8846B8)));
extern volatile uint32_t        CFD3FIFOCON29INV __attribute__((section("sfrs"),address(0xBF8846BC)));
#define CFD3FIFOSTA29 CFD3FIFOSTA29
extern volatile uint32_t   CFD3FIFOSTA29 __attribute__((section("sfrs"), address(0xBF8846C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA29bits_t;
extern volatile __CFD3FIFOSTA29bits_t CFD3FIFOSTA29bits __asm__ ("CFD3FIFOSTA29") __attribute__((section("sfrs"), address(0xBF8846C0)));
extern volatile uint32_t        CFD3FIFOSTA29CLR __attribute__((section("sfrs"),address(0xBF8846C4)));
extern volatile uint32_t        CFD3FIFOSTA29SET __attribute__((section("sfrs"),address(0xBF8846C8)));
extern volatile uint32_t        CFD3FIFOSTA29INV __attribute__((section("sfrs"),address(0xBF8846CC)));
#define CFD3FIFOUA29 CFD3FIFOUA29
extern volatile uint32_t   CFD3FIFOUA29 __attribute__((section("sfrs"), address(0xBF8846D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA29bits_t;
extern volatile __CFD3FIFOUA29bits_t CFD3FIFOUA29bits __asm__ ("CFD3FIFOUA29") __attribute__((section("sfrs"), address(0xBF8846D0)));
extern volatile uint32_t        CFD3FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF8846D4)));
extern volatile uint32_t        CFD3FIFOUA29SET __attribute__((section("sfrs"),address(0xBF8846D8)));
extern volatile uint32_t        CFD3FIFOUA29INV __attribute__((section("sfrs"),address(0xBF8846DC)));
#define CFD3FIFOCON30 CFD3FIFOCON30
extern volatile uint32_t   CFD3FIFOCON30 __attribute__((section("sfrs"), address(0xBF8846E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON30bits_t;
extern volatile __CFD3FIFOCON30bits_t CFD3FIFOCON30bits __asm__ ("CFD3FIFOCON30") __attribute__((section("sfrs"), address(0xBF8846E0)));
extern volatile uint32_t        CFD3FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF8846E4)));
extern volatile uint32_t        CFD3FIFOCON30SET __attribute__((section("sfrs"),address(0xBF8846E8)));
extern volatile uint32_t        CFD3FIFOCON30INV __attribute__((section("sfrs"),address(0xBF8846EC)));
#define CFD3FIFOSTA30 CFD3FIFOSTA30
extern volatile uint32_t   CFD3FIFOSTA30 __attribute__((section("sfrs"), address(0xBF8846F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA30bits_t;
extern volatile __CFD3FIFOSTA30bits_t CFD3FIFOSTA30bits __asm__ ("CFD3FIFOSTA30") __attribute__((section("sfrs"), address(0xBF8846F0)));
extern volatile uint32_t        CFD3FIFOSTA30CLR __attribute__((section("sfrs"),address(0xBF8846F4)));
extern volatile uint32_t        CFD3FIFOSTA30SET __attribute__((section("sfrs"),address(0xBF8846F8)));
extern volatile uint32_t        CFD3FIFOSTA30INV __attribute__((section("sfrs"),address(0xBF8846FC)));
#define CFD3FIFOUA30 CFD3FIFOUA30
extern volatile uint32_t   CFD3FIFOUA30 __attribute__((section("sfrs"), address(0xBF884700)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA30bits_t;
