Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __CFD3FLTOBJ16bits_t CFD3FLTOBJ16bits __asm__ ("CFD3FLTOBJ16") __attribute__((section("sfrs"), address(0xBF8849C0)));
extern volatile uint32_t        CFD3FLTOBJ16CLR __attribute__((section("sfrs"),address(0xBF8849C4)));
extern volatile uint32_t        CFD3FLTOBJ16SET __attribute__((section("sfrs"),address(0xBF8849C8)));
extern volatile uint32_t        CFD3FLTOBJ16INV __attribute__((section("sfrs"),address(0xBF8849CC)));
#define CFD3MASK16 CFD3MASK16
extern volatile uint32_t   CFD3MASK16 __attribute__((section("sfrs"), address(0xBF8849D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK16bits_t;
extern volatile __CFD3MASK16bits_t CFD3MASK16bits __asm__ ("CFD3MASK16") __attribute__((section("sfrs"), address(0xBF8849D0)));
extern volatile uint32_t        CFD3MASK16CLR __attribute__((section("sfrs"),address(0xBF8849D4)));
extern volatile uint32_t        CFD3MASK16SET __attribute__((section("sfrs"),address(0xBF8849D8)));
extern volatile uint32_t        CFD3MASK16INV __attribute__((section("sfrs"),address(0xBF8849DC)));
#define CFD3FLTOBJ17 CFD3FLTOBJ17
extern volatile uint32_t   CFD3FLTOBJ17 __attribute__((section("sfrs"), address(0xBF8849E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ17bits_t;
extern volatile __CFD3FLTOBJ17bits_t CFD3FLTOBJ17bits __asm__ ("CFD3FLTOBJ17") __attribute__((section("sfrs"), address(0xBF8849E0)));
extern volatile uint32_t        CFD3FLTOBJ17CLR __attribute__((section("sfrs"),address(0xBF8849E4)));
extern volatile uint32_t        CFD3FLTOBJ17SET __attribute__((section("sfrs"),address(0xBF8849E8)));
extern volatile uint32_t        CFD3FLTOBJ17INV __attribute__((section("sfrs"),address(0xBF8849EC)));
#define CFD3MASK17 CFD3MASK17
extern volatile uint32_t   CFD3MASK17 __attribute__((section("sfrs"), address(0xBF8849F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK17bits_t;
extern volatile __CFD3MASK17bits_t CFD3MASK17bits __asm__ ("CFD3MASK17") __attribute__((section("sfrs"), address(0xBF8849F0)));
extern volatile uint32_t        CFD3MASK17CLR __attribute__((section("sfrs"),address(0xBF8849F4)));
extern volatile uint32_t        CFD3MASK17SET __attribute__((section("sfrs"),address(0xBF8849F8)));
extern volatile uint32_t        CFD3MASK17INV __attribute__((section("sfrs"),address(0xBF8849FC)));
#define CFD3FLTOBJ18 CFD3FLTOBJ18
extern volatile uint32_t   CFD3FLTOBJ18 __attribute__((section("sfrs"), address(0xBF884A00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ18bits_t;
extern volatile __CFD3FLTOBJ18bits_t CFD3FLTOBJ18bits __asm__ ("CFD3FLTOBJ18") __attribute__((section("sfrs"), address(0xBF884A00)));
extern volatile uint32_t        CFD3FLTOBJ18CLR __attribute__((section("sfrs"),address(0xBF884A04)));
extern volatile uint32_t        CFD3FLTOBJ18SET __attribute__((section("sfrs"),address(0xBF884A08)));
extern volatile uint32_t        CFD3FLTOBJ18INV __attribute__((section("sfrs"),address(0xBF884A0C)));
#define CFD3MASK18 CFD3MASK18
extern volatile uint32_t   CFD3MASK18 __attribute__((section("sfrs"), address(0xBF884A10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK18bits_t;
extern volatile __CFD3MASK18bits_t CFD3MASK18bits __asm__ ("CFD3MASK18") __attribute__((section("sfrs"), address(0xBF884A10)));
extern volatile uint32_t        CFD3MASK18CLR __attribute__((section("sfrs"),address(0xBF884A14)));
extern volatile uint32_t        CFD3MASK18SET __attribute__((section("sfrs"),address(0xBF884A18)));
extern volatile uint32_t        CFD3MASK18INV __attribute__((section("sfrs"),address(0xBF884A1C)));
#define CFD3FLTOBJ19 CFD3FLTOBJ19
extern volatile uint32_t   CFD3FLTOBJ19 __attribute__((section("sfrs"), address(0xBF884A20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ19bits_t;
extern volatile __CFD3FLTOBJ19bits_t CFD3FLTOBJ19bits __asm__ ("CFD3FLTOBJ19") __attribute__((section("sfrs"), address(0xBF884A20)));
extern volatile uint32_t        CFD3FLTOBJ19CLR __attribute__((section("sfrs"),address(0xBF884A24)));
extern volatile uint32_t        CFD3FLTOBJ19SET __attribute__((section("sfrs"),address(0xBF884A28)));
extern volatile uint32_t        CFD3FLTOBJ19INV __attribute__((section("sfrs"),address(0xBF884A2C)));
#define CFD3MASK19 CFD3MASK19
extern volatile uint32_t   CFD3MASK19 __attribute__((section("sfrs"), address(0xBF884A30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK19bits_t;
extern volatile __CFD3MASK19bits_t CFD3MASK19bits __asm__ ("CFD3MASK19") __attribute__((section("sfrs"), address(0xBF884A30)));
extern volatile uint32_t        CFD3MASK19CLR __attribute__((section("sfrs"),address(0xBF884A34)));
extern volatile uint32_t        CFD3MASK19SET __attribute__((section("sfrs"),address(0xBF884A38)));
extern volatile uint32_t        CFD3MASK19INV __attribute__((section("sfrs"),address(0xBF884A3C)));
#define CFD3FLTOBJ20 CFD3FLTOBJ20
extern volatile uint32_t   CFD3FLTOBJ20 __attribute__((section("sfrs"), address(0xBF884A40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ20bits_t;
extern volatile __CFD3FLTOBJ20bits_t CFD3FLTOBJ20bits __asm__ ("CFD3FLTOBJ20") __attribute__((section("sfrs"), address(0xBF884A40)));
extern volatile uint32_t        CFD3FLTOBJ20CLR __attribute__((section("sfrs"),address(0xBF884A44)));
extern volatile uint32_t        CFD3FLTOBJ20SET __attribute__((section("sfrs"),address(0xBF884A48)));
extern volatile uint32_t        CFD3FLTOBJ20INV __attribute__((section("sfrs"),address(0xBF884A4C)));
#define CFD3MASK20 CFD3MASK20
extern volatile uint32_t   CFD3MASK20 __attribute__((section("sfrs"), address(0xBF884A50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK20bits_t;
