Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __CFD3MASK20bits_t CFD3MASK20bits __asm__ ("CFD3MASK20") __attribute__((section("sfrs"), address(0xBF884A50)));
extern volatile uint32_t        CFD3MASK20CLR __attribute__((section("sfrs"),address(0xBF884A54)));
extern volatile uint32_t        CFD3MASK20SET __attribute__((section("sfrs"),address(0xBF884A58)));
extern volatile uint32_t        CFD3MASK20INV __attribute__((section("sfrs"),address(0xBF884A5C)));
#define CFD3FLTOBJ21 CFD3FLTOBJ21
extern volatile uint32_t   CFD3FLTOBJ21 __attribute__((section("sfrs"), address(0xBF884A60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ21bits_t;
extern volatile __CFD3FLTOBJ21bits_t CFD3FLTOBJ21bits __asm__ ("CFD3FLTOBJ21") __attribute__((section("sfrs"), address(0xBF884A60)));
extern volatile uint32_t        CFD3FLTOBJ21CLR __attribute__((section("sfrs"),address(0xBF884A64)));
extern volatile uint32_t        CFD3FLTOBJ21SET __attribute__((section("sfrs"),address(0xBF884A68)));
extern volatile uint32_t        CFD3FLTOBJ21INV __attribute__((section("sfrs"),address(0xBF884A6C)));
#define CFD3MASK21 CFD3MASK21
extern volatile uint32_t   CFD3MASK21 __attribute__((section("sfrs"), address(0xBF884A70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK21bits_t;
extern volatile __CFD3MASK21bits_t CFD3MASK21bits __asm__ ("CFD3MASK21") __attribute__((section("sfrs"), address(0xBF884A70)));
extern volatile uint32_t        CFD3MASK21CLR __attribute__((section("sfrs"),address(0xBF884A74)));
extern volatile uint32_t        CFD3MASK21SET __attribute__((section("sfrs"),address(0xBF884A78)));
extern volatile uint32_t        CFD3MASK21INV __attribute__((section("sfrs"),address(0xBF884A7C)));
#define CFD3FLTOBJ22 CFD3FLTOBJ22
extern volatile uint32_t   CFD3FLTOBJ22 __attribute__((section("sfrs"), address(0xBF884A80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ22bits_t;
extern volatile __CFD3FLTOBJ22bits_t CFD3FLTOBJ22bits __asm__ ("CFD3FLTOBJ22") __attribute__((section("sfrs"), address(0xBF884A80)));
extern volatile uint32_t        CFD3FLTOBJ22CLR __attribute__((section("sfrs"),address(0xBF884A84)));
extern volatile uint32_t        CFD3FLTOBJ22SET __attribute__((section("sfrs"),address(0xBF884A88)));
extern volatile uint32_t        CFD3FLTOBJ22INV __attribute__((section("sfrs"),address(0xBF884A8C)));
#define CFD3MASK22 CFD3MASK22
extern volatile uint32_t   CFD3MASK22 __attribute__((section("sfrs"), address(0xBF884A90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK22bits_t;
extern volatile __CFD3MASK22bits_t CFD3MASK22bits __asm__ ("CFD3MASK22") __attribute__((section("sfrs"), address(0xBF884A90)));
extern volatile uint32_t        CFD3MASK22CLR __attribute__((section("sfrs"),address(0xBF884A94)));
extern volatile uint32_t        CFD3MASK22SET __attribute__((section("sfrs"),address(0xBF884A98)));
extern volatile uint32_t        CFD3MASK22INV __attribute__((section("sfrs"),address(0xBF884A9C)));
#define CFD3FLTOBJ23 CFD3FLTOBJ23
extern volatile uint32_t   CFD3FLTOBJ23 __attribute__((section("sfrs"), address(0xBF884AA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ23bits_t;
extern volatile __CFD3FLTOBJ23bits_t CFD3FLTOBJ23bits __asm__ ("CFD3FLTOBJ23") __attribute__((section("sfrs"), address(0xBF884AA0)));
extern volatile uint32_t        CFD3FLTOBJ23CLR __attribute__((section("sfrs"),address(0xBF884AA4)));
extern volatile uint32_t        CFD3FLTOBJ23SET __attribute__((section("sfrs"),address(0xBF884AA8)));
extern volatile uint32_t        CFD3FLTOBJ23INV __attribute__((section("sfrs"),address(0xBF884AAC)));
#define CFD3MASK23 CFD3MASK23
extern volatile uint32_t   CFD3MASK23 __attribute__((section("sfrs"), address(0xBF884AB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK23bits_t;
extern volatile __CFD3MASK23bits_t CFD3MASK23bits __asm__ ("CFD3MASK23") __attribute__((section("sfrs"), address(0xBF884AB0)));
extern volatile uint32_t        CFD3MASK23CLR __attribute__((section("sfrs"),address(0xBF884AB4)));
extern volatile uint32_t        CFD3MASK23SET __attribute__((section("sfrs"),address(0xBF884AB8)));
extern volatile uint32_t        CFD3MASK23INV __attribute__((section("sfrs"),address(0xBF884ABC)));
#define CFD3FLTOBJ24 CFD3FLTOBJ24
extern volatile uint32_t   CFD3FLTOBJ24 __attribute__((section("sfrs"), address(0xBF884AC0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ24bits_t;
extern volatile __CFD3FLTOBJ24bits_t CFD3FLTOBJ24bits __asm__ ("CFD3FLTOBJ24") __attribute__((section("sfrs"), address(0xBF884AC0)));
extern volatile uint32_t        CFD3FLTOBJ24CLR __attribute__((section("sfrs"),address(0xBF884AC4)));
extern volatile uint32_t        CFD3FLTOBJ24SET __attribute__((section("sfrs"),address(0xBF884AC8)));
extern volatile uint32_t        CFD3FLTOBJ24INV __attribute__((section("sfrs"),address(0xBF884ACC)));
#define CFD3MASK24 CFD3MASK24
extern volatile uint32_t   CFD3MASK24 __attribute__((section("sfrs"), address(0xBF884AD0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK24bits_t;
extern volatile __CFD3MASK24bits_t CFD3MASK24bits __asm__ ("CFD3MASK24") __attribute__((section("sfrs"), address(0xBF884AD0)));
extern volatile uint32_t        CFD3MASK24CLR __attribute__((section("sfrs"),address(0xBF884AD4)));
extern volatile uint32_t        CFD3MASK24SET __attribute__((section("sfrs"),address(0xBF884AD8)));
extern volatile uint32_t        CFD3MASK24INV __attribute__((section("sfrs"),address(0xBF884ADC)));
#define CFD3FLTOBJ25 CFD3FLTOBJ25
extern volatile uint32_t   CFD3FLTOBJ25 __attribute__((section("sfrs"), address(0xBF884AE0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ25bits_t;
extern volatile __CFD3FLTOBJ25bits_t CFD3FLTOBJ25bits __asm__ ("CFD3FLTOBJ25") __attribute__((section("sfrs"), address(0xBF884AE0)));
extern volatile uint32_t        CFD3FLTOBJ25CLR __attribute__((section("sfrs"),address(0xBF884AE4)));
extern volatile uint32_t        CFD3FLTOBJ25SET __attribute__((section("sfrs"),address(0xBF884AE8)));
extern volatile uint32_t        CFD3FLTOBJ25INV __attribute__((section("sfrs"),address(0xBF884AEC)));
#define CFD3MASK25 CFD3MASK25
extern volatile uint32_t   CFD3MASK25 __attribute__((section("sfrs"), address(0xBF884AF0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK25bits_t;
extern volatile __CFD3MASK25bits_t CFD3MASK25bits __asm__ ("CFD3MASK25") __attribute__((section("sfrs"), address(0xBF884AF0)));
extern volatile uint32_t        CFD3MASK25CLR __attribute__((section("sfrs"),address(0xBF884AF4)));
extern volatile uint32_t        CFD3MASK25SET __attribute__((section("sfrs"),address(0xBF884AF8)));
extern volatile uint32_t        CFD3MASK25INV __attribute__((section("sfrs"),address(0xBF884AFC)));
#define CFD3FLTOBJ26 CFD3FLTOBJ26
extern volatile uint32_t   CFD3FLTOBJ26 __attribute__((section("sfrs"), address(0xBF884B00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ26bits_t;
