Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __CFD3FLTOBJ26bits_t CFD3FLTOBJ26bits __asm__ ("CFD3FLTOBJ26") __attribute__((section("sfrs"), address(0xBF884B00)));
extern volatile uint32_t        CFD3FLTOBJ26CLR __attribute__((section("sfrs"),address(0xBF884B04)));
extern volatile uint32_t        CFD3FLTOBJ26SET __attribute__((section("sfrs"),address(0xBF884B08)));
extern volatile uint32_t        CFD3FLTOBJ26INV __attribute__((section("sfrs"),address(0xBF884B0C)));
#define CFD3MASK26 CFD3MASK26
extern volatile uint32_t   CFD3MASK26 __attribute__((section("sfrs"), address(0xBF884B10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK26bits_t;
extern volatile __CFD3MASK26bits_t CFD3MASK26bits __asm__ ("CFD3MASK26") __attribute__((section("sfrs"), address(0xBF884B10)));
extern volatile uint32_t        CFD3MASK26CLR __attribute__((section("sfrs"),address(0xBF884B14)));
extern volatile uint32_t        CFD3MASK26SET __attribute__((section("sfrs"),address(0xBF884B18)));
extern volatile uint32_t        CFD3MASK26INV __attribute__((section("sfrs"),address(0xBF884B1C)));
#define CFD3FLTOBJ27 CFD3FLTOBJ27
extern volatile uint32_t   CFD3FLTOBJ27 __attribute__((section("sfrs"), address(0xBF884B20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ27bits_t;
extern volatile __CFD3FLTOBJ27bits_t CFD3FLTOBJ27bits __asm__ ("CFD3FLTOBJ27") __attribute__((section("sfrs"), address(0xBF884B20)));
extern volatile uint32_t        CFD3FLTOBJ27CLR __attribute__((section("sfrs"),address(0xBF884B24)));
extern volatile uint32_t        CFD3FLTOBJ27SET __attribute__((section("sfrs"),address(0xBF884B28)));
extern volatile uint32_t        CFD3FLTOBJ27INV __attribute__((section("sfrs"),address(0xBF884B2C)));
#define CFD3MASK27 CFD3MASK27
extern volatile uint32_t   CFD3MASK27 __attribute__((section("sfrs"), address(0xBF884B30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK27bits_t;
extern volatile __CFD3MASK27bits_t CFD3MASK27bits __asm__ ("CFD3MASK27") __attribute__((section("sfrs"), address(0xBF884B30)));
extern volatile uint32_t        CFD3MASK27CLR __attribute__((section("sfrs"),address(0xBF884B34)));
extern volatile uint32_t        CFD3MASK27SET __attribute__((section("sfrs"),address(0xBF884B38)));
extern volatile uint32_t        CFD3MASK27INV __attribute__((section("sfrs"),address(0xBF884B3C)));
#define CFD3FLTOBJ28 CFD3FLTOBJ28
extern volatile uint32_t   CFD3FLTOBJ28 __attribute__((section("sfrs"), address(0xBF884B40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ28bits_t;
extern volatile __CFD3FLTOBJ28bits_t CFD3FLTOBJ28bits __asm__ ("CFD3FLTOBJ28") __attribute__((section("sfrs"), address(0xBF884B40)));
extern volatile uint32_t        CFD3FLTOBJ28CLR __attribute__((section("sfrs"),address(0xBF884B44)));
extern volatile uint32_t        CFD3FLTOBJ28SET __attribute__((section("sfrs"),address(0xBF884B48)));
extern volatile uint32_t        CFD3FLTOBJ28INV __attribute__((section("sfrs"),address(0xBF884B4C)));
#define CFD3MASK28 CFD3MASK28
extern volatile uint32_t   CFD3MASK28 __attribute__((section("sfrs"), address(0xBF884B50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK28bits_t;
extern volatile __CFD3MASK28bits_t CFD3MASK28bits __asm__ ("CFD3MASK28") __attribute__((section("sfrs"), address(0xBF884B50)));
extern volatile uint32_t        CFD3MASK28CLR __attribute__((section("sfrs"),address(0xBF884B54)));
extern volatile uint32_t        CFD3MASK28SET __attribute__((section("sfrs"),address(0xBF884B58)));
extern volatile uint32_t        CFD3MASK28INV __attribute__((section("sfrs"),address(0xBF884B5C)));
#define CFD3FLTOBJ29 CFD3FLTOBJ29
extern volatile uint32_t   CFD3FLTOBJ29 __attribute__((section("sfrs"), address(0xBF884B60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ29bits_t;
extern volatile __CFD3FLTOBJ29bits_t CFD3FLTOBJ29bits __asm__ ("CFD3FLTOBJ29") __attribute__((section("sfrs"), address(0xBF884B60)));
extern volatile uint32_t        CFD3FLTOBJ29CLR __attribute__((section("sfrs"),address(0xBF884B64)));
extern volatile uint32_t        CFD3FLTOBJ29SET __attribute__((section("sfrs"),address(0xBF884B68)));
extern volatile uint32_t        CFD3FLTOBJ29INV __attribute__((section("sfrs"),address(0xBF884B6C)));
#define CFD3MASK29 CFD3MASK29
extern volatile uint32_t   CFD3MASK29 __attribute__((section("sfrs"), address(0xBF884B70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK29bits_t;
extern volatile __CFD3MASK29bits_t CFD3MASK29bits __asm__ ("CFD3MASK29") __attribute__((section("sfrs"), address(0xBF884B70)));
extern volatile uint32_t        CFD3MASK29CLR __attribute__((section("sfrs"),address(0xBF884B74)));
extern volatile uint32_t        CFD3MASK29SET __attribute__((section("sfrs"),address(0xBF884B78)));
extern volatile uint32_t        CFD3MASK29INV __attribute__((section("sfrs"),address(0xBF884B7C)));
#define CFD3FLTOBJ30 CFD3FLTOBJ30
extern volatile uint32_t   CFD3FLTOBJ30 __attribute__((section("sfrs"), address(0xBF884B80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ30bits_t;
extern volatile __CFD3FLTOBJ30bits_t CFD3FLTOBJ30bits __asm__ ("CFD3FLTOBJ30") __attribute__((section("sfrs"), address(0xBF884B80)));
extern volatile uint32_t        CFD3FLTOBJ30CLR __attribute__((section("sfrs"),address(0xBF884B84)));
extern volatile uint32_t        CFD3FLTOBJ30SET __attribute__((section("sfrs"),address(0xBF884B88)));
extern volatile uint32_t        CFD3FLTOBJ30INV __attribute__((section("sfrs"),address(0xBF884B8C)));
#define CFD3MASK30 CFD3MASK30
extern volatile uint32_t   CFD3MASK30 __attribute__((section("sfrs"), address(0xBF884B90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK30bits_t;
extern volatile __CFD3MASK30bits_t CFD3MASK30bits __asm__ ("CFD3MASK30") __attribute__((section("sfrs"), address(0xBF884B90)));
extern volatile uint32_t        CFD3MASK30CLR __attribute__((section("sfrs"),address(0xBF884B94)));
extern volatile uint32_t        CFD3MASK30SET __attribute__((section("sfrs"),address(0xBF884B98)));
extern volatile uint32_t        CFD3MASK30INV __attribute__((section("sfrs"),address(0xBF884B9C)));
#define CFD3FLTOBJ31 CFD3FLTOBJ31
extern volatile uint32_t   CFD3FLTOBJ31 __attribute__((section("sfrs"), address(0xBF884BA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ31bits_t;
extern volatile __CFD3FLTOBJ31bits_t CFD3FLTOBJ31bits __asm__ ("CFD3FLTOBJ31") __attribute__((section("sfrs"), address(0xBF884BA0)));
extern volatile uint32_t        CFD3FLTOBJ31CLR __attribute__((section("sfrs"),address(0xBF884BA4)));
extern volatile uint32_t        CFD3FLTOBJ31SET __attribute__((section("sfrs"),address(0xBF884BA8)));
extern volatile uint32_t        CFD3FLTOBJ31INV __attribute__((section("sfrs"),address(0xBF884BAC)));
#define CFD3MASK31 CFD3MASK31
extern volatile uint32_t   CFD3MASK31 __attribute__((section("sfrs"), address(0xBF884BB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK31bits_t;
extern volatile __CFD3MASK31bits_t CFD3MASK31bits __asm__ ("CFD3MASK31") __attribute__((section("sfrs"), address(0xBF884BB0)));
extern volatile uint32_t        CFD3MASK31CLR __attribute__((section("sfrs"),address(0xBF884BB4)));
extern volatile uint32_t        CFD3MASK31SET __attribute__((section("sfrs"),address(0xBF884BB8)));
extern volatile uint32_t        CFD3MASK31INV __attribute__((section("sfrs"),address(0xBF884BBC)));
#define CFD4CON CFD4CON
extern volatile uint32_t   CFD4CON __attribute__((section("sfrs"), address(0xBF885000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t ISOCRCEN:1;
    uint32_t PXEDIS:1;
    uint32_t CLKSEL0:1;
    uint32_t WAKFIL:1;
    uint32_t WFT:2;
    uint32_t BUSY:1;
    uint32_t BRSDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t RTXAT:1;
    uint32_t ESIGM:1;
    uint32_t SERR2LOM:1;
    uint32_t STEF:1;
    uint32_t TXQEN:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
    uint32_t TXBWS:4;
  };
  struct {
    uint32_t w:32;
  };
} __CFD4CONbits_t;
extern volatile __CFD4CONbits_t CFD4CONbits __asm__ ("CFD4CON") __attribute__((section("sfrs"), address(0xBF885000)));
extern volatile uint32_t        CFD4CONCLR __attribute__((section("sfrs"),address(0xBF885004)));
extern volatile uint32_t        CFD4CONSET __attribute__((section("sfrs"),address(0xBF885008)));
extern volatile uint32_t        CFD4CONINV __attribute__((section("sfrs"),address(0xBF88500C)));
#define CFD4NBTCFG CFD4NBTCFG
extern volatile uint32_t   CFD4NBTCFG __attribute__((section("sfrs"), address(0xBF885010)));
typedef struct {
  uint32_t SJW:7;
  uint32_t :1;
  uint32_t TSEG2:7;
  uint32_t :1;
  uint32_t TSEG1:8;
  uint32_t BRP:8;
} __CFD4NBTCFGbits_t;
extern volatile __CFD4NBTCFGbits_t CFD4NBTCFGbits __asm__ ("CFD4NBTCFG") __attribute__((section("sfrs"), address(0xBF885010)));
extern volatile uint32_t        CFD4NBTCFGCLR __attribute__((section("sfrs"),address(0xBF885014)));
extern volatile uint32_t        CFD4NBTCFGSET __attribute__((section("sfrs"),address(0xBF885018)));
extern volatile uint32_t        CFD4NBTCFGINV __attribute__((section("sfrs"),address(0xBF88501C)));
#define CFD4DBTCFG CFD4DBTCFG
extern volatile uint32_t   CFD4DBTCFG __attribute__((section("sfrs"), address(0xBF885020)));
typedef struct {
  uint32_t SJW:4;
  uint32_t :4;
  uint32_t TSEG2:4;
  uint32_t :4;
  uint32_t TSEG1:5;
  uint32_t :3;
  uint32_t BRP:8;
} __CFD4DBTCFGbits_t;
