Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
extern volatile __CFD4FIFOUA28bits_t CFD4FIFOUA28bits __asm__ ("CFD4FIFOUA28") __attribute__((section("sfrs"), address(0xBF8856A0)));
extern volatile uint32_t        CFD4FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF8856A4)));
extern volatile uint32_t        CFD4FIFOUA28SET __attribute__((section("sfrs"),address(0xBF8856A8)));
extern volatile uint32_t        CFD4FIFOUA28INV __attribute__((section("sfrs"),address(0xBF8856AC)));
#define CFD4FIFOCON29 CFD4FIFOCON29
extern volatile uint32_t   CFD4FIFOCON29 __attribute__((section("sfrs"), address(0xBF8856B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON29bits_t;
extern volatile __CFD4FIFOCON29bits_t CFD4FIFOCON29bits __asm__ ("CFD4FIFOCON29") __attribute__((section("sfrs"), address(0xBF8856B0)));
extern volatile uint32_t        CFD4FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF8856B4)));
extern volatile uint32_t        CFD4FIFOCON29SET __attribute__((section("sfrs"),address(0xBF8856B8)));
extern volatile uint32_t        CFD4FIFOCON29INV __attribute__((section("sfrs"),address(0xBF8856BC)));
#define CFD4FIFOSTA29 CFD4FIFOSTA29
extern volatile uint32_t   CFD4FIFOSTA29 __attribute__((section("sfrs"), address(0xBF8856C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA29bits_t;
extern volatile __CFD4FIFOSTA29bits_t CFD4FIFOSTA29bits __asm__ ("CFD4FIFOSTA29") __attribute__((section("sfrs"), address(0xBF8856C0)));
extern volatile uint32_t        CFD4FIFOSTA29CLR __attribute__((section("sfrs"),address(0xBF8856C4)));
extern volatile uint32_t        CFD4FIFOSTA29SET __attribute__((section("sfrs"),address(0xBF8856C8)));
extern volatile uint32_t        CFD4FIFOSTA29INV __attribute__((section("sfrs"),address(0xBF8856CC)));
#define CFD4FIFOUA29 CFD4FIFOUA29
extern volatile uint32_t   CFD4FIFOUA29 __attribute__((section("sfrs"), address(0xBF8856D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA29bits_t;
extern volatile __CFD4FIFOUA29bits_t CFD4FIFOUA29bits __asm__ ("CFD4FIFOUA29") __attribute__((section("sfrs"), address(0xBF8856D0)));
extern volatile uint32_t        CFD4FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF8856D4)));
extern volatile uint32_t        CFD4FIFOUA29SET __attribute__((section("sfrs"),address(0xBF8856D8)));
extern volatile uint32_t        CFD4FIFOUA29INV __attribute__((section("sfrs"),address(0xBF8856DC)));
#define CFD4FIFOCON30 CFD4FIFOCON30
extern volatile uint32_t   CFD4FIFOCON30 __attribute__((section("sfrs"), address(0xBF8856E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON30bits_t;
extern volatile __CFD4FIFOCON30bits_t CFD4FIFOCON30bits __asm__ ("CFD4FIFOCON30") __attribute__((section("sfrs"), address(0xBF8856E0)));
extern volatile uint32_t        CFD4FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF8856E4)));
extern volatile uint32_t        CFD4FIFOCON30SET __attribute__((section("sfrs"),address(0xBF8856E8)));
extern volatile uint32_t        CFD4FIFOCON30INV __attribute__((section("sfrs"),address(0xBF8856EC)));
#define CFD4FIFOSTA30 CFD4FIFOSTA30
extern volatile uint32_t   CFD4FIFOSTA30 __attribute__((section("sfrs"), address(0xBF8856F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA30bits_t;
extern volatile __CFD4FIFOSTA30bits_t CFD4FIFOSTA30bits __asm__ ("CFD4FIFOSTA30") __attribute__((section("sfrs"), address(0xBF8856F0)));
extern volatile uint32_t        CFD4FIFOSTA30CLR __attribute__((section("sfrs"),address(0xBF8856F4)));
extern volatile uint32_t        CFD4FIFOSTA30SET __attribute__((section("sfrs"),address(0xBF8856F8)));
extern volatile uint32_t        CFD4FIFOSTA30INV __attribute__((section("sfrs"),address(0xBF8856FC)));
#define CFD4FIFOUA30 CFD4FIFOUA30
extern volatile uint32_t   CFD4FIFOUA30 __attribute__((section("sfrs"), address(0xBF885700)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA30bits_t;
extern volatile __CFD4FIFOUA30bits_t CFD4FIFOUA30bits __asm__ ("CFD4FIFOUA30") __attribute__((section("sfrs"), address(0xBF885700)));
extern volatile uint32_t        CFD4FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF885704)));
extern volatile uint32_t        CFD4FIFOUA30SET __attribute__((section("sfrs"),address(0xBF885708)));
extern volatile uint32_t        CFD4FIFOUA30INV __attribute__((section("sfrs"),address(0xBF88570C)));
#define CFD4FIFOCON31 CFD4FIFOCON31
extern volatile uint32_t   CFD4FIFOCON31 __attribute__((section("sfrs"), address(0xBF885710)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON31bits_t;
extern volatile __CFD4FIFOCON31bits_t CFD4FIFOCON31bits __asm__ ("CFD4FIFOCON31") __attribute__((section("sfrs"), address(0xBF885710)));
extern volatile uint32_t        CFD4FIFOCON31CLR __attribute__((section("sfrs"),address(0xBF885714)));
extern volatile uint32_t        CFD4FIFOCON31SET __attribute__((section("sfrs"),address(0xBF885718)));
extern volatile uint32_t        CFD4FIFOCON31INV __attribute__((section("sfrs"),address(0xBF88571C)));
#define CFD4FIFOSTA31 CFD4FIFOSTA31
extern volatile uint32_t   CFD4FIFOSTA31 __attribute__((section("sfrs"), address(0xBF885720)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA31bits_t;
extern volatile __CFD4FIFOSTA31bits_t CFD4FIFOSTA31bits __asm__ ("CFD4FIFOSTA31") __attribute__((section("sfrs"), address(0xBF885720)));
extern volatile uint32_t        CFD4FIFOSTA31CLR __attribute__((section("sfrs"),address(0xBF885724)));
extern volatile uint32_t        CFD4FIFOSTA31SET __attribute__((section("sfrs"),address(0xBF885728)));
extern volatile uint32_t        CFD4FIFOSTA31INV __attribute__((section("sfrs"),address(0xBF88572C)));
#define CFD4FIFOUA31 CFD4FIFOUA31
extern volatile uint32_t   CFD4FIFOUA31 __attribute__((section("sfrs"), address(0xBF885730)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA31bits_t;
