Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern DCH2DATCLR       /* 0xBF811294 */
  .extern DCH2DATSET       /* 0xBF811298 */
  .extern DCH2DATINV       /* 0xBF81129C */
  .extern DCH3CON          /* 0xBF8112A0 */
  .extern DCH3CONCLR       /* 0xBF8112A4 */
  .extern DCH3CONSET       /* 0xBF8112A8 */
  .extern DCH3CONINV       /* 0xBF8112AC */
  .extern DCH3ECON         /* 0xBF8112B0 */
  .extern DCH3ECONCLR      /* 0xBF8112B4 */
  .extern DCH3ECONSET      /* 0xBF8112B8 */
  .extern DCH3ECONINV      /* 0xBF8112BC */
  .extern DCH3INT          /* 0xBF8112C0 */
  .extern DCH3INTCLR       /* 0xBF8112C4 */
  .extern DCH3INTSET       /* 0xBF8112C8 */
  .extern DCH3INTINV       /* 0xBF8112CC */
  .extern DCH3SSA          /* 0xBF8112D0 */
  .extern DCH3SSACLR       /* 0xBF8112D4 */
  .extern DCH3SSASET       /* 0xBF8112D8 */
  .extern DCH3SSAINV       /* 0xBF8112DC */
  .extern DCH3DSA          /* 0xBF8112E0 */
  .extern DCH3DSACLR       /* 0xBF8112E4 */
  .extern DCH3DSASET       /* 0xBF8112E8 */
  .extern DCH3DSAINV       /* 0xBF8112EC */
  .extern DCH3SSIZ         /* 0xBF8112F0 */
  .extern DCH3SSIZCLR      /* 0xBF8112F4 */
  .extern DCH3SSIZSET      /* 0xBF8112F8 */
  .extern DCH3SSIZINV      /* 0xBF8112FC */
  .extern DCH3DSIZ         /* 0xBF811300 */
  .extern DCH3DSIZCLR      /* 0xBF811304 */
  .extern DCH3DSIZSET      /* 0xBF811308 */
  .extern DCH3DSIZINV      /* 0xBF81130C */
  .extern DCH3SPTR         /* 0xBF811310 */
  .extern DCH3SPTRCLR      /* 0xBF811314 */
  .extern DCH3SPTRSET      /* 0xBF811318 */
  .extern DCH3SPTRINV      /* 0xBF81131C */
  .extern DCH3DPTR         /* 0xBF811320 */
  .extern DCH3DPTRCLR      /* 0xBF811324 */
  .extern DCH3DPTRSET      /* 0xBF811328 */
  .extern DCH3DPTRINV      /* 0xBF81132C */
  .extern DCH3CSIZ         /* 0xBF811330 */
  .extern DCH3CSIZCLR      /* 0xBF811334 */
  .extern DCH3CSIZSET      /* 0xBF811338 */
  .extern DCH3CSIZINV      /* 0xBF81133C */
  .extern DCH3CPTR         /* 0xBF811340 */
  .extern DCS3CPTR         /* 0xBF811340 */
  .extern DCH3CPTRCLR      /* 0xBF811344 */
  .extern DCS3CPTRCLR      /* 0xBF811344 */
  .extern DCH3CPTRSET      /* 0xBF811348 */
  .extern DCS3CPTRSET      /* 0xBF811348 */
  .extern DCH3CPTRINV      /* 0xBF81134C */
  .extern DCS3CPTRINV      /* 0xBF81134C */
  .extern DCH3DAT          /* 0xBF811350 */
  .extern DCH3DATCLR       /* 0xBF811354 */
  .extern DCH3DATSET       /* 0xBF811358 */
  .extern DCH3DATINV       /* 0xBF81135C */
  .extern DCH4CON          /* 0xBF811360 */
  .extern DCH4CONCLR       /* 0xBF811364 */
  .extern DCH4CONSET       /* 0xBF811368 */
  .extern DCH4CONINV       /* 0xBF81136C */
  .extern DCH4ECON         /* 0xBF811370 */
  .extern DCH4ECONCLR      /* 0xBF811374 */
  .extern DCH4ECONSET      /* 0xBF811378 */
  .extern DCH4ECONINV      /* 0xBF81137C */
  .extern DCH4INT          /* 0xBF811380 */
  .extern DCH4INTCLR       /* 0xBF811384 */
  .extern DCH4INTSET       /* 0xBF811388 */
  .extern DCH4INTINV       /* 0xBF81138C */
  .extern DCH4SSA          /* 0xBF811390 */
  .extern DCH4SSACLR       /* 0xBF811394 */
  .extern DCH4SSASET       /* 0xBF811398 */
  .extern DCH4SSAINV       /* 0xBF81139C */
  .extern DCH4DSA          /* 0xBF8113A0 */
  .extern DCH4DSACLR       /* 0xBF8113A4 */
  .extern DCH4DSASET       /* 0xBF8113A8 */
  .extern DCH4DSAINV       /* 0xBF8113AC */
  .extern DCH4SSIZ         /* 0xBF8113B0 */
  .extern DCH4SSIZCLR      /* 0xBF8113B4 */
  .extern DCH4SSIZSET      /* 0xBF8113B8 */
  .extern DCH4SSIZINV      /* 0xBF8113BC */
  .extern DCH4DSIZ         /* 0xBF8113C0 */
  .extern DCH4DSIZCLR      /* 0xBF8113C4 */
  .extern DCH4DSIZSET      /* 0xBF8113C8 */
  .extern DCH4DSIZINV      /* 0xBF8113CC */
  .extern DCH4SPTR         /* 0xBF8113D0 */
  .extern DCH4SPTRCLR      /* 0xBF8113D4 */
  .extern DCH4SPTRSET      /* 0xBF8113D8 */
  .extern DCH4SPTRINV      /* 0xBF8113DC */
  .extern DCH4DPTR         /* 0xBF8113E0 */
  .extern DCH4DPTRCLR      /* 0xBF8113E4 */
  .extern DCH4DPTRSET      /* 0xBF8113E8 */
  .extern DCH4DPTRINV      /* 0xBF8113EC */
  .extern DCH4CSIZ         /* 0xBF8113F0 */
  .extern DCH4CSIZCLR      /* 0xBF8113F4 */
  .extern DCH4CSIZSET      /* 0xBF8113F8 */
  .extern DCH4CSIZINV      /* 0xBF8113FC */
  .extern DCH4CPTR         /* 0xBF811400 */
  .extern DCS4CPTR         /* 0xBF811400 */
  .extern DCH4CPTRCLR      /* 0xBF811404 */
  .extern DCS4CPTRCLR      /* 0xBF811404 */
  .extern DCH4CPTRSET      /* 0xBF811408 */
  .extern DCS4CPTRSET      /* 0xBF811408 */
  .extern DCH4CPTRINV      /* 0xBF81140C */
  .extern DCS4CPTRINV      /* 0xBF81140C */
  .extern DCH4DAT          /* 0xBF811410 */
  .extern DCH4DATCLR       /* 0xBF811414 */
  .extern DCH4DATSET       /* 0xBF811418 */
  .extern DCH4DATINV       /* 0xBF81141C */
  .extern DCH5CON          /* 0xBF811420 */
  .extern DCH5CONCLR       /* 0xBF811424 */
  .extern DCH5CONSET       /* 0xBF811428 */
  .extern DCH5CONINV       /* 0xBF81142C */
  .extern DCH5ECON         /* 0xBF811430 */
  .extern DCH5ECONCLR      /* 0xBF811434 */
  .extern DCH5ECONSET      /* 0xBF811438 */
  .extern DCH5ECONINV      /* 0xBF81143C */
  .extern DCH5INT          /* 0xBF811440 */
  .extern DCH5INTCLR       /* 0xBF811444 */
  .extern DCH5INTSET       /* 0xBF811448 */
  .extern DCH5INTINV       /* 0xBF81144C */
  .extern DCH5SSA          /* 0xBF811450 */
  .extern DCH5SSACLR       /* 0xBF811454 */
  .extern DCH5SSASET       /* 0xBF811458 */
  .extern DCH5SSAINV       /* 0xBF81145C */
  .extern DCH5DSA          /* 0xBF811460 */
  .extern DCH5DSACLR       /* 0xBF811464 */
  .extern DCH5DSASET       /* 0xBF811468 */
  .extern DCH5DSAINV       /* 0xBF81146C */
  .extern DCH5SSIZ         /* 0xBF811470 */
  .extern DCH5SSIZCLR      /* 0xBF811474 */
  .extern DCH5SSIZSET      /* 0xBF811478 */
  .extern DCH5SSIZINV      /* 0xBF81147C */
  .extern DCH5DSIZ         /* 0xBF811480 */
  .extern DCH5DSIZCLR      /* 0xBF811484 */
  .extern DCH5DSIZSET      /* 0xBF811488 */
  .extern DCH5DSIZINV      /* 0xBF81148C */
  .extern DCH5SPTR         /* 0xBF811490 */
  .extern DCH5SPTRCLR      /* 0xBF811494 */
  .extern DCH5SPTRSET      /* 0xBF811498 */
  .extern DCH5SPTRINV      /* 0xBF81149C */
  .extern DCH5DPTR         /* 0xBF8114A0 */
  .extern DCH5DPTRCLR      /* 0xBF8114A4 */
  .extern DCH5DPTRSET      /* 0xBF8114A8 */
  .extern DCH5DPTRINV      /* 0xBF8114AC */
  .extern DCH5CSIZ         /* 0xBF8114B0 */
  .extern DCH5CSIZCLR      /* 0xBF8114B4 */
  .extern DCH5CSIZSET      /* 0xBF8114B8 */
  .extern DCH5CSIZINV      /* 0xBF8114BC */
  .extern DCH5CPTR         /* 0xBF8114C0 */
  .extern DCS5CPTR         /* 0xBF8114C0 */
  .extern DCH5CPTRCLR      /* 0xBF8114C4 */
  .extern DCS5CPTRCLR      /* 0xBF8114C4 */
  .extern DCH5CPTRSET      /* 0xBF8114C8 */
  .extern DCS5CPTRSET      /* 0xBF8114C8 */
  .extern DCH5CPTRINV      /* 0xBF8114CC */
  .extern DCS5CPTRINV      /* 0xBF8114CC */
  .extern DCH5DAT          /* 0xBF8114D0 */
  .extern DCH5DATCLR       /* 0xBF8114D4 */
  .extern DCH5DATSET       /* 0xBF8114D8 */
  .extern DCH5DATINV       /* 0xBF8114DC */
  .extern DCH6CON          /* 0xBF8114E0 */
  .extern DCH6CONCLR       /* 0xBF8114E4 */
  .extern DCH6CONSET       /* 0xBF8114E8 */
  .extern DCH6CONINV       /* 0xBF8114EC */
  .extern DCH6ECON         /* 0xBF8114F0 */
  .extern DCH6ECONCLR      /* 0xBF8114F4 */
  .extern DCH6ECONSET      /* 0xBF8114F8 */
  .extern DCH6ECONINV      /* 0xBF8114FC */
  .extern DCH6INT          /* 0xBF811500 */
  .extern DCH6INTCLR       /* 0xBF811504 */
  .extern DCH6INTSET       /* 0xBF811508 */
  .extern DCH6INTINV       /* 0xBF81150C */
  .extern DCH6SSA          /* 0xBF811510 */
  .extern DCH6SSACLR       /* 0xBF811514 */
  .extern DCH6SSASET       /* 0xBF811518 */
  .extern DCH6SSAINV       /* 0xBF81151C */
  .extern DCH6DSA          /* 0xBF811520 */
  .extern DCH6DSACLR       /* 0xBF811524 */
  .extern DCH6DSASET       /* 0xBF811528 */
  .extern DCH6DSAINV       /* 0xBF81152C */
  .extern DCH6SSIZ         /* 0xBF811530 */
  .extern DCH6SSIZCLR      /* 0xBF811534 */
  .extern DCH6SSIZSET      /* 0xBF811538 */
  .extern DCH6SSIZINV      /* 0xBF81153C */
  .extern DCH6DSIZ         /* 0xBF811540 */
  .extern DCH6DSIZCLR      /* 0xBF811544 */
  .extern DCH6DSIZSET      /* 0xBF811548 */
  .extern DCH6DSIZINV      /* 0xBF81154C */
  .extern DCH6SPTR         /* 0xBF811550 */
  .extern DCH6SPTRCLR      /* 0xBF811554 */
  .extern DCH6SPTRSET      /* 0xBF811558 */
  .extern DCH6SPTRINV      /* 0xBF81155C */
  .extern DCH6DPTR         /* 0xBF811560 */
  .extern DCH6DPTRCLR      /* 0xBF811564 */
  .extern DCH6DPTRSET      /* 0xBF811568 */
  .extern DCH6DPTRINV      /* 0xBF81156C */
  .extern DCH6CSIZ         /* 0xBF811570 */
  .extern DCH6CSIZCLR      /* 0xBF811574 */
  .extern DCH6CSIZSET      /* 0xBF811578 */
  .extern DCH6CSIZINV      /* 0xBF81157C */
  .extern DCH6CPTR         /* 0xBF811580 */
  .extern DCS6CPTR         /* 0xBF811580 */
  .extern DCH6CPTRCLR      /* 0xBF811584 */
  .extern DCS6CPTRCLR      /* 0xBF811584 */
  .extern DCH6CPTRSET      /* 0xBF811588 */
  .extern DCS6CPTRSET      /* 0xBF811588 */
  .extern DCH6CPTRINV      /* 0xBF81158C */
  .extern DCS6CPTRINV      /* 0xBF81158C */
  .extern DCH6DAT          /* 0xBF811590 */
  .extern DCH6DATCLR       /* 0xBF811594 */
  .extern DCH6DATSET       /* 0xBF811598 */
  .extern DCH6DATINV       /* 0xBF81159C */
  .extern DCH7CON          /* 0xBF8115A0 */
  .extern DCH7CONCLR       /* 0xBF8115A4 */
  .extern DCH7CONSET       /* 0xBF8115A8 */
  .extern DCH7CONINV       /* 0xBF8115AC */
  .extern DCH7ECON         /* 0xBF8115B0 */
  .extern DCH7ECONCLR      /* 0xBF8115B4 */
  .extern DCH7ECONSET      /* 0xBF8115B8 */
  .extern DCH7ECONINV      /* 0xBF8115BC */
  .extern DCH7INT          /* 0xBF8115C0 */
  .extern DCH7INTCLR       /* 0xBF8115C4 */
  .extern DCH7INTSET       /* 0xBF8115C8 */
  .extern DCH7INTINV       /* 0xBF8115CC */
  .extern DCH7SSA          /* 0xBF8115D0 */
  .extern DCH7SSACLR       /* 0xBF8115D4 */
  .extern DCH7SSASET       /* 0xBF8115D8 */
  .extern DCH7SSAINV       /* 0xBF8115DC */
  .extern DCH7DSA          /* 0xBF8115E0 */
  .extern DCH7DSACLR       /* 0xBF8115E4 */
  .extern DCH7DSASET       /* 0xBF8115E8 */
  .extern DCH7DSAINV       /* 0xBF8115EC */
  .extern DCH7SSIZ         /* 0xBF8115F0 */
  .extern DCH7SSIZCLR      /* 0xBF8115F4 */
  .extern DCH7SSIZSET      /* 0xBF8115F8 */
  .extern DCH7SSIZINV      /* 0xBF8115FC */
  .extern DCH7DSIZ         /* 0xBF811600 */
  .extern DCH7DSIZCLR      /* 0xBF811604 */
  .extern DCH7DSIZSET      /* 0xBF811608 */
  .extern DCH7DSIZINV      /* 0xBF81160C */
  .extern DCH7SPTR         /* 0xBF811610 */
  .extern DCH7SPTRCLR      /* 0xBF811614 */
  .extern DCH7SPTRSET      /* 0xBF811618 */
  .extern DCH7SPTRINV      /* 0xBF81161C */
  .extern DCH7DPTR         /* 0xBF811620 */
  .extern DCH7DPTRCLR      /* 0xBF811624 */
  .extern DCH7DPTRSET      /* 0xBF811628 */
  .extern DCH7DPTRINV      /* 0xBF81162C */
  .extern DCH7CSIZ         /* 0xBF811630 */
  .extern DCH7CSIZCLR      /* 0xBF811634 */
  .extern DCH7CSIZSET      /* 0xBF811638 */
  .extern DCH7CSIZINV      /* 0xBF81163C */
  .extern DCH7CPTR         /* 0xBF811640 */
  .extern DCS7CPTR         /* 0xBF811640 */
  .extern DCH7CPTRCLR      /* 0xBF811644 */
  .extern DCS7CPTRCLR      /* 0xBF811644 */
  .extern DCH7CPTRSET      /* 0xBF811648 */
  .extern DCS7CPTRSET      /* 0xBF811648 */
  .extern DCH7CPTRINV      /* 0xBF81164C */
  .extern DCS7CPTRINV      /* 0xBF81164C */
  .extern DCH7DAT          /* 0xBF811650 */
  .extern DCH7DATCLR       /* 0xBF811654 */
  .extern DCH7DATSET       /* 0xBF811658 */
  .extern DCH7DATINV       /* 0xBF81165C */
  .extern T1CON            /* 0xBF820000 */
  .extern T1CONCLR         /* 0xBF820004 */
  .extern T1CONSET         /* 0xBF820008 */
  .extern T1CONINV         /* 0xBF82000C */
  .extern TMR1             /* 0xBF820010 */
  .extern TMR1CLR          /* 0xBF820014 */
  .extern TMR1SET          /* 0xBF820018 */
  .extern TMR1INV          /* 0xBF82001C */
  .extern PR1              /* 0xBF820020 */
  .extern PR1CLR           /* 0xBF820024 */
  .extern PR1SET           /* 0xBF820028 */
  .extern PR1INV           /* 0xBF82002C */
  .extern T2CON            /* 0xBF820200 */
  .extern T2CONCLR         /* 0xBF820204 */
  .extern T2CONSET         /* 0xBF820208 */
  .extern T2CONINV         /* 0xBF82020C */
  .extern TMR2             /* 0xBF820210 */
  .extern TMR2CLR          /* 0xBF820214 */
  .extern TMR2SET          /* 0xBF820218 */
  .extern TMR2INV          /* 0xBF82021C */
  .extern PR2              /* 0xBF820220 */
  .extern PR2CLR           /* 0xBF820224 */
  .extern PR2SET           /* 0xBF820228 */
  .extern PR2INV           /* 0xBF82022C */
  .extern T3CON            /* 0xBF820400 */
  .extern T3CONCLR         /* 0xBF820404 */
  .extern T3CONSET         /* 0xBF820408 */
  .extern T3CONINV         /* 0xBF82040C */
  .extern TMR3             /* 0xBF820410 */
  .extern TMR3CLR          /* 0xBF820414 */
  .extern TMR3SET          /* 0xBF820418 */
  .extern TMR3INV          /* 0xBF82041C */
  .extern PR3              /* 0xBF820420 */
  .extern PR3CLR           /* 0xBF820424 */
  .extern PR3SET           /* 0xBF820428 */
  .extern PR3INV           /* 0xBF82042C */
  .extern T4CON            /* 0xBF820600 */
  .extern T4CONCLR         /* 0xBF820604 */
  .extern T4CONSET         /* 0xBF820608 */
  .extern T4CONINV         /* 0xBF82060C */
  .extern TMR4             /* 0xBF820610 */
  .extern TMR4CLR          /* 0xBF820614 */
  .extern TMR4SET          /* 0xBF820618 */
  .extern TMR4INV          /* 0xBF82061C */
  .extern PR4              /* 0xBF820620 */
  .extern PR4CLR           /* 0xBF820624 */
  .extern PR4SET           /* 0xBF820628 */
  .extern PR4INV           /* 0xBF82062C */
  .extern T5CON            /* 0xBF820800 */
  .extern T5CONCLR         /* 0xBF820804 */
  .extern T5CONSET         /* 0xBF820808 */
  .extern T5CONINV         /* 0xBF82080C */
  .extern TMR5             /* 0xBF820810 */
  .extern TMR5CLR          /* 0xBF820814 */
  .extern TMR5SET          /* 0xBF820818 */
  .extern TMR5INV          /* 0xBF82081C */
  .extern PR5              /* 0xBF820820 */
  .extern PR5CLR           /* 0xBF820824 */
  .extern PR5SET           /* 0xBF820828 */
  .extern PR5INV           /* 0xBF82082C */
  .extern T6CON            /* 0xBF820A00 */
  .extern T6CONCLR         /* 0xBF820A04 */
  .extern T6CONSET         /* 0xBF820A08 */
  .extern T6CONINV         /* 0xBF820A0C */
  .extern TMR6             /* 0xBF820A10 */
  .extern TMR6CLR          /* 0xBF820A14 */
  .extern TMR6SET          /* 0xBF820A18 */
  .extern TMR6INV          /* 0xBF820A1C */
  .extern PR6              /* 0xBF820A20 */
  .extern PR6CLR           /* 0xBF820A24 */
  .extern PR6SET           /* 0xBF820A28 */
  .extern PR6INV           /* 0xBF820A2C */
  .extern T7CON            /* 0xBF820C00 */
  .extern T7CONCLR         /* 0xBF820C04 */
  .extern T7CONSET         /* 0xBF820C08 */
  .extern T7CONINV         /* 0xBF820C0C */
  .extern TMR7             /* 0xBF820C10 */
  .extern TMR7CLR          /* 0xBF820C14 */
  .extern TMR7SET          /* 0xBF820C18 */
  .extern TMR7INV          /* 0xBF820C1C */
  .extern PR7              /* 0xBF820C20 */
  .extern PR7CLR           /* 0xBF820C24 */
  .extern PR7SET           /* 0xBF820C28 */
  .extern PR7INV           /* 0xBF820C2C */
  .extern T8CON            /* 0xBF820E00 */
  .extern T8CONCLR         /* 0xBF820E04 */
  .extern T8CONSET         /* 0xBF820E08 */
  .extern T8CONINV         /* 0xBF820E0C */
  .extern TMR8             /* 0xBF820E10 */
  .extern TMR8CLR          /* 0xBF820E14 */
  .extern TMR8SET          /* 0xBF820E18 */
  .extern TMR8INV          /* 0xBF820E1C */
  .extern PR8              /* 0xBF820E20 */
  .extern PR8CLR           /* 0xBF820E24 */
  .extern PR8SET           /* 0xBF820E28 */
  .extern PR8INV           /* 0xBF820E2C */
  .extern T9CON            /* 0xBF821000 */
  .extern T9CONCLR         /* 0xBF821004 */
  .extern T9CONSET         /* 0xBF821008 */
  .extern T9CONINV         /* 0xBF82100C */
  .extern TMR9             /* 0xBF821010 */
  .extern TMR9CLR          /* 0xBF821014 */
  .extern TMR9SET          /* 0xBF821018 */
  .extern TMR9INV          /* 0xBF82101C */
  .extern PR9              /* 0xBF821020 */
  .extern PR9CLR           /* 0xBF821024 */
  .extern PR9SET           /* 0xBF821028 */
  .extern PR9INV           /* 0xBF82102C */
  .extern IC1CON           /* 0xBF822000 */
  .extern IC1CONCLR        /* 0xBF822004 */
  .extern IC1CONSET        /* 0xBF822008 */
  .extern IC1CONINV        /* 0xBF82200C */
  .extern IC1BUF           /* 0xBF822010 */
  .extern IC2CON           /* 0xBF822200 */
  .extern IC2CONCLR        /* 0xBF822204 */
  .extern IC2CONSET        /* 0xBF822208 */
  .extern IC2CONINV        /* 0xBF82220C */
  .extern IC2BUF           /* 0xBF822210 */
  .extern IC3CON           /* 0xBF822400 */
  .extern IC3CONCLR        /* 0xBF822404 */
  .extern IC3CONSET        /* 0xBF822408 */
  .extern IC3CONINV        /* 0xBF82240C */
  .extern IC3BUF           /* 0xBF822410 */
  .extern IC4CON           /* 0xBF822600 */
  .extern IC4CONCLR        /* 0xBF822604 */
  .extern IC4CONSET        /* 0xBF822608 */
  .extern IC4CONINV        /* 0xBF82260C */
  .extern IC4BUF           /* 0xBF822610 */
  .extern IC5CON           /* 0xBF822800 */
  .extern IC5CONCLR        /* 0xBF822804 */
  .extern IC5CONSET        /* 0xBF822808 */
  .extern IC5CONINV        /* 0xBF82280C */
  .extern IC5BUF           /* 0xBF822810 */
  .extern IC6CON           /* 0xBF822A00 */
  .extern IC6CONCLR        /* 0xBF822A04 */
  .extern IC6CONSET        /* 0xBF822A08 */
  .extern IC6CONINV        /* 0xBF822A0C */
  .extern IC6BUF           /* 0xBF822A10 */
  .extern IC7CON           /* 0xBF822C00 */
  .extern IC7CONCLR        /* 0xBF822C04 */
  .extern IC7CONSET        /* 0xBF822C08 */
  .extern IC7CONINV        /* 0xBF822C0C */
  .extern IC7BUF           /* 0xBF822C10 */
  .extern IC8CON           /* 0xBF822E00 */
  .extern IC8CONCLR        /* 0xBF822E04 */
  .extern IC8CONSET        /* 0xBF822E08 */
  .extern IC8CONINV        /* 0xBF822E0C */
  .extern IC8BUF           /* 0xBF822E10 */
  .extern IC9CON           /* 0xBF823000 */
  .extern IC9CONCLR        /* 0xBF823004 */
  .extern IC9CONSET        /* 0xBF823008 */
  .extern IC9CONINV        /* 0xBF82300C */
  .extern IC9BUF           /* 0xBF823010 */
  .extern OC1CON           /* 0xBF824000 */
  .extern OC1CONCLR        /* 0xBF824004 */
  .extern OC1CONSET        /* 0xBF824008 */
  .extern OC1CONINV        /* 0xBF82400C */
  .extern OC1R             /* 0xBF824010 */
  .extern OC1RCLR          /* 0xBF824014 */
  .extern OC1RSET          /* 0xBF824018 */
  .extern OC1RINV          /* 0xBF82401C */
  .extern OC1RS            /* 0xBF824020 */
  .extern OC1RSCLR         /* 0xBF824024 */
  .extern OC1RSSET         /* 0xBF824028 */
  .extern OC1RSINV         /* 0xBF82402C */
  .extern OC2CON           /* 0xBF824200 */
  .extern OC2CONCLR        /* 0xBF824204 */
  .extern OC2CONSET        /* 0xBF824208 */
  .extern OC2CONINV        /* 0xBF82420C */
  .extern OC2R             /* 0xBF824210 */
  .extern OC2RCLR          /* 0xBF824214 */
  .extern OC2RSET          /* 0xBF824218 */
  .extern OC2RINV          /* 0xBF82421C */
  .extern OC2RS            /* 0xBF824220 */
  .extern OC2RSCLR         /* 0xBF824224 */
  .extern OC2RSSET         /* 0xBF824228 */
  .extern OC2RSINV         /* 0xBF82422C */
  .extern OC3CON           /* 0xBF824400 */
  .extern OC3CONCLR        /* 0xBF824404 */
  .extern OC3CONSET        /* 0xBF824408 */
  .extern OC3CONINV        /* 0xBF82440C */
  .extern OC3R             /* 0xBF824410 */
  .extern OC3RCLR          /* 0xBF824414 */
  .extern OC3RSET          /* 0xBF824418 */
  .extern OC3RINV          /* 0xBF82441C */
  .extern OC3RS            /* 0xBF824420 */
  .extern OC3RSCLR         /* 0xBF824424 */
  .extern OC3RSSET         /* 0xBF824428 */
  .extern OC3RSINV         /* 0xBF82442C */
  .extern OC4CON           /* 0xBF824600 */
  .extern OC4CONCLR        /* 0xBF824604 */
  .extern OC4CONSET        /* 0xBF824608 */
  .extern OC4CONINV        /* 0xBF82460C */
  .extern OC4R             /* 0xBF824610 */
  .extern OC4RCLR          /* 0xBF824614 */
  .extern OC4RSET          /* 0xBF824618 */
  .extern OC4RINV          /* 0xBF82461C */
  .extern OC4RS            /* 0xBF824620 */
  .extern OC4RSCLR         /* 0xBF824624 */
  .extern OC4RSSET         /* 0xBF824628 */
  .extern OC4RSINV         /* 0xBF82462C */
  .extern OC5CON           /* 0xBF824800 */
  .extern OC5CONCLR        /* 0xBF824804 */
  .extern OC5CONSET        /* 0xBF824808 */
  .extern OC5CONINV        /* 0xBF82480C */
  .extern OC5R             /* 0xBF824810 */
  .extern OC5RCLR          /* 0xBF824814 */
  .extern OC5RSET          /* 0xBF824818 */
  .extern OC5RINV          /* 0xBF82481C */
  .extern OC5RS            /* 0xBF824820 */
  .extern OC5RSCLR         /* 0xBF824824 */
  .extern OC5RSSET         /* 0xBF824828 */
  .extern OC5RSINV         /* 0xBF82482C */
  .extern OC6CON           /* 0xBF824A00 */
  .extern OC6CONCLR        /* 0xBF824A04 */
  .extern OC6CONSET        /* 0xBF824A08 */
  .extern OC6CONINV        /* 0xBF824A0C */
  .extern OC6R             /* 0xBF824A10 */
  .extern OC6RCLR          /* 0xBF824A14 */
  .extern OC6RSET          /* 0xBF824A18 */
  .extern OC6RINV          /* 0xBF824A1C */
  .extern OC6RS            /* 0xBF824A20 */
  .extern OC6RSCLR         /* 0xBF824A24 */
  .extern OC6RSSET         /* 0xBF824A28 */
  .extern OC6RSINV         /* 0xBF824A2C */
  .extern OC7CON           /* 0xBF824C00 */
  .extern OC7CONCLR        /* 0xBF824C04 */
  .extern OC7CONSET        /* 0xBF824C08 */
  .extern OC7CONINV        /* 0xBF824C0C */
  .extern OC7R             /* 0xBF824C10 */
  .extern OC7RCLR          /* 0xBF824C14 */
  .extern OC7RSET          /* 0xBF824C18 */
  .extern OC7RINV          /* 0xBF824C1C */
  .extern OC7RS            /* 0xBF824C20 */
  .extern OC7RSCLR         /* 0xBF824C24 */
  .extern OC7RSSET         /* 0xBF824C28 */
  .extern OC7RSINV         /* 0xBF824C2C */
  .extern OC8CON           /* 0xBF824E00 */
  .extern OC8CONCLR        /* 0xBF824E04 */
  .extern OC8CONSET        /* 0xBF824E08 */
  .extern OC8CONINV        /* 0xBF824E0C */
  .extern OC8R             /* 0xBF824E10 */
  .extern OC8RCLR          /* 0xBF824E14 */
  .extern OC8RSET          /* 0xBF824E18 */
  .extern OC8RINV          /* 0xBF824E1C */
  .extern OC8RS            /* 0xBF824E20 */
  .extern OC8RSCLR         /* 0xBF824E24 */
  .extern OC8RSSET         /* 0xBF824E28 */
  .extern OC8RSINV         /* 0xBF824E2C */
  .extern OC9CON           /* 0xBF825000 */
  .extern OC9CONCLR        /* 0xBF825004 */
  .extern OC9CONSET        /* 0xBF825008 */
  .extern OC9CONINV        /* 0xBF82500C */
  .extern OC9R             /* 0xBF825010 */
  .extern OC9RCLR          /* 0xBF825014 */
  .extern OC9RSET          /* 0xBF825018 */
  .extern OC9RINV          /* 0xBF82501C */
  .extern OC9RS            /* 0xBF825020 */
  .extern OC9RSCLR         /* 0xBF825024 */
  .extern OC9RSSET         /* 0xBF825028 */
  .extern OC9RSINV         /* 0xBF82502C */
  .extern I2C1CON          /* 0xBF826000 */
  .extern I2C1CONCLR       /* 0xBF826004 */
  .extern I2C1CONSET       /* 0xBF826008 */
  .extern I2C1CONINV       /* 0xBF82600C */
  .extern I2C1STAT         /* 0xBF826010 */
  .extern I2C1STATCLR      /* 0xBF826014 */
  .extern I2C1STATSET      /* 0xBF826018 */
  .extern I2C1STATINV      /* 0xBF82601C */
  .extern I2C1ADD          /* 0xBF826020 */
  .extern I2C1ADDCLR       /* 0xBF826024 */
  .extern I2C1ADDSET       /* 0xBF826028 */
  .extern I2C1ADDINV       /* 0xBF82602C */
  .extern I2C1MSK          /* 0xBF826030 */
  .extern I2C1MSKCLR       /* 0xBF826034 */
  .extern I2C1MSKSET       /* 0xBF826038 */
  .extern I2C1MSKINV       /* 0xBF82603C */
  .extern I2C1BRG          /* 0xBF826040 */
  .extern I2C1BRGCLR       /* 0xBF826044 */
  .extern I2C1BRGSET       /* 0xBF826048 */
  .extern I2C1BRGINV       /* 0xBF82604C */
  .extern I2C1TRN          /* 0xBF826050 */
