Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern PDC7INV          /* 0xBF82A6EC */
  .extern SDC7             /* 0xBF82A6F0 */
  .extern SDC7CLR          /* 0xBF82A6F4 */
  .extern SDC7SET          /* 0xBF82A6F8 */
  .extern SDC7INV          /* 0xBF82A6FC */
  .extern PHASE7           /* 0xBF82A700 */
  .extern PHASE7CLR        /* 0xBF82A704 */
  .extern PHASE7SET        /* 0xBF82A708 */
  .extern PHASE7INV        /* 0xBF82A70C */
  .extern DTR7             /* 0xBF82A710 */
  .extern DTR7CLR          /* 0xBF82A714 */
  .extern DTR7SET          /* 0xBF82A718 */
  .extern DTR7INV          /* 0xBF82A71C */
  .extern ALTDTR7          /* 0xBF82A720 */
  .extern ALTDTR7CLR       /* 0xBF82A724 */
  .extern ALTDTR7SET       /* 0xBF82A728 */
  .extern ALTDTR7INV       /* 0xBF82A72C */
  .extern DTCOMP7          /* 0xBF82A730 */
  .extern DTCOMP7CLR       /* 0xBF82A734 */
  .extern DTCOMP7SET       /* 0xBF82A738 */
  .extern DTCOMP7INV       /* 0xBF82A73C */
  .extern TRIG7            /* 0xBF82A740 */
  .extern TRIG7CLR         /* 0xBF82A744 */
  .extern TRIG7SET         /* 0xBF82A748 */
  .extern TRIG7INV         /* 0xBF82A74C */
  .extern TRGCON7          /* 0xBF82A750 */
  .extern TRGCON7CLR       /* 0xBF82A754 */
  .extern TRGCON7SET       /* 0xBF82A758 */
  .extern TRGCON7INV       /* 0xBF82A75C */
  .extern STRIG7           /* 0xBF82A760 */
  .extern STRIG7CLR        /* 0xBF82A764 */
  .extern STRIG7SET        /* 0xBF82A768 */
  .extern STRIG7INV        /* 0xBF82A76C */
  .extern CAP7             /* 0xBF82A770 */
  .extern CAP7CLR          /* 0xBF82A774 */
  .extern CAP7SET          /* 0xBF82A778 */
  .extern CAP7INV          /* 0xBF82A77C */
  .extern LEBCON7          /* 0xBF82A780 */
  .extern LEBCON7CLR       /* 0xBF82A784 */
  .extern LEBCON7SET       /* 0xBF82A788 */
  .extern LEBCON7INV       /* 0xBF82A78C */
  .extern LEBDLY7          /* 0xBF82A790 */
  .extern LEBDLY7CLR       /* 0xBF82A794 */
  .extern LEBDLY7SET       /* 0xBF82A798 */
  .extern LEBDLY7INV       /* 0xBF82A79C */
  .extern AUXCON7          /* 0xBF82A7A0 */
  .extern AUXCON7CLR       /* 0xBF82A7A4 */
  .extern AUXCON7SET       /* 0xBF82A7A8 */
  .extern AUXCON7INV       /* 0xBF82A7AC */
  .extern PTMR7            /* 0xBF82A7B0 */
  .extern PTMR7CLR         /* 0xBF82A7B4 */
  .extern PTMR7SET         /* 0xBF82A7B8 */
  .extern PTMR7INV         /* 0xBF82A7BC */
  .extern PWMCON8          /* 0xBF82A7C0 */
  .extern PWMCON8CLR       /* 0xBF82A7C4 */
  .extern PWMCON8SET       /* 0xBF82A7C8 */
  .extern PWMCON8INV       /* 0xBF82A7CC */
  .extern IOCON8           /* 0xBF82A7D0 */
  .extern IOCON8CLR        /* 0xBF82A7D4 */
  .extern IOCON8SET        /* 0xBF82A7D8 */
  .extern IOCON8INV        /* 0xBF82A7DC */
  .extern PDC8             /* 0xBF82A7E0 */
  .extern PDC8CLR          /* 0xBF82A7E4 */
  .extern PDC8SET          /* 0xBF82A7E8 */
  .extern PDC8INV          /* 0xBF82A7EC */
  .extern SDC8             /* 0xBF82A7F0 */
  .extern SDC8CLR          /* 0xBF82A7F4 */
  .extern SDC8SET          /* 0xBF82A7F8 */
  .extern SDC8INV          /* 0xBF82A7FC */
  .extern PHASE8           /* 0xBF82A800 */
  .extern PHASE8CLR        /* 0xBF82A804 */
  .extern PHASE8SET        /* 0xBF82A808 */
  .extern PHASE8INV        /* 0xBF82A80C */
  .extern DTR8             /* 0xBF82A810 */
  .extern DTR8CLR          /* 0xBF82A814 */
  .extern DTR8SET          /* 0xBF82A818 */
  .extern DTR8INV          /* 0xBF82A81C */
  .extern ALTDTR8          /* 0xBF82A820 */
  .extern ALTDTR8CLR       /* 0xBF82A824 */
  .extern ALTDTR8SET       /* 0xBF82A828 */
  .extern ALTDTR8INV       /* 0xBF82A82C */
  .extern DTCOMP8          /* 0xBF82A830 */
  .extern DTCOMP8CLR       /* 0xBF82A834 */
  .extern DTCOMP8SET       /* 0xBF82A838 */
  .extern DTCOMP8INV       /* 0xBF82A83C */
  .extern TRIG8            /* 0xBF82A840 */
  .extern TRIG8CLR         /* 0xBF82A844 */
  .extern TRIG8SET         /* 0xBF82A848 */
  .extern TRIG8INV         /* 0xBF82A84C */
  .extern TRGCON8          /* 0xBF82A850 */
  .extern TRGCON8CLR       /* 0xBF82A854 */
  .extern TRGCON8SET       /* 0xBF82A858 */
  .extern TRGCON8INV       /* 0xBF82A85C */
  .extern STRIG8           /* 0xBF82A860 */
  .extern STRIG8CLR        /* 0xBF82A864 */
  .extern STRIG8SET        /* 0xBF82A868 */
  .extern STRIG8INV        /* 0xBF82A86C */
  .extern CAP8             /* 0xBF82A870 */
  .extern CAP8CLR          /* 0xBF82A874 */
  .extern CAP8SET          /* 0xBF82A878 */
  .extern CAP8INV          /* 0xBF82A87C */
  .extern LEBCON8          /* 0xBF82A880 */
  .extern LEBCON8CLR       /* 0xBF82A884 */
  .extern LEBCON8SET       /* 0xBF82A888 */
  .extern LEBCON8INV       /* 0xBF82A88C */
  .extern LEBDLY8          /* 0xBF82A890 */
  .extern LEBDLY8CLR       /* 0xBF82A894 */
  .extern LEBDLY8SET       /* 0xBF82A898 */
  .extern LEBDLY8INV       /* 0xBF82A89C */
  .extern AUXCON8          /* 0xBF82A8A0 */
  .extern AUXCON8CLR       /* 0xBF82A8A4 */
  .extern AUXCON8SET       /* 0xBF82A8A8 */
  .extern AUXCON8INV       /* 0xBF82A8AC */
  .extern PTMR8            /* 0xBF82A8B0 */
  .extern PTMR8CLR         /* 0xBF82A8B4 */
  .extern PTMR8SET         /* 0xBF82A8B8 */
  .extern PTMR8INV         /* 0xBF82A8BC */
  .extern PWMCON9          /* 0xBF82A8C0 */
  .extern PWMCON9CLR       /* 0xBF82A8C4 */
  .extern PWMCON9SET       /* 0xBF82A8C8 */
  .extern PWMCON9INV       /* 0xBF82A8CC */
  .extern IOCON9           /* 0xBF82A8D0 */
  .extern IOCON9CLR        /* 0xBF82A8D4 */
  .extern IOCON9SET        /* 0xBF82A8D8 */
  .extern IOCON9INV        /* 0xBF82A8DC */
  .extern PDC9             /* 0xBF82A8E0 */
  .extern PDC9CLR          /* 0xBF82A8E4 */
  .extern PDC9SET          /* 0xBF82A8E8 */
  .extern PDC9INV          /* 0xBF82A8EC */
  .extern SDC9             /* 0xBF82A8F0 */
  .extern SDC9CLR          /* 0xBF82A8F4 */
  .extern SDC9SET          /* 0xBF82A8F8 */
  .extern SDC9INV          /* 0xBF82A8FC */
  .extern PHASE9           /* 0xBF82A900 */
  .extern PHASE9CLR        /* 0xBF82A904 */
  .extern PHASE9SET        /* 0xBF82A908 */
  .extern PHASE9INV        /* 0xBF82A90C */
  .extern DTR9             /* 0xBF82A910 */
  .extern DTR9CLR          /* 0xBF82A914 */
  .extern DTR9SET          /* 0xBF82A918 */
  .extern DTR9INV          /* 0xBF82A91C */
  .extern ALTDTR9          /* 0xBF82A920 */
  .extern ALTDTR9CLR       /* 0xBF82A924 */
  .extern ALTDTR9SET       /* 0xBF82A928 */
  .extern ALTDTR9INV       /* 0xBF82A92C */
  .extern DTCOMP9          /* 0xBF82A930 */
  .extern DTCOMP9CLR       /* 0xBF82A934 */
  .extern DTCOMP9SET       /* 0xBF82A938 */
  .extern DTCOMP9INV       /* 0xBF82A93C */
  .extern TRIG9            /* 0xBF82A940 */
  .extern TRIG9CLR         /* 0xBF82A944 */
  .extern TRIG9SET         /* 0xBF82A948 */
  .extern TRIG9INV         /* 0xBF82A94C */
  .extern TRGCON9          /* 0xBF82A950 */
  .extern TRGCON9CLR       /* 0xBF82A954 */
  .extern TRGCON9SET       /* 0xBF82A958 */
  .extern TRGCON9INV       /* 0xBF82A95C */
  .extern STRIG9           /* 0xBF82A960 */
  .extern STRIG9CLR        /* 0xBF82A964 */
  .extern STRIG9SET        /* 0xBF82A968 */
  .extern STRIG9INV        /* 0xBF82A96C */
  .extern CAP9             /* 0xBF82A970 */
  .extern CAP9CLR          /* 0xBF82A974 */
  .extern CAP9SET          /* 0xBF82A978 */
  .extern CAP9INV          /* 0xBF82A97C */
  .extern LEBCON9          /* 0xBF82A980 */
  .extern LEBCON9CLR       /* 0xBF82A984 */
  .extern LEBCON9SET       /* 0xBF82A988 */
  .extern LEBCON9INV       /* 0xBF82A98C */
  .extern LEBDLY9          /* 0xBF82A990 */
  .extern LEBDLY9CLR       /* 0xBF82A994 */
  .extern LEBDLY9SET       /* 0xBF82A998 */
  .extern LEBDLY9INV       /* 0xBF82A99C */
  .extern AUXCON9          /* 0xBF82A9A0 */
  .extern AUXCON9CLR       /* 0xBF82A9A4 */
  .extern AUXCON9SET       /* 0xBF82A9A8 */
  .extern AUXCON9INV       /* 0xBF82A9AC */
  .extern PTMR9            /* 0xBF82A9B0 */
  .extern PTMR9CLR         /* 0xBF82A9B4 */
  .extern PTMR9SET         /* 0xBF82A9B8 */
  .extern PTMR9INV         /* 0xBF82A9BC */
  .extern QEI1CON          /* 0xBF82B200 */
  .extern QEI1CONCLR       /* 0xBF82B204 */
  .extern QEI1CONSET       /* 0xBF82B208 */
  .extern QEI1CONINV       /* 0xBF82B20C */
  .extern QEI1IOC          /* 0xBF82B210 */
  .extern QEI1IOCCLR       /* 0xBF82B214 */
  .extern QEI1IOCSET       /* 0xBF82B218 */
  .extern QEI1IOCINV       /* 0xBF82B21C */
  .extern QEI1STAT         /* 0xBF82B220 */
  .extern QEI1STATCLR      /* 0xBF82B224 */
  .extern QEI1STATSET      /* 0xBF82B228 */
  .extern QEI1STATINV      /* 0xBF82B22C */
  .extern POS1CNT          /* 0xBF82B230 */
  .extern POS1CNTCLR       /* 0xBF82B234 */
  .extern POS1CNTSET       /* 0xBF82B238 */
  .extern POS1CNTINV       /* 0xBF82B23C */
  .extern POS1HLD          /* 0xBF82B240 */
  .extern POS1HLDCLR       /* 0xBF82B244 */
  .extern POS1HLDSET       /* 0xBF82B248 */
  .extern POS1HLDINV       /* 0xBF82B24C */
  .extern VEL1CNT          /* 0xBF82B250 */
  .extern VEL1CNTCLR       /* 0xBF82B254 */
  .extern VEL1CNTSET       /* 0xBF82B258 */
  .extern VEL1CNTINV       /* 0xBF82B25C */
  .extern VEL1HLD          /* 0xBF82B260 */
  .extern VEL1HLDCLR       /* 0xBF82B264 */
  .extern VEL1HLDSET       /* 0xBF82B268 */
  .extern VEL1HLDINV       /* 0xBF82B26C */
  .extern INT1TMR          /* 0xBF82B270 */
  .extern INT1TMRCLR       /* 0xBF82B274 */
  .extern INT1TMRSET       /* 0xBF82B278 */
  .extern INT1TMRINV       /* 0xBF82B27C */
  .extern INT1HLD          /* 0xBF82B280 */
  .extern INT1HLDCLR       /* 0xBF82B284 */
  .extern INT1HLDSET       /* 0xBF82B288 */
  .extern INT1HLDINV       /* 0xBF82B28C */
  .extern INDX1CNT         /* 0xBF82B290 */
  .extern INDX1CNTCLR      /* 0xBF82B294 */
  .extern INDX1CNTSET      /* 0xBF82B298 */
  .extern INDX1CNTINV      /* 0xBF82B29C */
  .extern INDX1HLD         /* 0xBF82B2A0 */
  .extern INDX1HLDCLR      /* 0xBF82B2A4 */
  .extern INDX1HLDSET      /* 0xBF82B2A8 */
  .extern INDX1HLDINV      /* 0xBF82B2AC */
  .extern QEI1ICC          /* 0xBF82B2B0 */
  .extern QEI1ICCCLR       /* 0xBF82B2B4 */
  .extern QEI1ICCSET       /* 0xBF82B2B8 */
  .extern QEI1ICCINV       /* 0xBF82B2BC */
  .extern QEI1CMPL         /* 0xBF82B2C0 */
  .extern QEI1CMPLCLR      /* 0xBF82B2C4 */
  .extern QEI1CMPLSET      /* 0xBF82B2C8 */
  .extern QEI1CMPLINV      /* 0xBF82B2CC */
  .extern QEI2CON          /* 0xBF82B400 */
  .extern QEI2CONCLR       /* 0xBF82B404 */
  .extern QEI2CONSET       /* 0xBF82B408 */
  .extern QEI2CONINV       /* 0xBF82B40C */
  .extern QEI2IOC          /* 0xBF82B410 */
  .extern QEI2IOCCLR       /* 0xBF82B414 */
  .extern QEI2IOCSET       /* 0xBF82B418 */
  .extern QEI2IOCINV       /* 0xBF82B41C */
  .extern QEI2STAT         /* 0xBF82B420 */
  .extern QEI2STATCLR      /* 0xBF82B424 */
  .extern QEI2STATSET      /* 0xBF82B428 */
  .extern QEI2STATINV      /* 0xBF82B42C */
  .extern POS2CNT          /* 0xBF82B430 */
  .extern POS2CNTCLR       /* 0xBF82B434 */
  .extern POS2CNTSET       /* 0xBF82B438 */
  .extern POS2CNTINV       /* 0xBF82B43C */
  .extern POS2HLD          /* 0xBF82B440 */
  .extern POS2HLDCLR       /* 0xBF82B444 */
  .extern POS2HLDSET       /* 0xBF82B448 */
  .extern POS2HLDINV       /* 0xBF82B44C */
  .extern VEL2CNT          /* 0xBF82B450 */
  .extern VEL2CNTCLR       /* 0xBF82B454 */
  .extern VEL2CNTSET       /* 0xBF82B458 */
  .extern VEL2CNTINV       /* 0xBF82B45C */
  .extern VEL2HLD          /* 0xBF82B460 */
  .extern VEL2HLDCLR       /* 0xBF82B464 */
  .extern VEL2HLDSET       /* 0xBF82B468 */
  .extern VEL2HLDINV       /* 0xBF82B46C */
  .extern INT2TMR          /* 0xBF82B470 */
  .extern INT2TMRCLR       /* 0xBF82B474 */
  .extern INT2TMRSET       /* 0xBF82B478 */
  .extern INT2TMRINV       /* 0xBF82B47C */
  .extern INT2HLD          /* 0xBF82B480 */
  .extern INT2HLDCLR       /* 0xBF82B484 */
  .extern INT2HLDSET       /* 0xBF82B488 */
  .extern INT2HLDINV       /* 0xBF82B48C */
  .extern INDX2CNT         /* 0xBF82B490 */
  .extern INDX2CNTCLR      /* 0xBF82B494 */
  .extern INDX2CNTSET      /* 0xBF82B498 */
  .extern INDX2CNTINV      /* 0xBF82B49C */
  .extern INDX2HLD         /* 0xBF82B4A0 */
  .extern INDX2HLDCLR      /* 0xBF82B4A4 */
  .extern INDX2HLDSET      /* 0xBF82B4A8 */
  .extern INDX2HLDINV      /* 0xBF82B4AC */
  .extern QEI2ICC          /* 0xBF82B4B0 */
  .extern QEI2ICCCLR       /* 0xBF82B4B4 */
  .extern QEI2ICCSET       /* 0xBF82B4B8 */
  .extern QEI2ICCINV       /* 0xBF82B4BC */
  .extern QEI2CMPL         /* 0xBF82B4C0 */
  .extern QEI2CMPLCLR      /* 0xBF82B4C4 */
  .extern QEI2CMPLSET      /* 0xBF82B4C8 */
  .extern QEI2CMPLINV      /* 0xBF82B4CC */
  .extern QEI3CON          /* 0xBF82B600 */
  .extern QEI3CONCLR       /* 0xBF82B604 */
  .extern QEI3CONSET       /* 0xBF82B608 */
  .extern QEI3CONINV       /* 0xBF82B60C */
  .extern QEI3IOC          /* 0xBF82B610 */
  .extern QEI3IOCCLR       /* 0xBF82B614 */
  .extern QEI3IOCSET       /* 0xBF82B618 */
  .extern QEI3IOCINV       /* 0xBF82B61C */
  .extern QEI3STAT         /* 0xBF82B620 */
  .extern QEI3STATCLR      /* 0xBF82B624 */
  .extern QEI3STATSET      /* 0xBF82B628 */
  .extern QEI3STATINV      /* 0xBF82B62C */
  .extern POS3CNT          /* 0xBF82B630 */
  .extern POS3CNTCLR       /* 0xBF82B634 */
  .extern POS3CNTSET       /* 0xBF82B638 */
  .extern POS3CNTINV       /* 0xBF82B63C */
  .extern POS3HLD          /* 0xBF82B640 */
  .extern POS3HLDCLR       /* 0xBF82B644 */
  .extern POS3HLDSET       /* 0xBF82B648 */
  .extern POS3HLDINV       /* 0xBF82B64C */
  .extern VEL3CNT          /* 0xBF82B650 */
  .extern VEL3CNTCLR       /* 0xBF82B654 */
  .extern VEL3CNTSET       /* 0xBF82B658 */
  .extern VEL3CNTINV       /* 0xBF82B65C */
  .extern VEL3HLD          /* 0xBF82B660 */
  .extern VEL3HLDCLR       /* 0xBF82B664 */
  .extern VEL3HLDSET       /* 0xBF82B668 */
  .extern VEL3HLDINV       /* 0xBF82B66C */
  .extern INT3TMR          /* 0xBF82B670 */
  .extern INT3TMRCLR       /* 0xBF82B674 */
  .extern INT3TMRSET       /* 0xBF82B678 */
  .extern INT3TMRINV       /* 0xBF82B67C */
  .extern INT3HLD          /* 0xBF82B680 */
  .extern INT3HLDCLR       /* 0xBF82B684 */
  .extern INT3HLDSET       /* 0xBF82B688 */
  .extern INT3HLDINV       /* 0xBF82B68C */
  .extern INDX3CNT         /* 0xBF82B690 */
  .extern INDX3CNTCLR      /* 0xBF82B694 */
  .extern INDX3CNTSET      /* 0xBF82B698 */
  .extern INDX3CNTINV      /* 0xBF82B69C */
  .extern INDX3HLD         /* 0xBF82B6A0 */
  .extern INDX3HLDCLR      /* 0xBF82B6A4 */
  .extern INDX3HLDSET      /* 0xBF82B6A8 */
  .extern INDX3HLDINV      /* 0xBF82B6AC */
  .extern QEI3ICC          /* 0xBF82B6B0 */
  .extern QEI3ICCCLR       /* 0xBF82B6B4 */
  .extern QEI3ICCSET       /* 0xBF82B6B8 */
  .extern QEI3ICCINV       /* 0xBF82B6BC */
  .extern QEI3CMPL         /* 0xBF82B6C0 */
  .extern QEI3CMPLCLR      /* 0xBF82B6C4 */
  .extern QEI3CMPLSET      /* 0xBF82B6C8 */
  .extern QEI3CMPLINV      /* 0xBF82B6CC */
  .extern QEI4CON          /* 0xBF82B800 */
  .extern QEI4CONCLR       /* 0xBF82B804 */
  .extern QEI4CONSET       /* 0xBF82B808 */
  .extern QEI4CONINV       /* 0xBF82B80C */
  .extern QEI4IOC          /* 0xBF82B810 */
  .extern QEI4IOCCLR       /* 0xBF82B814 */
  .extern QEI4IOCSET       /* 0xBF82B818 */
  .extern QEI4IOCINV       /* 0xBF82B81C */
  .extern QEI4STAT         /* 0xBF82B820 */
  .extern QEI4STATCLR      /* 0xBF82B824 */
  .extern QEI4STATSET      /* 0xBF82B828 */
  .extern QEI4STATINV      /* 0xBF82B82C */
  .extern POS4CNT          /* 0xBF82B830 */
  .extern POS4CNTCLR       /* 0xBF82B834 */
  .extern POS4CNTSET       /* 0xBF82B838 */
  .extern POS4CNTINV       /* 0xBF82B83C */
  .extern POS4HLD          /* 0xBF82B840 */
  .extern POS4HLDCLR       /* 0xBF82B844 */
  .extern POS4HLDSET       /* 0xBF82B848 */
  .extern POS4HLDINV       /* 0xBF82B84C */
  .extern VEL4CNT          /* 0xBF82B850 */
  .extern VEL4CNTCLR       /* 0xBF82B854 */
  .extern VEL4CNTSET       /* 0xBF82B858 */
  .extern VEL4CNTINV       /* 0xBF82B85C */
  .extern VEL4HLD          /* 0xBF82B860 */
  .extern VEL4HLDCLR       /* 0xBF82B864 */
  .extern VEL4HLDSET       /* 0xBF82B868 */
  .extern VEL4HLDINV       /* 0xBF82B86C */
  .extern INT4TMR          /* 0xBF82B870 */
  .extern INT4TMRCLR       /* 0xBF82B874 */
  .extern INT4TMRSET       /* 0xBF82B878 */
  .extern INT4TMRINV       /* 0xBF82B87C */
  .extern INT4HLD          /* 0xBF82B880 */
  .extern INT4HLDCLR       /* 0xBF82B884 */
  .extern INT4HLDSET       /* 0xBF82B888 */
  .extern INT4HLDINV       /* 0xBF82B88C */
  .extern INDX4CNT         /* 0xBF82B890 */
  .extern INDX4CNTCLR      /* 0xBF82B894 */
  .extern INDX4CNTSET      /* 0xBF82B898 */
  .extern INDX4CNTINV      /* 0xBF82B89C */
  .extern INDX4HLD         /* 0xBF82B8A0 */
  .extern INDX4HLDCLR      /* 0xBF82B8A4 */
  .extern INDX4HLDSET      /* 0xBF82B8A8 */
  .extern INDX4HLDINV      /* 0xBF82B8AC */
  .extern QEI4ICC          /* 0xBF82B8B0 */
  .extern QEI4ICCCLR       /* 0xBF82B8B4 */
  .extern QEI4ICCSET       /* 0xBF82B8B8 */
  .extern QEI4ICCINV       /* 0xBF82B8BC */
  .extern QEI4CMPL         /* 0xBF82B8C0 */
  .extern QEI4CMPLCLR      /* 0xBF82B8C4 */
  .extern QEI4CMPLSET      /* 0xBF82B8C8 */
  .extern QEI4CMPLINV      /* 0xBF82B8CC */
  .extern QEI5CON          /* 0xBF82BA00 */
  .extern QEI5CONCLR       /* 0xBF82BA04 */
  .extern QEI5CONSET       /* 0xBF82BA08 */
  .extern QEI5CONINV       /* 0xBF82BA0C */
  .extern QEI5IOC          /* 0xBF82BA10 */
  .extern QEI5IOCCLR       /* 0xBF82BA14 */
  .extern QEI5IOCSET       /* 0xBF82BA18 */
  .extern QEI5IOCINV       /* 0xBF82BA1C */
  .extern QEI5STAT         /* 0xBF82BA20 */
  .extern QEI5STATCLR      /* 0xBF82BA24 */
  .extern QEI5STATSET      /* 0xBF82BA28 */
  .extern QEI5STATINV      /* 0xBF82BA2C */
  .extern POS5CNT          /* 0xBF82BA30 */
  .extern POS5CNTCLR       /* 0xBF82BA34 */
  .extern POS5CNTSET       /* 0xBF82BA38 */
  .extern POS5CNTINV       /* 0xBF82BA3C */
  .extern POS5HLD          /* 0xBF82BA40 */
  .extern POS5HLDCLR       /* 0xBF82BA44 */
  .extern POS5HLDSET       /* 0xBF82BA48 */
  .extern POS5HLDINV       /* 0xBF82BA4C */
  .extern VEL5CNT          /* 0xBF82BA50 */
  .extern VEL5CNTCLR       /* 0xBF82BA54 */
  .extern VEL5CNTSET       /* 0xBF82BA58 */
  .extern VEL5CNTINV       /* 0xBF82BA5C */
  .extern VEL5HLD          /* 0xBF82BA60 */
  .extern VEL5HLDCLR       /* 0xBF82BA64 */
  .extern VEL5HLDSET       /* 0xBF82BA68 */
  .extern VEL5HLDINV       /* 0xBF82BA6C */
  .extern INT5TMR          /* 0xBF82BA70 */
  .extern INT5TMRCLR       /* 0xBF82BA74 */
  .extern INT5TMRSET       /* 0xBF82BA78 */
  .extern INT5TMRINV       /* 0xBF82BA7C */
  .extern INT5HLD          /* 0xBF82BA80 */
  .extern INT5HLDCLR       /* 0xBF82BA84 */
  .extern INT5HLDSET       /* 0xBF82BA88 */
  .extern INT5HLDINV       /* 0xBF82BA8C */
  .extern INDX5CNT         /* 0xBF82BA90 */
  .extern INDX5CNTCLR      /* 0xBF82BA94 */
  .extern INDX5CNTSET      /* 0xBF82BA98 */
  .extern INDX5CNTINV      /* 0xBF82BA9C */
  .extern INDX5HLD         /* 0xBF82BAA0 */
  .extern INDX5HLDCLR      /* 0xBF82BAA4 */
  .extern INDX5HLDSET      /* 0xBF82BAA8 */
  .extern INDX5HLDINV      /* 0xBF82BAAC */
  .extern QEI5ICC          /* 0xBF82BAB0 */
  .extern QEI5ICCCLR       /* 0xBF82BAB4 */
  .extern QEI5ICCSET       /* 0xBF82BAB8 */
  .extern QEI5ICCINV       /* 0xBF82BABC */
  .extern QEI5CMPL         /* 0xBF82BAC0 */
  .extern QEI5CMPLCLR      /* 0xBF82BAC4 */
  .extern QEI5CMPLSET      /* 0xBF82BAC8 */
  .extern QEI5CMPLINV      /* 0xBF82BACC */
  .extern QEI6CON          /* 0xBF82BC00 */
  .extern QEI6CONCLR       /* 0xBF82BC04 */
  .extern QEI6CONSET       /* 0xBF82BC08 */
  .extern QEI6CONINV       /* 0xBF82BC0C */
  .extern QEI6IOC          /* 0xBF82BC10 */
  .extern QEI6IOCCLR       /* 0xBF82BC14 */
  .extern QEI6IOCSET       /* 0xBF82BC18 */
  .extern QEI6IOCINV       /* 0xBF82BC1C */
  .extern QEI6STAT         /* 0xBF82BC20 */
  .extern QEI6STATCLR      /* 0xBF82BC24 */
  .extern QEI6STATSET      /* 0xBF82BC28 */
  .extern QEI6STATINV      /* 0xBF82BC2C */
  .extern POS6CNT          /* 0xBF82BC30 */
  .extern POS6CNTCLR       /* 0xBF82BC34 */
  .extern POS6CNTSET       /* 0xBF82BC38 */
  .extern POS6CNTINV       /* 0xBF82BC3C */
  .extern POS6HLD          /* 0xBF82BC40 */
  .extern POS6HLDCLR       /* 0xBF82BC44 */
  .extern POS6HLDSET       /* 0xBF82BC48 */
  .extern POS6HLDINV       /* 0xBF82BC4C */
  .extern VEL6CNT          /* 0xBF82BC50 */
  .extern VEL6CNTCLR       /* 0xBF82BC54 */
  .extern VEL6CNTSET       /* 0xBF82BC58 */
  .extern VEL6CNTINV       /* 0xBF82BC5C */
  .extern VEL6HLD          /* 0xBF82BC60 */
  .extern VEL6HLDCLR       /* 0xBF82BC64 */
  .extern VEL6HLDSET       /* 0xBF82BC68 */
  .extern VEL6HLDINV       /* 0xBF82BC6C */
  .extern INT6TMR          /* 0xBF82BC70 */
  .extern INT6TMRCLR       /* 0xBF82BC74 */
  .extern INT6TMRSET       /* 0xBF82BC78 */
  .extern INT6TMRINV       /* 0xBF82BC7C */
  .extern INT6HLD          /* 0xBF82BC80 */
  .extern INT6HLDCLR       /* 0xBF82BC84 */
  .extern INT6HLDSET       /* 0xBF82BC88 */
  .extern INT6HLDINV       /* 0xBF82BC8C */
  .extern INDX6CNT         /* 0xBF82BC90 */
  .extern INDX6CNTCLR      /* 0xBF82BC94 */
  .extern INDX6CNTSET      /* 0xBF82BC98 */
  .extern INDX6CNTINV      /* 0xBF82BC9C */
  .extern INDX6HLD         /* 0xBF82BCA0 */
  .extern INDX6HLDCLR      /* 0xBF82BCA4 */
  .extern INDX6HLDSET      /* 0xBF82BCA8 */
  .extern INDX6HLDINV      /* 0xBF82BCAC */
  .extern QEI6ICC          /* 0xBF82BCB0 */
  .extern QEI6ICCCLR       /* 0xBF82BCB4 */
  .extern QEI6ICCSET       /* 0xBF82BCB8 */
  .extern QEI6ICCINV       /* 0xBF82BCBC */
  .extern QEI6CMPL         /* 0xBF82BCC0 */
  .extern QEI6CMPLCLR      /* 0xBF82BCC4 */
  .extern QEI6CMPLSET      /* 0xBF82BCC8 */
  .extern QEI6CMPLINV      /* 0xBF82BCCC */
  .extern CMSTAT           /* 0xBF82C000 */
  .extern CMSTATCLR        /* 0xBF82C004 */
  .extern CMSTATSET        /* 0xBF82C008 */
  .extern CMSTATINV        /* 0xBF82C00C */
  .extern CM1CON           /* 0xBF82C010 */
  .extern CM1CONCLR        /* 0xBF82C014 */
  .extern CM1CONSET        /* 0xBF82C018 */
  .extern CM1CONINV        /* 0xBF82C01C */
  .extern CM1MSKCON        /* 0xBF82C020 */
  .extern CM1MSKCONCLR     /* 0xBF82C024 */
  .extern CM1MSKCONSET     /* 0xBF82C028 */
  .extern CM1MSKCONINV     /* 0xBF82C02C */
  .extern CM2CON           /* 0xBF82C030 */
  .extern CM2CONCLR        /* 0xBF82C034 */
  .extern CM2CONSET        /* 0xBF82C038 */
  .extern CM2CONINV        /* 0xBF82C03C */
  .extern CM2MSKCON        /* 0xBF82C040 */
  .extern CM2MSKCONCLR     /* 0xBF82C044 */
  .extern CM2MSKCONSET     /* 0xBF82C048 */
  .extern CM2MSKCONINV     /* 0xBF82C04C */
  .extern CM3CON           /* 0xBF82C050 */
  .extern CM3CONCLR        /* 0xBF82C054 */
  .extern CM3CONSET        /* 0xBF82C058 */
  .extern CM3CONINV        /* 0xBF82C05C */
  .extern CM3MSKCON        /* 0xBF82C060 */
  .extern CM3MSKCONCLR     /* 0xBF82C064 */
  .extern CM3MSKCONSET     /* 0xBF82C068 */
  .extern CM3MSKCONINV     /* 0xBF82C06C */
  .extern CM4CON           /* 0xBF82C070 */
  .extern CM4CONCLR        /* 0xBF82C074 */
  .extern CM4CONSET        /* 0xBF82C078 */
  .extern CM4CONINV        /* 0xBF82C07C */
  .extern CM4MSKCON        /* 0xBF82C080 */
  .extern CM4MSKCONCLR     /* 0xBF82C084 */
  .extern CM4MSKCONSET     /* 0xBF82C088 */
  .extern CM4MSKCONINV     /* 0xBF82C08C */
  .extern CM5CON           /* 0xBF82C090 */
  .extern CM5CONCLR        /* 0xBF82C094 */
  .extern CM5CONSET        /* 0xBF82C098 */
  .extern CM5CONINV        /* 0xBF82C09C */
  .extern CM5MSKCON        /* 0xBF82C0A0 */
  .extern CM5MSKCONCLR     /* 0xBF82C0A4 */
  .extern CM5MSKCONSET     /* 0xBF82C0A8 */
  .extern CM5MSKCONINV     /* 0xBF82C0AC */
  .extern DAC1CON          /* 0xBF82C200 */
  .extern DAC1CONCLR       /* 0xBF82C204 */
  .extern DAC1CONSET       /* 0xBF82C208 */
  .extern DAC1CONINV       /* 0xBF82C20C */
  .extern CTMUCON          /* 0xBF82D000 */
  .extern CTMUCONCLR       /* 0xBF82D004 */
  .extern CTMUCONSET       /* 0xBF82D008 */
  .extern CTMUCONINV       /* 0xBF82D00C */
