Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern PMCON            /* 0xBF82E000 */
  .extern PMCONCLR         /* 0xBF82E004 */
  .extern PMCONSET         /* 0xBF82E008 */
  .extern PMCONINV         /* 0xBF82E00C */
  .extern PMMODE           /* 0xBF82E010 */
  .extern PMMODECLR        /* 0xBF82E014 */
  .extern PMMODESET        /* 0xBF82E018 */
  .extern PMMODEINV        /* 0xBF82E01C */
  .extern PMADDR           /* 0xBF82E020 */
  .extern PMADDRCLR        /* 0xBF82E024 */
  .extern PMADDRSET        /* 0xBF82E028 */
  .extern PMADDRINV        /* 0xBF82E02C */
  .extern PMDOUT           /* 0xBF82E030 */
  .extern PMDOUTCLR        /* 0xBF82E034 */
  .extern PMDOUTSET        /* 0xBF82E038 */
  .extern PMDOUTINV        /* 0xBF82E03C */
  .extern PMDIN            /* 0xBF82E040 */
  .extern PMDINCLR         /* 0xBF82E044 */
  .extern PMDINSET         /* 0xBF82E048 */
  .extern PMDININV         /* 0xBF82E04C */
  .extern PMAEN            /* 0xBF82E050 */
  .extern PMAENCLR         /* 0xBF82E054 */
  .extern PMAENSET         /* 0xBF82E058 */
  .extern PMAENINV         /* 0xBF82E05C */
  .extern PMSTAT           /* 0xBF82E060 */
  .extern PMSTATCLR        /* 0xBF82E064 */
  .extern PMSTATSET        /* 0xBF82E068 */
  .extern PMSTATINV        /* 0xBF82E06C */
  .extern PMWADDR          /* 0xBF82E070 */
  .extern PMWADDRCLR       /* 0xBF82E074 */
  .extern PMWADDRSET       /* 0xBF82E078 */
  .extern PMWADDRINV       /* 0xBF82E07C */
  .extern PMRADDR          /* 0xBF82E080 */
  .extern PMRADDRCLR       /* 0xBF82E084 */
  .extern PMRADDRSET       /* 0xBF82E088 */
  .extern PMRADDRINV       /* 0xBF82E08C */
  .extern PMRDIN           /* 0xBF82E090 */
  .extern PMRDINCLR        /* 0xBF82E094 */
  .extern PMRDINSET        /* 0xBF82E098 */
  .extern PMRDININV        /* 0xBF82E09C */
  .extern IC10CON          /* 0xBF843200 */
  .extern IC10CONCLR       /* 0xBF843204 */
  .extern IC10CONSET       /* 0xBF843208 */
  .extern IC10CONINV       /* 0xBF84320C */
  .extern IC10BUF          /* 0xBF843210 */
  .extern IC11CON          /* 0xBF843400 */
  .extern IC11CONCLR       /* 0xBF843404 */
  .extern IC11CONSET       /* 0xBF843408 */
  .extern IC11CONINV       /* 0xBF84340C */
  .extern IC11BUF          /* 0xBF843410 */
  .extern IC12CON          /* 0xBF843600 */
  .extern IC12CONCLR       /* 0xBF843604 */
  .extern IC12CONSET       /* 0xBF843608 */
  .extern IC12CONINV       /* 0xBF84360C */
  .extern IC12BUF          /* 0xBF843610 */
  .extern IC13CON          /* 0xBF843800 */
  .extern IC13CONCLR       /* 0xBF843804 */
  .extern IC13CONSET       /* 0xBF843808 */
  .extern IC13CONINV       /* 0xBF84380C */
  .extern IC13BUF          /* 0xBF843810 */
  .extern IC14CON          /* 0xBF843A00 */
  .extern IC14CONCLR       /* 0xBF843A04 */
  .extern IC14CONSET       /* 0xBF843A08 */
  .extern IC14CONINV       /* 0xBF843A0C */
  .extern IC14BUF          /* 0xBF843A10 */
  .extern IC15CON          /* 0xBF843C00 */
  .extern IC15CONCLR       /* 0xBF843C04 */
  .extern IC15CONSET       /* 0xBF843C08 */
  .extern IC15CONINV       /* 0xBF843C0C */
  .extern IC15BUF          /* 0xBF843C10 */
  .extern IC16CON          /* 0xBF843E00 */
  .extern IC16CONCLR       /* 0xBF843E04 */
  .extern IC16CONSET       /* 0xBF843E08 */
  .extern IC16CONINV       /* 0xBF843E0C */
  .extern IC16BUF          /* 0xBF843E10 */
  .extern OC10CON          /* 0xBF845200 */
  .extern OC10CONCLR       /* 0xBF845204 */
  .extern OC10CONSET       /* 0xBF845208 */
  .extern OC10CONINV       /* 0xBF84520C */
  .extern OC10R            /* 0xBF845210 */
  .extern OC10RCLR         /* 0xBF845214 */
  .extern OC10RSET         /* 0xBF845218 */
  .extern OC10RINV         /* 0xBF84521C */
  .extern OC10RS           /* 0xBF845220 */
  .extern OC10RSCLR        /* 0xBF845224 */
  .extern OC10RSSET        /* 0xBF845228 */
  .extern OC10RSINV        /* 0xBF84522C */
  .extern OC11CON          /* 0xBF845400 */
  .extern OC11CONCLR       /* 0xBF845404 */
  .extern OC11CONSET       /* 0xBF845408 */
  .extern OC11CONINV       /* 0xBF84540C */
  .extern OC11R            /* 0xBF845410 */
  .extern OC11RCLR         /* 0xBF845414 */
  .extern OC11RSET         /* 0xBF845418 */
  .extern OC11RINV         /* 0xBF84541C */
  .extern OC11RS           /* 0xBF845420 */
  .extern OC11RSCLR        /* 0xBF845424 */
  .extern OC11RSSET        /* 0xBF845428 */
  .extern OC11RSINV        /* 0xBF84542C */
  .extern OC12CON          /* 0xBF845600 */
  .extern OC12CONCLR       /* 0xBF845604 */
  .extern OC12CONSET       /* 0xBF845608 */
  .extern OC12CONINV       /* 0xBF84560C */
  .extern OC12R            /* 0xBF845610 */
  .extern OC12RCLR         /* 0xBF845614 */
  .extern OC12RSET         /* 0xBF845618 */
  .extern OC12RINV         /* 0xBF84561C */
  .extern OC12RS           /* 0xBF845620 */
  .extern OC12RSCLR        /* 0xBF845624 */
  .extern OC12RSSET        /* 0xBF845628 */
  .extern OC12RSINV        /* 0xBF84562C */
  .extern OC13CON          /* 0xBF845800 */
  .extern OC13CONCLR       /* 0xBF845804 */
  .extern OC13CONSET       /* 0xBF845808 */
  .extern OC13CONINV       /* 0xBF84580C */
  .extern OC13R            /* 0xBF845810 */
  .extern OC13RCLR         /* 0xBF845814 */
  .extern OC13RSET         /* 0xBF845818 */
  .extern OC13RINV         /* 0xBF84581C */
  .extern OC13RS           /* 0xBF845820 */
  .extern OC13RSCLR        /* 0xBF845824 */
  .extern OC13RSSET        /* 0xBF845828 */
  .extern OC13RSINV        /* 0xBF84582C */
  .extern OC14CON          /* 0xBF845A00 */
  .extern OC14CONCLR       /* 0xBF845A04 */
  .extern OC14CONSET       /* 0xBF845A08 */
  .extern OC14CONINV       /* 0xBF845A0C */
  .extern OC14R            /* 0xBF845A10 */
  .extern OC14RCLR         /* 0xBF845A14 */
  .extern OC14RSET         /* 0xBF845A18 */
  .extern OC14RINV         /* 0xBF845A1C */
  .extern OC14RS           /* 0xBF845A20 */
  .extern OC14RSCLR        /* 0xBF845A24 */
  .extern OC14RSSET        /* 0xBF845A28 */
  .extern OC14RSINV        /* 0xBF845A2C */
  .extern OC15CON          /* 0xBF845C00 */
  .extern OC15CONCLR       /* 0xBF845C04 */
  .extern OC15CONSET       /* 0xBF845C08 */
  .extern OC15CONINV       /* 0xBF845C0C */
  .extern OC15R            /* 0xBF845C10 */
  .extern OC15RCLR         /* 0xBF845C14 */
  .extern OC15RSET         /* 0xBF845C18 */
  .extern OC15RINV         /* 0xBF845C1C */
  .extern OC15RS           /* 0xBF845C20 */
  .extern OC15RSCLR        /* 0xBF845C24 */
  .extern OC15RSSET        /* 0xBF845C28 */
  .extern OC15RSINV        /* 0xBF845C2C */
  .extern OC16CON          /* 0xBF845E00 */
  .extern OC16CONCLR       /* 0xBF845E04 */
  .extern OC16CONSET       /* 0xBF845E08 */
  .extern OC16CONINV       /* 0xBF845E0C */
  .extern OC16R            /* 0xBF845E10 */
  .extern OC16RCLR         /* 0xBF845E14 */
  .extern OC16RSET         /* 0xBF845E18 */
  .extern OC16RINV         /* 0xBF845E1C */
  .extern OC16RS           /* 0xBF845E20 */
  .extern OC16RSCLR        /* 0xBF845E24 */
  .extern OC16RSSET        /* 0xBF845E28 */
  .extern OC16RSINV        /* 0xBF845E2C */
  .extern I2C3CON          /* 0xBF846400 */
  .extern I2C3CONCLR       /* 0xBF846404 */
  .extern I2C3CONSET       /* 0xBF846408 */
  .extern I2C3CONINV       /* 0xBF84640C */
  .extern I2C3STAT         /* 0xBF846410 */
  .extern I2C3STATCLR      /* 0xBF846414 */
  .extern I2C3STATSET      /* 0xBF846418 */
  .extern I2C3STATINV      /* 0xBF84641C */
  .extern I2C3ADD          /* 0xBF846420 */
  .extern I2C3ADDCLR       /* 0xBF846424 */
  .extern I2C3ADDSET       /* 0xBF846428 */
  .extern I2C3ADDINV       /* 0xBF84642C */
  .extern I2C3MSK          /* 0xBF846430 */
  .extern I2C3MSKCLR       /* 0xBF846434 */
  .extern I2C3MSKSET       /* 0xBF846438 */
  .extern I2C3MSKINV       /* 0xBF84643C */
  .extern I2C3BRG          /* 0xBF846440 */
  .extern I2C3BRGCLR       /* 0xBF846444 */
  .extern I2C3BRGSET       /* 0xBF846448 */
  .extern I2C3BRGINV       /* 0xBF84644C */
  .extern I2C3TRN          /* 0xBF846450 */
  .extern I2C3TRNCLR       /* 0xBF846454 */
  .extern I2C3TRNSET       /* 0xBF846458 */
  .extern I2C3TRNINV       /* 0xBF84645C */
  .extern I2C3RCV          /* 0xBF846460 */
  .extern I2C3RCVCLR       /* 0xBF846464 */
  .extern I2C3RCVSET       /* 0xBF846468 */
  .extern I2C3RCVINV       /* 0xBF84646C */
  .extern I2C4CON          /* 0xBF846600 */
  .extern I2C4CONCLR       /* 0xBF846604 */
  .extern I2C4CONSET       /* 0xBF846608 */
  .extern I2C4CONINV       /* 0xBF84660C */
  .extern I2C4STAT         /* 0xBF846610 */
  .extern I2C4STATCLR      /* 0xBF846614 */
  .extern I2C4STATSET      /* 0xBF846618 */
  .extern I2C4STATINV      /* 0xBF84661C */
  .extern I2C4ADD          /* 0xBF846620 */
  .extern I2C4ADDCLR       /* 0xBF846624 */
  .extern I2C4ADDSET       /* 0xBF846628 */
  .extern I2C4ADDINV       /* 0xBF84662C */
  .extern I2C4MSK          /* 0xBF846630 */
  .extern I2C4MSKCLR       /* 0xBF846634 */
  .extern I2C4MSKSET       /* 0xBF846638 */
  .extern I2C4MSKINV       /* 0xBF84663C */
  .extern I2C4BRG          /* 0xBF846640 */
  .extern I2C4BRGCLR       /* 0xBF846644 */
  .extern I2C4BRGSET       /* 0xBF846648 */
  .extern I2C4BRGINV       /* 0xBF84664C */
  .extern I2C4TRN          /* 0xBF846650 */
  .extern I2C4TRNCLR       /* 0xBF846654 */
  .extern I2C4TRNSET       /* 0xBF846658 */
  .extern I2C4TRNINV       /* 0xBF84665C */
  .extern I2C4RCV          /* 0xBF846660 */
  .extern I2C4RCVCLR       /* 0xBF846664 */
  .extern I2C4RCVSET       /* 0xBF846668 */
  .extern I2C4RCVINV       /* 0xBF84666C */
  .extern SPI3CON          /* 0xBF847400 */
  .extern SPI3CONCLR       /* 0xBF847404 */
  .extern SPI3CONSET       /* 0xBF847408 */
  .extern SPI3CONINV       /* 0xBF84740C */
  .extern SPI3STAT         /* 0xBF847410 */
  .extern SPI3STATCLR      /* 0xBF847414 */
  .extern SPI3STATSET      /* 0xBF847418 */
  .extern SPI3STATINV      /* 0xBF84741C */
  .extern SPI3BUF          /* 0xBF847420 */
  .extern SPI3BRG          /* 0xBF847430 */
  .extern SPI3BRGCLR       /* 0xBF847434 */
  .extern SPI3BRGSET       /* 0xBF847438 */
  .extern SPI3BRGINV       /* 0xBF84743C */
  .extern SPI3CON2         /* 0xBF847440 */
  .extern SPI3CON2CLR      /* 0xBF847444 */
  .extern SPI3CON2SET      /* 0xBF847448 */
  .extern SPI3CON2INV      /* 0xBF84744C */
  .extern SPI4CON          /* 0xBF847600 */
  .extern SPI4CONCLR       /* 0xBF847604 */
  .extern SPI4CONSET       /* 0xBF847608 */
  .extern SPI4CONINV       /* 0xBF84760C */
  .extern SPI4STAT         /* 0xBF847610 */
  .extern SPI4STATCLR      /* 0xBF847614 */
  .extern SPI4STATSET      /* 0xBF847618 */
  .extern SPI4STATINV      /* 0xBF84761C */
  .extern SPI4BUF          /* 0xBF847620 */
  .extern SPI4BRG          /* 0xBF847630 */
  .extern SPI4BRGCLR       /* 0xBF847634 */
  .extern SPI4BRGSET       /* 0xBF847638 */
  .extern SPI4BRGINV       /* 0xBF84763C */
  .extern SPI4CON2         /* 0xBF847640 */
  .extern SPI4CON2CLR      /* 0xBF847644 */
  .extern SPI4CON2SET      /* 0xBF847648 */
  .extern SPI4CON2INV      /* 0xBF84764C */
  .extern SPI5CON          /* 0xBF847800 */
  .extern SPI5CONCLR       /* 0xBF847804 */
  .extern SPI5CONSET       /* 0xBF847808 */
  .extern SPI5CONINV       /* 0xBF84780C */
  .extern SPI5STAT         /* 0xBF847810 */
  .extern SPI5STATCLR      /* 0xBF847814 */
  .extern SPI5STATSET      /* 0xBF847818 */
  .extern SPI5STATINV      /* 0xBF84781C */
  .extern SPI5BUF          /* 0xBF847820 */
  .extern SPI5BRG          /* 0xBF847830 */
  .extern SPI5BRGCLR       /* 0xBF847834 */
  .extern SPI5BRGSET       /* 0xBF847838 */
  .extern SPI5BRGINV       /* 0xBF84783C */
  .extern SPI5CON2         /* 0xBF847840 */
  .extern SPI5CON2CLR      /* 0xBF847844 */
  .extern SPI5CON2SET      /* 0xBF847848 */
  .extern SPI5CON2INV      /* 0xBF84784C */
  .extern SPI6CON          /* 0xBF847A00 */
  .extern SPI6CONCLR       /* 0xBF847A04 */
  .extern SPI6CONSET       /* 0xBF847A08 */
  .extern SPI6CONINV       /* 0xBF847A0C */
  .extern SPI6STAT         /* 0xBF847A10 */
  .extern SPI6STATCLR      /* 0xBF847A14 */
  .extern SPI6STATSET      /* 0xBF847A18 */
  .extern SPI6STATINV      /* 0xBF847A1C */
  .extern SPI6BUF          /* 0xBF847A20 */
  .extern SPI6BRG          /* 0xBF847A30 */
  .extern SPI6BRGCLR       /* 0xBF847A34 */
  .extern SPI6BRGSET       /* 0xBF847A38 */
  .extern SPI6BRGINV       /* 0xBF847A3C */
  .extern SPI6CON2         /* 0xBF847A40 */
  .extern SPI6CON2CLR      /* 0xBF847A44 */
  .extern SPI6CON2SET      /* 0xBF847A48 */
  .extern SPI6CON2INV      /* 0xBF847A4C */
  .extern U3MODE           /* 0xBF848400 */
  .extern U3MODECLR        /* 0xBF848404 */
  .extern U3MODESET        /* 0xBF848408 */
  .extern U3MODEINV        /* 0xBF84840C */
  .extern U3STA            /* 0xBF848410 */
  .extern U3STACLR         /* 0xBF848414 */
  .extern U3STASET         /* 0xBF848418 */
  .extern U3STAINV         /* 0xBF84841C */
  .extern U3TXREG          /* 0xBF848420 */
  .extern U3RXREG          /* 0xBF848430 */
  .extern U3BRG            /* 0xBF848440 */
  .extern U3BRGCLR         /* 0xBF848444 */
  .extern U3BRGSET         /* 0xBF848448 */
  .extern U3BRGINV         /* 0xBF84844C */
  .extern U4MODE           /* 0xBF848600 */
  .extern U4MODECLR        /* 0xBF848604 */
  .extern U4MODESET        /* 0xBF848608 */
  .extern U4MODEINV        /* 0xBF84860C */
  .extern U4STA            /* 0xBF848610 */
  .extern U4STACLR         /* 0xBF848614 */
  .extern U4STASET         /* 0xBF848618 */
  .extern U4STAINV         /* 0xBF84861C */
  .extern U4TXREG          /* 0xBF848620 */
  .extern U4RXREG          /* 0xBF848630 */
  .extern U4BRG            /* 0xBF848640 */
  .extern U4BRGCLR         /* 0xBF848644 */
  .extern U4BRGSET         /* 0xBF848648 */
  .extern U4BRGINV         /* 0xBF84864C */
  .extern U5MODE           /* 0xBF848800 */
  .extern U5MODECLR        /* 0xBF848804 */
  .extern U5MODESET        /* 0xBF848808 */
  .extern U5MODEINV        /* 0xBF84880C */
  .extern U5STA            /* 0xBF848810 */
  .extern U5STACLR         /* 0xBF848814 */
  .extern U5STASET         /* 0xBF848818 */
  .extern U5STAINV         /* 0xBF84881C */
  .extern U5TXREG          /* 0xBF848820 */
  .extern U5RXREG          /* 0xBF848830 */
  .extern U5BRG            /* 0xBF848840 */
  .extern U5BRGCLR         /* 0xBF848844 */
  .extern U5BRGSET         /* 0xBF848848 */
  .extern U5BRGINV         /* 0xBF84884C */
  .extern U6MODE           /* 0xBF848A00 */
  .extern U6MODECLR        /* 0xBF848A04 */
  .extern U6MODESET        /* 0xBF848A08 */
  .extern U6MODEINV        /* 0xBF848A0C */
  .extern U6STA            /* 0xBF848A10 */
  .extern U6STACLR         /* 0xBF848A14 */
  .extern U6STASET         /* 0xBF848A18 */
  .extern U6STAINV         /* 0xBF848A1C */
  .extern U6TXREG          /* 0xBF848A20 */
  .extern U6RXREG          /* 0xBF848A30 */
  .extern U6BRG            /* 0xBF848A40 */
  .extern U6BRGCLR         /* 0xBF848A44 */
  .extern U6BRGSET         /* 0xBF848A48 */
  .extern U6BRGINV         /* 0xBF848A4C */
  .extern DAC2CON          /* 0xBF84C400 */
  .extern DAC2CONCLR       /* 0xBF84C404 */
  .extern DAC2CONSET       /* 0xBF84C408 */
  .extern DAC2CONINV       /* 0xBF84C40C */
  .extern DAC3CON          /* 0xBF84C600 */
  .extern DAC3CONCLR       /* 0xBF84C604 */
  .extern DAC3CONSET       /* 0xBF84C608 */
  .extern DAC3CONINV       /* 0xBF84C60C */
  .extern ANSELA           /* 0xBF860000 */
  .extern ANSELACLR        /* 0xBF860004 */
  .extern ANSELASET        /* 0xBF860008 */
  .extern ANSELAINV        /* 0xBF86000C */
  .extern TRISA            /* 0xBF860010 */
  .extern TRISACLR         /* 0xBF860014 */
  .extern TRISASET         /* 0xBF860018 */
  .extern TRISAINV         /* 0xBF86001C */
  .extern PORTA            /* 0xBF860020 */
  .extern PORTACLR         /* 0xBF860024 */
  .extern PORTASET         /* 0xBF860028 */
  .extern PORTAINV         /* 0xBF86002C */
  .extern LATA             /* 0xBF860030 */
  .extern LATACLR          /* 0xBF860034 */
  .extern LATASET          /* 0xBF860038 */
  .extern LATAINV          /* 0xBF86003C */
  .extern ODCA             /* 0xBF860040 */
  .extern ODCACLR          /* 0xBF860044 */
  .extern ODCASET          /* 0xBF860048 */
  .extern ODCAINV          /* 0xBF86004C */
  .extern CNPUA            /* 0xBF860050 */
  .extern CNPUACLR         /* 0xBF860054 */
  .extern CNPUASET         /* 0xBF860058 */
  .extern CNPUAINV         /* 0xBF86005C */
  .extern CNPDA            /* 0xBF860060 */
  .extern CNPDACLR         /* 0xBF860064 */
  .extern CNPDASET         /* 0xBF860068 */
  .extern CNPDAINV         /* 0xBF86006C */
  .extern CNCONA           /* 0xBF860070 */
  .extern CNCONACLR        /* 0xBF860074 */
  .extern CNCONASET        /* 0xBF860078 */
  .extern CNCONAINV        /* 0xBF86007C */
  .extern CNENA            /* 0xBF860080 */
  .extern CNENACLR         /* 0xBF860084 */
  .extern CNENASET         /* 0xBF860088 */
  .extern CNENAINV         /* 0xBF86008C */
  .extern CNSTATA          /* 0xBF860090 */
  .extern CNSTATACLR       /* 0xBF860094 */
  .extern CNSTATASET       /* 0xBF860098 */
  .extern CNSTATAINV       /* 0xBF86009C */
  .extern CNNEA            /* 0xBF8600A0 */
  .extern CNNEACLR         /* 0xBF8600A4 */
  .extern CNNEASET         /* 0xBF8600A8 */
  .extern CNNEAINV         /* 0xBF8600AC */
  .extern CNFA             /* 0xBF8600B0 */
  .extern CNFACLR          /* 0xBF8600B4 */
  .extern CNFASET          /* 0xBF8600B8 */
  .extern CNFAINV          /* 0xBF8600BC */
  .extern SRCON0A          /* 0xBF8600C0 */
  .extern SRCON0ACLR       /* 0xBF8600C4 */
  .extern SRCON0ASET       /* 0xBF8600C8 */
  .extern SRCON0AINV       /* 0xBF8600CC */
  .extern SRCON1A          /* 0xBF8600D0 */
  .extern SRCON1ACLR       /* 0xBF8600D4 */
  .extern SRCON1ASET       /* 0xBF8600D8 */
  .extern SRCON1AINV       /* 0xBF8600DC */
  .extern ANSELB           /* 0xBF860100 */
  .extern ANSELBCLR        /* 0xBF860104 */
  .extern ANSELBSET        /* 0xBF860108 */
  .extern ANSELBINV        /* 0xBF86010C */
  .extern TRISB            /* 0xBF860110 */
  .extern TRISBCLR         /* 0xBF860114 */
  .extern TRISBSET         /* 0xBF860118 */
  .extern TRISBINV         /* 0xBF86011C */
  .extern PORTB            /* 0xBF860120 */
  .extern PORTBCLR         /* 0xBF860124 */
  .extern PORTBSET         /* 0xBF860128 */
  .extern PORTBINV         /* 0xBF86012C */
  .extern LATB             /* 0xBF860130 */
  .extern LATBCLR          /* 0xBF860134 */
  .extern LATBSET          /* 0xBF860138 */
  .extern LATBINV          /* 0xBF86013C */
  .extern ODCB             /* 0xBF860140 */
  .extern ODCBCLR          /* 0xBF860144 */
  .extern ODCBSET          /* 0xBF860148 */
  .extern ODCBINV          /* 0xBF86014C */
  .extern CNPUB            /* 0xBF860150 */
  .extern CNPUBCLR         /* 0xBF860154 */
  .extern CNPUBSET         /* 0xBF860158 */
  .extern CNPUBINV         /* 0xBF86015C */
  .extern CNPDB            /* 0xBF860160 */
  .extern CNPDBCLR         /* 0xBF860164 */
  .extern CNPDBSET         /* 0xBF860168 */
  .extern CNPDBINV         /* 0xBF86016C */
  .extern CNCONB           /* 0xBF860170 */
  .extern CNCONBCLR        /* 0xBF860174 */
  .extern CNCONBSET        /* 0xBF860178 */
  .extern CNCONBINV        /* 0xBF86017C */
  .extern CNENB            /* 0xBF860180 */
  .extern CNENBCLR         /* 0xBF860184 */
  .extern CNENBSET         /* 0xBF860188 */
  .extern CNENBINV         /* 0xBF86018C */
  .extern CNSTATB          /* 0xBF860190 */
  .extern CNSTATBCLR       /* 0xBF860194 */
  .extern CNSTATBSET       /* 0xBF860198 */
  .extern CNSTATBINV       /* 0xBF86019C */
  .extern CNNEB            /* 0xBF8601A0 */
  .extern CNNEBCLR         /* 0xBF8601A4 */
  .extern CNNEBSET         /* 0xBF8601A8 */
  .extern CNNEBINV         /* 0xBF8601AC */
  .extern CNFB             /* 0xBF8601B0 */
  .extern CNFBCLR          /* 0xBF8601B4 */
  .extern CNFBSET          /* 0xBF8601B8 */
  .extern CNFBINV          /* 0xBF8601BC */
  .extern SRCON0B          /* 0xBF8601C0 */
  .extern SRCON0BCLR       /* 0xBF8601C4 */
  .extern SRCON0BSET       /* 0xBF8601C8 */
  .extern SRCON0BINV       /* 0xBF8601CC */
  .extern SRCON1B          /* 0xBF8601D0 */
  .extern SRCON1BCLR       /* 0xBF8601D4 */
  .extern SRCON1BSET       /* 0xBF8601D8 */
  .extern SRCON1BINV       /* 0xBF8601DC */
  .extern ANSELC           /* 0xBF860200 */
  .extern ANSELCCLR        /* 0xBF860204 */
  .extern ANSELCSET        /* 0xBF860208 */
  .extern ANSELCINV        /* 0xBF86020C */
  .extern TRISC            /* 0xBF860210 */
  .extern TRISCCLR         /* 0xBF860214 */
  .extern TRISCSET         /* 0xBF860218 */
  .extern TRISCINV         /* 0xBF86021C */
  .extern PORTC            /* 0xBF860220 */
  .extern PORTCCLR         /* 0xBF860224 */
  .extern PORTCSET         /* 0xBF860228 */
  .extern PORTCINV         /* 0xBF86022C */
  .extern LATC             /* 0xBF860230 */
  .extern LATCCLR          /* 0xBF860234 */
  .extern LATCSET          /* 0xBF860238 */
  .extern LATCINV          /* 0xBF86023C */
  .extern ODCC             /* 0xBF860240 */
  .extern ODCCCLR          /* 0xBF860244 */
  .extern ODCCSET          /* 0xBF860248 */
  .extern ODCCINV          /* 0xBF86024C */
  .extern CNPUC            /* 0xBF860250 */
  .extern CNPUCCLR         /* 0xBF860254 */
  .extern CNPUCSET         /* 0xBF860258 */
  .extern CNPUCINV         /* 0xBF86025C */
  .extern CNPDC            /* 0xBF860260 */
  .extern CNPDCCLR         /* 0xBF860264 */
  .extern CNPDCSET         /* 0xBF860268 */
  .extern CNPDCINV         /* 0xBF86026C */
  .extern CNCONC           /* 0xBF860270 */
  .extern CNCONCCLR        /* 0xBF860274 */
  .extern CNCONCSET        /* 0xBF860278 */
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern CNNEC            /* 0xBF8602A0 */
  .extern CNNECCLR         /* 0xBF8602A4 */
  .extern CNNECSET         /* 0xBF8602A8 */
  .extern CNNECINV         /* 0xBF8602AC */
  .extern CNFC             /* 0xBF8602B0 */
  .extern CNFCCLR          /* 0xBF8602B4 */
  .extern CNFCSET          /* 0xBF8602B8 */
  .extern CNFCINV          /* 0xBF8602BC */
  .extern SRCON0C          /* 0xBF8602C0 */
  .extern SRCON0CCLR       /* 0xBF8602C4 */
  .extern SRCON0CSET       /* 0xBF8602C8 */
  .extern SRCON0CINV       /* 0xBF8602CC */
  .extern SRCON1C          /* 0xBF8602D0 */
  .extern SRCON1CCLR       /* 0xBF8602D4 */
  .extern SRCON1CSET       /* 0xBF8602D8 */
  .extern SRCON1CINV       /* 0xBF8602DC */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
