Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern CNNED            /* 0xBF8603A0 */
  .extern CNNEDCLR         /* 0xBF8603A4 */
  .extern CNNEDSET         /* 0xBF8603A8 */
  .extern CNNEDINV         /* 0xBF8603AC */
  .extern CNFD             /* 0xBF8603B0 */
  .extern CNFDCLR          /* 0xBF8603B4 */
  .extern CNFDSET          /* 0xBF8603B8 */
  .extern CNFDINV          /* 0xBF8603BC */
  .extern SRCON0D          /* 0xBF8603C0 */
  .extern SRCON0DCLR       /* 0xBF8603C4 */
  .extern SRCON0DSET       /* 0xBF8603C8 */
  .extern SRCON0DINV       /* 0xBF8603CC */
  .extern SRCON1D          /* 0xBF8603D0 */
  .extern SRCON1DCLR       /* 0xBF8603D4 */
  .extern SRCON1DSET       /* 0xBF8603D8 */
  .extern SRCON1DINV       /* 0xBF8603DC */
  .extern ANSELE           /* 0xBF860400 */
  .extern ANSELECLR        /* 0xBF860404 */
  .extern ANSELESET        /* 0xBF860408 */
  .extern ANSELEINV        /* 0xBF86040C */
  .extern TRISE            /* 0xBF860410 */
  .extern TRISECLR         /* 0xBF860414 */
  .extern TRISESET         /* 0xBF860418 */
  .extern TRISEINV         /* 0xBF86041C */
  .extern PORTE            /* 0xBF860420 */
  .extern PORTECLR         /* 0xBF860424 */
  .extern PORTESET         /* 0xBF860428 */
  .extern PORTEINV         /* 0xBF86042C */
  .extern LATE             /* 0xBF860430 */
  .extern LATECLR          /* 0xBF860434 */
  .extern LATESET          /* 0xBF860438 */
  .extern LATEINV          /* 0xBF86043C */
  .extern ODCE             /* 0xBF860440 */
  .extern ODCECLR          /* 0xBF860444 */
  .extern ODCESET          /* 0xBF860448 */
  .extern ODCEINV          /* 0xBF86044C */
  .extern CNPUE            /* 0xBF860450 */
  .extern CNPUECLR         /* 0xBF860454 */
  .extern CNPUESET         /* 0xBF860458 */
  .extern CNPUEINV         /* 0xBF86045C */
  .extern CNPDE            /* 0xBF860460 */
  .extern CNPDECLR         /* 0xBF860464 */
  .extern CNPDESET         /* 0xBF860468 */
  .extern CNPDEINV         /* 0xBF86046C */
  .extern CNCONE           /* 0xBF860470 */
  .extern CNCONECLR        /* 0xBF860474 */
  .extern CNCONESET        /* 0xBF860478 */
  .extern CNCONEINV        /* 0xBF86047C */
  .extern CNENE            /* 0xBF860480 */
  .extern CNENECLR         /* 0xBF860484 */
  .extern CNENESET         /* 0xBF860488 */
  .extern CNENEINV         /* 0xBF86048C */
  .extern CNSTATE          /* 0xBF860490 */
  .extern CNSTATECLR       /* 0xBF860494 */
  .extern CNSTATESET       /* 0xBF860498 */
  .extern CNSTATEINV       /* 0xBF86049C */
  .extern CNNEE            /* 0xBF8604A0 */
  .extern CNNEECLR         /* 0xBF8604A4 */
  .extern CNNEESET         /* 0xBF8604A8 */
  .extern CNNEEINV         /* 0xBF8604AC */
  .extern CNFE             /* 0xBF8604B0 */
  .extern CNFECLR          /* 0xBF8604B4 */
  .extern CNFESET          /* 0xBF8604B8 */
  .extern CNFEINV          /* 0xBF8604BC */
  .extern SRCON0E          /* 0xBF8604C0 */
  .extern SRCON0ECLR       /* 0xBF8604C4 */
  .extern SRCON0ESET       /* 0xBF8604C8 */
  .extern SRCON0EINV       /* 0xBF8604CC */
  .extern SRCON1E          /* 0xBF8604D0 */
  .extern SRCON1ECLR       /* 0xBF8604D4 */
  .extern SRCON1ESET       /* 0xBF8604D8 */
  .extern SRCON1EINV       /* 0xBF8604DC */
  .extern TRISF            /* 0xBF860510 */
  .extern TRISFCLR         /* 0xBF860514 */
  .extern TRISFSET         /* 0xBF860518 */
  .extern TRISFINV         /* 0xBF86051C */
  .extern PORTF            /* 0xBF860520 */
  .extern PORTFCLR         /* 0xBF860524 */
  .extern PORTFSET         /* 0xBF860528 */
  .extern PORTFINV         /* 0xBF86052C */
  .extern LATF             /* 0xBF860530 */
  .extern LATFCLR          /* 0xBF860534 */
  .extern LATFSET          /* 0xBF860538 */
  .extern LATFINV          /* 0xBF86053C */
  .extern ODCF             /* 0xBF860540 */
  .extern ODCFCLR          /* 0xBF860544 */
  .extern ODCFSET          /* 0xBF860548 */
  .extern ODCFINV          /* 0xBF86054C */
  .extern CNPUF            /* 0xBF860550 */
  .extern CNPUFCLR         /* 0xBF860554 */
  .extern CNPUFSET         /* 0xBF860558 */
  .extern CNPUFINV         /* 0xBF86055C */
  .extern CNPDF            /* 0xBF860560 */
  .extern CNPDFCLR         /* 0xBF860564 */
  .extern CNPDFSET         /* 0xBF860568 */
  .extern CNPDFINV         /* 0xBF86056C */
  .extern CNCONF           /* 0xBF860570 */
  .extern CNCONFCLR        /* 0xBF860574 */
  .extern CNCONFSET        /* 0xBF860578 */
  .extern CNCONFINV        /* 0xBF86057C */
  .extern CNENF            /* 0xBF860580 */
  .extern CNENFCLR         /* 0xBF860584 */
  .extern CNENFSET         /* 0xBF860588 */
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern CNNEF            /* 0xBF8605A0 */
  .extern CNNEFCLR         /* 0xBF8605A4 */
  .extern CNNEFSET         /* 0xBF8605A8 */
  .extern CNNEFINV         /* 0xBF8605AC */
  .extern CNFF             /* 0xBF8605B0 */
  .extern CNFFCLR          /* 0xBF8605B4 */
  .extern CNFFSET          /* 0xBF8605B8 */
  .extern CNFFINV          /* 0xBF8605BC */
  .extern SRCON0F          /* 0xBF8605C0 */
  .extern SRCON0FCLR       /* 0xBF8605C4 */
  .extern SRCON0FSET       /* 0xBF8605C8 */
  .extern SRCON0FINV       /* 0xBF8605CC */
  .extern SRCON1F          /* 0xBF8605D0 */
  .extern SRCON1FCLR       /* 0xBF8605D4 */
  .extern SRCON1FSET       /* 0xBF8605D8 */
  .extern SRCON1FINV       /* 0xBF8605DC */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
  .extern ODCGSET          /* 0xBF860648 */
  .extern ODCGINV          /* 0xBF86064C */
  .extern CNPUG            /* 0xBF860650 */
  .extern CNPUGCLR         /* 0xBF860654 */
  .extern CNPUGSET         /* 0xBF860658 */
  .extern CNPUGINV         /* 0xBF86065C */
  .extern CNPDG            /* 0xBF860660 */
  .extern CNPDGCLR         /* 0xBF860664 */
  .extern CNPDGSET         /* 0xBF860668 */
  .extern CNPDGINV         /* 0xBF86066C */
  .extern CNCONG           /* 0xBF860670 */
  .extern CNCONGCLR        /* 0xBF860674 */
  .extern CNCONGSET        /* 0xBF860678 */
  .extern CNCONGINV        /* 0xBF86067C */
  .extern CNENG            /* 0xBF860680 */
  .extern CNENGCLR         /* 0xBF860684 */
  .extern CNENGSET         /* 0xBF860688 */
  .extern CNENGINV         /* 0xBF86068C */
  .extern CNSTATG          /* 0xBF860690 */
  .extern CNSTATGCLR       /* 0xBF860694 */
  .extern CNSTATGSET       /* 0xBF860698 */
  .extern CNSTATGINV       /* 0xBF86069C */
  .extern CNNEG            /* 0xBF8606A0 */
  .extern CNNEGCLR         /* 0xBF8606A4 */
  .extern CNNEGSET         /* 0xBF8606A8 */
  .extern CNNEGINV         /* 0xBF8606AC */
  .extern CNFG             /* 0xBF8606B0 */
  .extern CNFGCLR          /* 0xBF8606B4 */
  .extern CNFGSET          /* 0xBF8606B8 */
  .extern CNFGINV          /* 0xBF8606BC */
  .extern CFD1CON          /* 0xBF880000 */
  .extern CFD1CONCLR       /* 0xBF880004 */
  .extern CFD1CONSET       /* 0xBF880008 */
  .extern CFD1CONINV       /* 0xBF88000C */
  .extern CFD1NBTCFG       /* 0xBF880010 */
  .extern CFD1NBTCFGCLR    /* 0xBF880014 */
  .extern CFD1NBTCFGSET    /* 0xBF880018 */
  .extern CFD1NBTCFGINV    /* 0xBF88001C */
  .extern CFD1DBTCFG       /* 0xBF880020 */
  .extern CFD1DBTCFGCLR    /* 0xBF880024 */
  .extern CFD1DBTCFGSET    /* 0xBF880028 */
  .extern CFD1DBTCFGINV    /* 0xBF88002C */
  .extern CFD1TDC          /* 0xBF880030 */
  .extern CFD1TDCCLR       /* 0xBF880034 */
  .extern CFD1TDCSET       /* 0xBF880038 */
  .extern CFD1TDCINV       /* 0xBF88003C */
  .extern CFD1TBC          /* 0xBF880040 */
  .extern CFD1TBCCLR       /* 0xBF880044 */
  .extern CFD1TBCSET       /* 0xBF880048 */
  .extern CFD1TBCINV       /* 0xBF88004C */
  .extern CFD1TSCON        /* 0xBF880050 */
  .extern CFD1TSCONCLR     /* 0xBF880054 */
  .extern CFD1TSCONSET     /* 0xBF880058 */
  .extern CFD1TSCONINV     /* 0xBF88005C */
  .extern CFD1VEC          /* 0xBF880060 */
  .extern CFD1VECCLR       /* 0xBF880064 */
  .extern CFD1VECSET       /* 0xBF880068 */
  .extern CFD1VECINV       /* 0xBF88006C */
  .extern CFD1INT          /* 0xBF880070 */
  .extern CFD1INTCLR       /* 0xBF880074 */
  .extern CFD1INTSET       /* 0xBF880078 */
  .extern CFD1INTINV       /* 0xBF88007C */
  .extern CFD1RXIF         /* 0xBF880080 */
  .extern CFD1RXIFCLR      /* 0xBF880084 */
  .extern CFD1RXIFSET      /* 0xBF880088 */
  .extern CFD1RXIFINV      /* 0xBF88008C */
  .extern CFD1TXIF         /* 0xBF880090 */
  .extern CFD1TXIFCLR      /* 0xBF880094 */
  .extern CFD1TXIFSET      /* 0xBF880098 */
  .extern CFD1TXIFINV      /* 0xBF88009C */
  .extern CFD1RXOVIF       /* 0xBF8800A0 */
  .extern CFD1RXOVIFCLR    /* 0xBF8800A4 */
  .extern CFD1RXOVIFSET    /* 0xBF8800A8 */
  .extern CFD1RXOVIFINV    /* 0xBF8800AC */
  .extern CFD1TXATIF       /* 0xBF8800B0 */
  .extern CFD1TXATIFCLR    /* 0xBF8800B4 */
  .extern CFD1TXATIFSET    /* 0xBF8800B8 */
  .extern CFD1TXATIFINV    /* 0xBF8800BC */
  .extern CFD1TXREQ        /* 0xBF8800C0 */
  .extern CFD1TXREQCLR     /* 0xBF8800C4 */
  .extern CFD1TXREQSET     /* 0xBF8800C8 */
  .extern CFD1TXREQINV     /* 0xBF8800CC */
  .extern CFD1TREC         /* 0xBF8800D0 */
  .extern CFD1TRECCLR      /* 0xBF8800D4 */
  .extern CFD1TRECSET      /* 0xBF8800D8 */
  .extern CFD1TRECINV      /* 0xBF8800DC */
  .extern CFD1BDIAG0       /* 0xBF8800E0 */
  .extern CFD1BDIAG0CLR    /* 0xBF8800E4 */
  .extern CFD1BDIAG0SET    /* 0xBF8800E8 */
  .extern CFD1BDIAG0INV    /* 0xBF8800EC */
  .extern CFD1BDIAG1       /* 0xBF8800F0 */
  .extern CFD1BDIAG1CLR    /* 0xBF8800F4 */
  .extern CFD1BDIAG1SET    /* 0xBF8800F8 */
  .extern CFD1BDIAG1INV    /* 0xBF8800FC */
  .extern CFD1TEFCON       /* 0xBF880100 */
  .extern CFD1TEFCONCLR    /* 0xBF880104 */
  .extern CFD1TEFCONSET    /* 0xBF880108 */
  .extern CFD1TEFCONINV    /* 0xBF88010C */
  .extern CFD1TEFSTA       /* 0xBF880110 */
  .extern CFD1TEFSTACLR    /* 0xBF880114 */
  .extern CFD1TEFSTASET    /* 0xBF880118 */
  .extern CFD1TEFSTAINV    /* 0xBF88011C */
  .extern CFD1TEFUA        /* 0xBF880120 */
  .extern CFD1TEFUACLR     /* 0xBF880124 */
  .extern CFD1TEFUASET     /* 0xBF880128 */
  .extern CFD1TEFUAINV     /* 0xBF88012C */
  .extern CFD1FIFOBA       /* 0xBF880130 */
  .extern CFD1FIFOBACLR    /* 0xBF880134 */
  .extern CFD1FIFOBASET    /* 0xBF880138 */
  .extern CFD1FIFOBAINV    /* 0xBF88013C */
  .extern CFD1TXQCON       /* 0xBF880140 */
  .extern CFD1TXQCONCLR    /* 0xBF880144 */
  .extern CFD1TXQCONSET    /* 0xBF880148 */
  .extern CFD1TXQCONINV    /* 0xBF88014C */
  .extern CFD1TXQSTA       /* 0xBF880150 */
  .extern CFD1TXQSTACLR    /* 0xBF880154 */
  .extern CFD1TXQSTASET    /* 0xBF880158 */
  .extern CFD1TXQSTAINV    /* 0xBF88015C */
  .extern CFD1TXQUA        /* 0xBF880160 */
  .extern CFD1TXQUACLR     /* 0xBF880164 */
  .extern CFD1TXQUASET     /* 0xBF880168 */
  .extern CFD1TXQUAINV     /* 0xBF88016C */
  .extern CFD1FIFOCON1     /* 0xBF880170 */
  .extern CFD1FIFOCON1CLR  /* 0xBF880174 */
  .extern CFD1FIFOCON1SET  /* 0xBF880178 */
  .extern CFD1FIFOCON1INV  /* 0xBF88017C */
  .extern CFD1FIFOSTA1     /* 0xBF880180 */
  .extern CFD1FIFOSTA1CLR  /* 0xBF880184 */
  .extern CFD1FIFOSTA1SET  /* 0xBF880188 */
  .extern CFD1FIFOSTA1INV  /* 0xBF88018C */
  .extern CFD1FIFOUA1      /* 0xBF880190 */
  .extern CFD1FIFOUA1CLR   /* 0xBF880194 */
  .extern CFD1FIFOUA1SET   /* 0xBF880198 */
  .extern CFD1FIFOUA1INV   /* 0xBF88019C */
  .extern CFD1FIFOCON2     /* 0xBF8801A0 */
  .extern CFD1FIFOCON2CLR  /* 0xBF8801A4 */
  .extern CFD1FIFOCON2SET  /* 0xBF8801A8 */
  .extern CFD1FIFOCON2INV  /* 0xBF8801AC */
  .extern CFD1FIFOSTA2     /* 0xBF8801B0 */
  .extern CFD1FIFOSTA2CLR  /* 0xBF8801B4 */
  .extern CFD1FIFOSTA2SET  /* 0xBF8801B8 */
  .extern CFD1FIFOSTA2INV  /* 0xBF8801BC */
  .extern CFD1FIFOUA2      /* 0xBF8801C0 */
  .extern CFD1FIFOUA2CLR   /* 0xBF8801C4 */
  .extern CFD1FIFOUA2SET   /* 0xBF8801C8 */
  .extern CFD1FIFOUA2INV   /* 0xBF8801CC */
  .extern CFD1FIFOCON3     /* 0xBF8801D0 */
  .extern CFD1FIFOCON3CLR  /* 0xBF8801D4 */
  .extern CFD1FIFOCON3SET  /* 0xBF8801D8 */
  .extern CFD1FIFOCON3INV  /* 0xBF8801DC */
  .extern CFD1FIFOSTA3     /* 0xBF8801E0 */
  .extern CFD1FIFOSTA3CLR  /* 0xBF8801E4 */
  .extern CFD1FIFOSTA3SET  /* 0xBF8801E8 */
  .extern CFD1FIFOSTA3INV  /* 0xBF8801EC */
  .extern CFD1FIFOUA3      /* 0xBF8801F0 */
  .extern CFD1FIFOUA3CLR   /* 0xBF8801F4 */
  .extern CFD1FIFOUA3SET   /* 0xBF8801F8 */
  .extern CFD1FIFOUA3INV   /* 0xBF8801FC */
  .extern CFD1FIFOCON4     /* 0xBF880200 */
  .extern CFD1FIFOCON4CLR  /* 0xBF880204 */
  .extern CFD1FIFOCON4SET  /* 0xBF880208 */
  .extern CFD1FIFOCON4INV  /* 0xBF88020C */
  .extern CFD1FIFOSTA4     /* 0xBF880210 */
  .extern CFD1FIFOSTA4CLR  /* 0xBF880214 */
  .extern CFD1FIFOSTA4SET  /* 0xBF880218 */
  .extern CFD1FIFOSTA4INV  /* 0xBF88021C */
  .extern CFD1FIFOUA4      /* 0xBF880220 */
  .extern CFD1FIFOUA4CLR   /* 0xBF880224 */
  .extern CFD1FIFOUA4SET   /* 0xBF880228 */
  .extern CFD1FIFOUA4INV   /* 0xBF88022C */
  .extern CFD1FIFOCON5     /* 0xBF880230 */
  .extern CFD1FIFOCON5CLR  /* 0xBF880234 */
  .extern CFD1FIFOCON5SET  /* 0xBF880238 */
  .extern CFD1FIFOCON5INV  /* 0xBF88023C */
  .extern CFD1FIFOSTA5     /* 0xBF880240 */
  .extern CFD1FIFOSTA5CLR  /* 0xBF880244 */
  .extern CFD1FIFOSTA5SET  /* 0xBF880248 */
  .extern CFD1FIFOSTA5INV  /* 0xBF88024C */
  .extern CFD1FIFOUA5      /* 0xBF880250 */
  .extern CFD1FIFOUA5CLR   /* 0xBF880254 */
  .extern CFD1FIFOUA5SET   /* 0xBF880258 */
  .extern CFD1FIFOUA5INV   /* 0xBF88025C */
  .extern CFD1FIFOCON6     /* 0xBF880260 */
  .extern CFD1FIFOCON6CLR  /* 0xBF880264 */
  .extern CFD1FIFOCON6SET  /* 0xBF880268 */
  .extern CFD1FIFOCON6INV  /* 0xBF88026C */
  .extern CFD1FIFOSTA6     /* 0xBF880270 */
  .extern CFD1FIFOSTA6CLR  /* 0xBF880274 */
  .extern CFD1FIFOSTA6SET  /* 0xBF880278 */
  .extern CFD1FIFOSTA6INV  /* 0xBF88027C */
  .extern CFD1FIFOUA6      /* 0xBF880280 */
  .extern CFD1FIFOUA6CLR   /* 0xBF880284 */
  .extern CFD1FIFOUA6SET   /* 0xBF880288 */
  .extern CFD1FIFOUA6INV   /* 0xBF88028C */
  .extern CFD1FIFOCON7     /* 0xBF880290 */
  .extern CFD1FIFOCON7CLR  /* 0xBF880294 */
  .extern CFD1FIFOCON7SET  /* 0xBF880298 */
  .extern CFD1FIFOCON7INV  /* 0xBF88029C */
  .extern CFD1FIFOSTA7     /* 0xBF8802A0 */
  .extern CFD1FIFOSTA7CLR  /* 0xBF8802A4 */
  .extern CFD1FIFOSTA7SET  /* 0xBF8802A8 */
  .extern CFD1FIFOSTA7INV  /* 0xBF8802AC */
  .extern CFD1FIFOUA7      /* 0xBF8802B0 */
  .extern CFD1FIFOUA7CLR   /* 0xBF8802B4 */
  .extern CFD1FIFOUA7SET   /* 0xBF8802B8 */
  .extern CFD1FIFOUA7INV   /* 0xBF8802BC */
  .extern CFD1FIFOCON8     /* 0xBF8802C0 */
  .extern CFD1FIFOCON8CLR  /* 0xBF8802C4 */
  .extern CFD1FIFOCON8SET  /* 0xBF8802C8 */
  .extern CFD1FIFOCON8INV  /* 0xBF8802CC */
  .extern CFD1FIFOSTA8     /* 0xBF8802D0 */
  .extern CFD1FIFOSTA8CLR  /* 0xBF8802D4 */
  .extern CFD1FIFOSTA8SET  /* 0xBF8802D8 */
  .extern CFD1FIFOSTA8INV  /* 0xBF8802DC */
  .extern CFD1FIFOUA8      /* 0xBF8802E0 */
  .extern CFD1FIFOUA8CLR   /* 0xBF8802E4 */
  .extern CFD1FIFOUA8SET   /* 0xBF8802E8 */
  .extern CFD1FIFOUA8INV   /* 0xBF8802EC */
  .extern CFD1FIFOCON9     /* 0xBF8802F0 */
  .extern CFD1FIFOCON9CLR  /* 0xBF8802F4 */
  .extern CFD1FIFOCON9SET  /* 0xBF8802F8 */
  .extern CFD1FIFOCON9INV  /* 0xBF8802FC */
  .extern CFD1FIFOSTA9     /* 0xBF880300 */
  .extern CFD1FIFOSTA9CLR  /* 0xBF880304 */
  .extern CFD1FIFOSTA9SET  /* 0xBF880308 */
  .extern CFD1FIFOSTA9INV  /* 0xBF88030C */
  .extern CFD1FIFOUA9      /* 0xBF880310 */
  .extern CFD1FIFOUA9CLR   /* 0xBF880314 */
  .extern CFD1FIFOUA9SET   /* 0xBF880318 */
  .extern CFD1FIFOUA9INV   /* 0xBF88031C */
  .extern CFD1FIFOCON10    /* 0xBF880320 */
  .extern CFD1FIFOCON10CLR /* 0xBF880324 */
  .extern CFD1FIFOCON10SET /* 0xBF880328 */
  .extern CFD1FIFOCON10INV /* 0xBF88032C */
  .extern CFD1FIFOSTA10    /* 0xBF880330 */
  .extern CFD1FIFOSTA10CLR /* 0xBF880334 */
  .extern CFD1FIFOSTA10SET /* 0xBF880338 */
  .extern CFD1FIFOSTA10INV /* 0xBF88033C */
  .extern CFD1FIFOUA10     /* 0xBF880340 */
  .extern CFD1FIFOUA10CLR  /* 0xBF880344 */
  .extern CFD1FIFOUA10SET  /* 0xBF880348 */
  .extern CFD1FIFOUA10INV  /* 0xBF88034C */
  .extern CFD1FIFOCON11    /* 0xBF880350 */
  .extern CFD1FIFOCON11CLR /* 0xBF880354 */
  .extern CFD1FIFOCON11SET /* 0xBF880358 */
  .extern CFD1FIFOCON11INV /* 0xBF88035C */
  .extern CFD1FIFOSTA11    /* 0xBF880360 */
  .extern CFD1FIFOSTA11CLR /* 0xBF880364 */
  .extern CFD1FIFOSTA11SET /* 0xBF880368 */
  .extern CFD1FIFOSTA11INV /* 0xBF88036C */
  .extern CFD1FIFOUA11     /* 0xBF880370 */
  .extern CFD1FIFOUA11CLR  /* 0xBF880374 */
  .extern CFD1FIFOUA11SET  /* 0xBF880378 */
  .extern CFD1FIFOUA11INV  /* 0xBF88037C */
  .extern CFD1FIFOCON12    /* 0xBF880380 */
  .extern CFD1FIFOCON12CLR /* 0xBF880384 */
  .extern CFD1FIFOCON12SET /* 0xBF880388 */
  .extern CFD1FIFOCON12INV /* 0xBF88038C */
  .extern CFD1FIFOSTA12    /* 0xBF880390 */
  .extern CFD1FIFOSTA12CLR /* 0xBF880394 */
  .extern CFD1FIFOSTA12SET /* 0xBF880398 */
  .extern CFD1FIFOSTA12INV /* 0xBF88039C */
  .extern CFD1FIFOUA12     /* 0xBF8803A0 */
  .extern CFD1FIFOUA12CLR  /* 0xBF8803A4 */
  .extern CFD1FIFOUA12SET  /* 0xBF8803A8 */
  .extern CFD1FIFOUA12INV  /* 0xBF8803AC */
  .extern CFD1FIFOCON13    /* 0xBF8803B0 */
  .extern CFD1FIFOCON13CLR /* 0xBF8803B4 */
  .extern CFD1FIFOCON13SET /* 0xBF8803B8 */
  .extern CFD1FIFOCON13INV /* 0xBF8803BC */
  .extern CFD1FIFOSTA13    /* 0xBF8803C0 */
  .extern CFD1FIFOSTA13CLR /* 0xBF8803C4 */
  .extern CFD1FIFOSTA13SET /* 0xBF8803C8 */
  .extern CFD1FIFOSTA13INV /* 0xBF8803CC */
  .extern CFD1FIFOUA13     /* 0xBF8803D0 */
  .extern CFD1FIFOUA13CLR  /* 0xBF8803D4 */
  .extern CFD1FIFOUA13SET  /* 0xBF8803D8 */
  .extern CFD1FIFOUA13INV  /* 0xBF8803DC */
  .extern CFD1FIFOCON14    /* 0xBF8803E0 */
  .extern CFD1FIFOCON14CLR /* 0xBF8803E4 */
  .extern CFD1FIFOCON14SET /* 0xBF8803E8 */
  .extern CFD1FIFOCON14INV /* 0xBF8803EC */
  .extern CFD1FIFOSTA14    /* 0xBF8803F0 */
  .extern CFD1FIFOSTA14CLR /* 0xBF8803F4 */
  .extern CFD1FIFOSTA14SET /* 0xBF8803F8 */
  .extern CFD1FIFOSTA14INV /* 0xBF8803FC */
  .extern CFD1FIFOUA14     /* 0xBF880400 */
  .extern CFD1FIFOUA14CLR  /* 0xBF880404 */
  .extern CFD1FIFOUA14SET  /* 0xBF880408 */
  .extern CFD1FIFOUA14INV  /* 0xBF88040C */
  .extern CFD1FIFOCON15    /* 0xBF880410 */
  .extern CFD1FIFOCON15CLR /* 0xBF880414 */
  .extern CFD1FIFOCON15SET /* 0xBF880418 */
  .extern CFD1FIFOCON15INV /* 0xBF88041C */
  .extern CFD1FIFOSTA15    /* 0xBF880420 */
  .extern CFD1FIFOSTA15CLR /* 0xBF880424 */
  .extern CFD1FIFOSTA15SET /* 0xBF880428 */
  .extern CFD1FIFOSTA15INV /* 0xBF88042C */
  .extern CFD1FIFOUA15     /* 0xBF880430 */
  .extern CFD1FIFOUA15CLR  /* 0xBF880434 */
  .extern CFD1FIFOUA15SET  /* 0xBF880438 */
  .extern CFD1FIFOUA15INV  /* 0xBF88043C */
  .extern CFD1FIFOCON16    /* 0xBF880440 */
  .extern CFD1FIFOCON16CLR /* 0xBF880444 */
  .extern CFD1FIFOCON16SET /* 0xBF880448 */
  .extern CFD1FIFOCON16INV /* 0xBF88044C */
  .extern CFD1FIFOSTA16    /* 0xBF880450 */
  .extern CFD1FIFOSTA16CLR /* 0xBF880454 */
  .extern CFD1FIFOSTA16SET /* 0xBF880458 */
  .extern CFD1FIFOSTA16INV /* 0xBF88045C */
  .extern CFD1FIFOUA16     /* 0xBF880460 */
  .extern CFD1FIFOUA16CLR  /* 0xBF880464 */
  .extern CFD1FIFOUA16SET  /* 0xBF880468 */
  .extern CFD1FIFOUA16INV  /* 0xBF88046C */
  .extern CFD1FIFOCON17    /* 0xBF880470 */
  .extern CFD1FIFOCON17CLR /* 0xBF880474 */
  .extern CFD1FIFOCON17SET /* 0xBF880478 */
  .extern CFD1FIFOCON17INV /* 0xBF88047C */
  .extern CFD1FIFOSTA17    /* 0xBF880480 */
  .extern CFD1FIFOSTA17CLR /* 0xBF880484 */
  .extern CFD1FIFOSTA17SET /* 0xBF880488 */
  .extern CFD1FIFOSTA17INV /* 0xBF88048C */
  .extern CFD1FIFOUA17     /* 0xBF880490 */
  .extern CFD1FIFOUA17CLR  /* 0xBF880494 */
  .extern CFD1FIFOUA17SET  /* 0xBF880498 */
  .extern CFD1FIFOUA17INV  /* 0xBF88049C */
  .extern CFD1FIFOCON18    /* 0xBF8804A0 */
  .extern CFD1FIFOCON18CLR /* 0xBF8804A4 */
  .extern CFD1FIFOCON18SET /* 0xBF8804A8 */
  .extern CFD1FIFOCON18INV /* 0xBF8804AC */
  .extern CFD1FIFOSTA18    /* 0xBF8804B0 */
  .extern CFD1FIFOSTA18CLR /* 0xBF8804B4 */
  .extern CFD1FIFOSTA18SET /* 0xBF8804B8 */
  .extern CFD1FIFOSTA18INV /* 0xBF8804BC */
  .extern CFD1FIFOUA18     /* 0xBF8804C0 */
  .extern CFD1FIFOUA18CLR  /* 0xBF8804C4 */
  .extern CFD1FIFOUA18SET  /* 0xBF8804C8 */
  .extern CFD1FIFOUA18INV  /* 0xBF8804CC */
  .extern CFD1FIFOCON19    /* 0xBF8804D0 */
  .extern CFD1FIFOCON19CLR /* 0xBF8804D4 */
  .extern CFD1FIFOCON19SET /* 0xBF8804D8 */
  .extern CFD1FIFOCON19INV /* 0xBF8804DC */
  .extern CFD1FIFOSTA19    /* 0xBF8804E0 */
  .extern CFD1FIFOSTA19CLR /* 0xBF8804E4 */
  .extern CFD1FIFOSTA19SET /* 0xBF8804E8 */
  .extern CFD1FIFOSTA19INV /* 0xBF8804EC */
  .extern CFD1FIFOUA19     /* 0xBF8804F0 */
  .extern CFD1FIFOUA19CLR  /* 0xBF8804F4 */
  .extern CFD1FIFOUA19SET  /* 0xBF8804F8 */
  .extern CFD1FIFOUA19INV  /* 0xBF8804FC */
  .extern CFD1FIFOCON20    /* 0xBF880500 */
  .extern CFD1FIFOCON20CLR /* 0xBF880504 */
  .extern CFD1FIFOCON20SET /* 0xBF880508 */
  .extern CFD1FIFOCON20INV /* 0xBF88050C */
  .extern CFD1FIFOSTA20    /* 0xBF880510 */
  .extern CFD1FIFOSTA20CLR /* 0xBF880514 */
  .extern CFD1FIFOSTA20SET /* 0xBF880518 */
  .extern CFD1FIFOSTA20INV /* 0xBF88051C */
  .extern CFD1FIFOUA20     /* 0xBF880520 */
  .extern CFD1FIFOUA20CLR  /* 0xBF880524 */
  .extern CFD1FIFOUA20SET  /* 0xBF880528 */
  .extern CFD1FIFOUA20INV  /* 0xBF88052C */
  .extern CFD1FIFOCON21    /* 0xBF880530 */
  .extern CFD1FIFOCON21CLR /* 0xBF880534 */
  .extern CFD1FIFOCON21SET /* 0xBF880538 */
  .extern CFD1FIFOCON21INV /* 0xBF88053C */
  .extern CFD1FIFOSTA21    /* 0xBF880540 */
  .extern CFD1FIFOSTA21CLR /* 0xBF880544 */
  .extern CFD1FIFOSTA21SET /* 0xBF880548 */
  .extern CFD1FIFOSTA21INV /* 0xBF88054C */
  .extern CFD1FIFOUA21     /* 0xBF880550 */
  .extern CFD1FIFOUA21CLR  /* 0xBF880554 */
  .extern CFD1FIFOUA21SET  /* 0xBF880558 */
  .extern CFD1FIFOUA21INV  /* 0xBF88055C */
  .extern CFD1FIFOCON22    /* 0xBF880560 */
  .extern CFD1FIFOCON22CLR /* 0xBF880564 */
  .extern CFD1FIFOCON22SET /* 0xBF880568 */
  .extern CFD1FIFOCON22INV /* 0xBF88056C */
  .extern CFD1FIFOSTA22    /* 0xBF880570 */
  .extern CFD1FIFOSTA22CLR /* 0xBF880574 */
  .extern CFD1FIFOSTA22SET /* 0xBF880578 */
  .extern CFD1FIFOSTA22INV /* 0xBF88057C */
  .extern CFD1FIFOUA22     /* 0xBF880580 */
  .extern CFD1FIFOUA22CLR  /* 0xBF880584 */
  .extern CFD1FIFOUA22SET  /* 0xBF880588 */
  .extern CFD1FIFOUA22INV  /* 0xBF88058C */
  .extern CFD1FIFOCON23    /* 0xBF880590 */
  .extern CFD1FIFOCON23CLR /* 0xBF880594 */
  .extern CFD1FIFOCON23SET /* 0xBF880598 */
  .extern CFD1FIFOCON23INV /* 0xBF88059C */
  .extern CFD1FIFOSTA23    /* 0xBF8805A0 */
  .extern CFD1FIFOSTA23CLR /* 0xBF8805A4 */
  .extern CFD1FIFOSTA23SET /* 0xBF8805A8 */
  .extern CFD1FIFOSTA23INV /* 0xBF8805AC */
  .extern CFD1FIFOUA23     /* 0xBF8805B0 */
  .extern CFD1FIFOUA23CLR  /* 0xBF8805B4 */
  .extern CFD1FIFOUA23SET  /* 0xBF8805B8 */
