Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern CFD1FIFOUA23INV  /* 0xBF8805BC */
  .extern CFD1FIFOCON24    /* 0xBF8805C0 */
  .extern CFD1FIFOCON24CLR /* 0xBF8805C4 */
  .extern CFD1FIFOCON24SET /* 0xBF8805C8 */
  .extern CFD1FIFOCON24INV /* 0xBF8805CC */
  .extern CFD1FIFOSTA24    /* 0xBF8805D0 */
  .extern CFD1FIFOSTA24CLR /* 0xBF8805D4 */
  .extern CFD1FIFOSTA24SET /* 0xBF8805D8 */
  .extern CFD1FIFOSTA24INV /* 0xBF8805DC */
  .extern CFD1FIFOUA24     /* 0xBF8805E0 */
  .extern CFD1FIFOUA24CLR  /* 0xBF8805E4 */
  .extern CFD1FIFOUA24SET  /* 0xBF8805E8 */
  .extern CFD1FIFOUA24INV  /* 0xBF8805EC */
  .extern CFD1FIFOCON25    /* 0xBF8805F0 */
  .extern CFD1FIFOCON25CLR /* 0xBF8805F4 */
  .extern CFD1FIFOCON25SET /* 0xBF8805F8 */
  .extern CFD1FIFOCON25INV /* 0xBF8805FC */
  .extern CFD1FIFOSTA25    /* 0xBF880600 */
  .extern CFD1FIFOSTA25CLR /* 0xBF880604 */
  .extern CFD1FIFOSTA25SET /* 0xBF880608 */
  .extern CFD1FIFOSTA25INV /* 0xBF88060C */
  .extern CFD1FIFOUA25     /* 0xBF880610 */
  .extern CFD1FIFOUA25CLR  /* 0xBF880614 */
  .extern CFD1FIFOUA25SET  /* 0xBF880618 */
  .extern CFD1FIFOUA25INV  /* 0xBF88061C */
  .extern CFD1FIFOCON26    /* 0xBF880620 */
  .extern CFD1FIFOCON26CLR /* 0xBF880624 */
  .extern CFD1FIFOCON26SET /* 0xBF880628 */
  .extern CFD1FIFOCON26INV /* 0xBF88062C */
  .extern CFD1FIFOSTA26    /* 0xBF880630 */
  .extern CFD1FIFOSTA26CLR /* 0xBF880634 */
  .extern CFD1FIFOSTA26SET /* 0xBF880638 */
  .extern CFD1FIFOSTA26INV /* 0xBF88063C */
  .extern CFD1FIFOUA26     /* 0xBF880640 */
  .extern CFD1FIFOUA26CLR  /* 0xBF880644 */
  .extern CFD1FIFOUA26SET  /* 0xBF880648 */
  .extern CFD1FIFOUA26INV  /* 0xBF88064C */
  .extern CFD1FIFOCON27    /* 0xBF880650 */
  .extern CFD1FIFOCON27CLR /* 0xBF880654 */
  .extern CFD1FIFOCON27SET /* 0xBF880658 */
  .extern CFD1FIFOCON27INV /* 0xBF88065C */
  .extern CFD1FIFOSTA27    /* 0xBF880660 */
  .extern CFD1FIFOSTA27CLR /* 0xBF880664 */
  .extern CFD1FIFOSTA27SET /* 0xBF880668 */
  .extern CFD1FIFOSTA27INV /* 0xBF88066C */
  .extern CFD1FIFOUA27     /* 0xBF880670 */
  .extern CFD1FIFOUA27CLR  /* 0xBF880674 */
  .extern CFD1FIFOUA27SET  /* 0xBF880678 */
  .extern CFD1FIFOUA27INV  /* 0xBF88067C */
  .extern CFD1FIFOCON28    /* 0xBF880680 */
  .extern CFD1FIFOCON28CLR /* 0xBF880684 */
  .extern CFD1FIFOCON28SET /* 0xBF880688 */
  .extern CFD1FIFOCON28INV /* 0xBF88068C */
  .extern CFD1FIFOSTA28    /* 0xBF880690 */
  .extern CFD1FIFOSTA28CLR /* 0xBF880694 */
  .extern CFD1FIFOSTA28SET /* 0xBF880698 */
  .extern CFD1FIFOSTA28INV /* 0xBF88069C */
  .extern CFD1FIFOUA28     /* 0xBF8806A0 */
  .extern CFD1FIFOUA28CLR  /* 0xBF8806A4 */
  .extern CFD1FIFOUA28SET  /* 0xBF8806A8 */
  .extern CFD1FIFOUA28INV  /* 0xBF8806AC */
  .extern CFD1FIFOCON29    /* 0xBF8806B0 */
  .extern CFD1FIFOCON29CLR /* 0xBF8806B4 */
  .extern CFD1FIFOCON29SET /* 0xBF8806B8 */
  .extern CFD1FIFOCON29INV /* 0xBF8806BC */
  .extern CFD1FIFOSTA29    /* 0xBF8806C0 */
  .extern CFD1FIFOSTA29CLR /* 0xBF8806C4 */
  .extern CFD1FIFOSTA29SET /* 0xBF8806C8 */
  .extern CFD1FIFOSTA29INV /* 0xBF8806CC */
  .extern CFD1FIFOUA29     /* 0xBF8806D0 */
  .extern CFD1FIFOUA29CLR  /* 0xBF8806D4 */
  .extern CFD1FIFOUA29SET  /* 0xBF8806D8 */
  .extern CFD1FIFOUA29INV  /* 0xBF8806DC */
  .extern CFD1FIFOCON30    /* 0xBF8806E0 */
  .extern CFD1FIFOCON30CLR /* 0xBF8806E4 */
  .extern CFD1FIFOCON30SET /* 0xBF8806E8 */
  .extern CFD1FIFOCON30INV /* 0xBF8806EC */
  .extern CFD1FIFOSTA30    /* 0xBF8806F0 */
  .extern CFD1FIFOSTA30CLR /* 0xBF8806F4 */
  .extern CFD1FIFOSTA30SET /* 0xBF8806F8 */
  .extern CFD1FIFOSTA30INV /* 0xBF8806FC */
  .extern CFD1FIFOUA30     /* 0xBF880700 */
  .extern CFD1FIFOUA30CLR  /* 0xBF880704 */
  .extern CFD1FIFOUA30SET  /* 0xBF880708 */
  .extern CFD1FIFOUA30INV  /* 0xBF88070C */
  .extern CFD1FIFOCON31    /* 0xBF880710 */
  .extern CFD1FIFOCON31CLR /* 0xBF880714 */
  .extern CFD1FIFOCON31SET /* 0xBF880718 */
  .extern CFD1FIFOCON31INV /* 0xBF88071C */
  .extern CFD1FIFOSTA31    /* 0xBF880720 */
  .extern CFD1FIFOSTA31CLR /* 0xBF880724 */
  .extern CFD1FIFOSTA31SET /* 0xBF880728 */
  .extern CFD1FIFOSTA31INV /* 0xBF88072C */
  .extern CFD1FIFOUA31     /* 0xBF880730 */
  .extern CFD1FIFOUA31CLR  /* 0xBF880734 */
  .extern CFD1FIFOUA31SET  /* 0xBF880738 */
  .extern CFD1FIFOUA31INV  /* 0xBF88073C */
  .extern CFD1FLTCON0      /* 0xBF880740 */
  .extern CFD1FLTCON0CLR   /* 0xBF880744 */
  .extern CFD1FLTCON0SET   /* 0xBF880748 */
  .extern CFD1FLTCON0INV   /* 0xBF88074C */
  .extern CFD1FLTCON1      /* 0xBF880750 */
  .extern CFD1FLTCON1CLR   /* 0xBF880754 */
  .extern CFD1FLTCON1SET   /* 0xBF880758 */
  .extern CFD1FLTCON1INV   /* 0xBF88075C */
  .extern CFD1FLTCON2      /* 0xBF880760 */
  .extern CFD1FLTCON2CLR   /* 0xBF880764 */
  .extern CFD1FLTCON2SET   /* 0xBF880768 */
  .extern CFD1FLTCON2INV   /* 0xBF88076C */
  .extern CFD1FLTCON3      /* 0xBF880770 */
  .extern CFD1FLTCON3CLR   /* 0xBF880774 */
  .extern CFD1FLTCON3SET   /* 0xBF880778 */
  .extern CFD1FLTCON3INV   /* 0xBF88077C */
  .extern CFD1FLTCON4      /* 0xBF880780 */
  .extern CFD1FLTCON4CLR   /* 0xBF880784 */
  .extern CFD1FLTCON4SET   /* 0xBF880788 */
  .extern CFD1FLTCON4INV   /* 0xBF88078C */
  .extern CFD1FLTCON5      /* 0xBF880790 */
  .extern CFD1FLTCON5CLR   /* 0xBF880794 */
  .extern CFD1FLTCON5SET   /* 0xBF880798 */
  .extern CFD1FLTCON5INV   /* 0xBF88079C */
  .extern CFD1FLTCON6      /* 0xBF8807A0 */
  .extern CFD1FLTCON6CLR   /* 0xBF8807A4 */
  .extern CFD1FLTCON6SET   /* 0xBF8807A8 */
  .extern CFD1FLTCON6INV   /* 0xBF8807AC */
  .extern CFD1FLTCON7      /* 0xBF8807B0 */
  .extern CFD1FLTCON7CLR   /* 0xBF8807B4 */
  .extern CFD1FLTCON7SET   /* 0xBF8807B8 */
  .extern CFD1FLTCON7INV   /* 0xBF8807BC */
  .extern CFD1FLTOBJ0      /* 0xBF8807C0 */
  .extern CFD1FLTOBJ0CLR   /* 0xBF8807C4 */
  .extern CFD1FLTOBJ0SET   /* 0xBF8807C8 */
  .extern CFD1FLTOBJ0INV   /* 0xBF8807CC */
  .extern CFD1MASK0        /* 0xBF8807D0 */
  .extern CFD1MASK0CLR     /* 0xBF8807D4 */
  .extern CFD1MASK0SET     /* 0xBF8807D8 */
  .extern CFD1MASK0INV     /* 0xBF8807DC */
  .extern CFD1FLTOBJ1      /* 0xBF8807E0 */
  .extern CFD1FLTOBJ1CLR   /* 0xBF8807E4 */
  .extern CFD1FLTOBJ1SET   /* 0xBF8807E8 */
  .extern CFD1FLTOBJ1INV   /* 0xBF8807EC */
  .extern CFD1MASK1        /* 0xBF8807F0 */
  .extern CFD1MASK1CLR     /* 0xBF8807F4 */
  .extern CFD1MASK1SET     /* 0xBF8807F8 */
  .extern CFD1MASK1INV     /* 0xBF8807FC */
  .extern CFD1FLTOBJ2      /* 0xBF880800 */
  .extern CFD1FLTOBJ2CLR   /* 0xBF880804 */
  .extern CFD1FLTOBJ2SET   /* 0xBF880808 */
  .extern CFD1FLTOBJ2INV   /* 0xBF88080C */
  .extern CFD1MASK2        /* 0xBF880810 */
  .extern CFD1MASK2CLR     /* 0xBF880814 */
  .extern CFD1MASK2SET     /* 0xBF880818 */
  .extern CFD1MASK2INV     /* 0xBF88081C */
  .extern CFD1FLTOBJ3      /* 0xBF880820 */
  .extern CFD1FLTOBJ3CLR   /* 0xBF880824 */
  .extern CFD1FLTOBJ3SET   /* 0xBF880828 */
  .extern CFD1FLTOBJ3INV   /* 0xBF88082C */
  .extern CFD1MASK3        /* 0xBF880830 */
  .extern CFD1MASK3CLR     /* 0xBF880834 */
  .extern CFD1MASK3SET     /* 0xBF880838 */
  .extern CFD1MASK3INV     /* 0xBF88083C */
  .extern CFD1FLTOBJ4      /* 0xBF880840 */
  .extern CFD1FLTOBJ4CLR   /* 0xBF880844 */
  .extern CFD1FLTOBJ4SET   /* 0xBF880848 */
  .extern CFD1FLTOBJ4INV   /* 0xBF88084C */
  .extern CFD1MASK4        /* 0xBF880850 */
  .extern CFD1MASK4CLR     /* 0xBF880854 */
  .extern CFD1MASK4SET     /* 0xBF880858 */
  .extern CFD1MASK4INV     /* 0xBF88085C */
  .extern CFD1FLTOBJ5      /* 0xBF880860 */
  .extern CFD1FLTOBJ5CLR   /* 0xBF880864 */
  .extern CFD1FLTOBJ5SET   /* 0xBF880868 */
  .extern CFD1FLTOBJ5INV   /* 0xBF88086C */
  .extern CFD1MASK5        /* 0xBF880870 */
  .extern CFD1MASK5CLR     /* 0xBF880874 */
  .extern CFD1MASK5SET     /* 0xBF880878 */
  .extern CFD1MASK5INV     /* 0xBF88087C */
  .extern CFD1FLTOBJ6      /* 0xBF880880 */
  .extern CFD1FLTOBJ6CLR   /* 0xBF880884 */
  .extern CFD1FLTOBJ6SET   /* 0xBF880888 */
  .extern CFD1FLTOBJ6INV   /* 0xBF88088C */
  .extern CFD1MASK6        /* 0xBF880890 */
  .extern CFD1MASK6CLR     /* 0xBF880894 */
  .extern CFD1MASK6SET     /* 0xBF880898 */
  .extern CFD1MASK6INV     /* 0xBF88089C */
  .extern CFD1FLTOBJ7      /* 0xBF8808A0 */
  .extern CFD1FLTOBJ7CLR   /* 0xBF8808A4 */
  .extern CFD1FLTOBJ7SET   /* 0xBF8808A8 */
  .extern CFD1FLTOBJ7INV   /* 0xBF8808AC */
  .extern CFD1MASK7        /* 0xBF8808B0 */
  .extern CFD1MASK7CLR     /* 0xBF8808B4 */
  .extern CFD1MASK7SET     /* 0xBF8808B8 */
  .extern CFD1FLTOBJ8      /* 0xBF8808C0 */
  .extern CFD1FLTOBJ8CLR   /* 0xBF8808C4 */
  .extern CFD1FLTOBJ8SET   /* 0xBF8808C8 */
  .extern CFD1FLTOBJ8INV   /* 0xBF8808CC */
  .extern CFD1MASK8        /* 0xBF8808D0 */
  .extern CFD1MASK8CLR     /* 0xBF8808D4 */
  .extern CFD1MASK8SET     /* 0xBF8808D8 */
  .extern CFD1MASK8INV     /* 0xBF8808DC */
  .extern CFD1FLTOBJ9      /* 0xBF8808E0 */
  .extern CFD1FLTOBJ9CLR   /* 0xBF8808E4 */
  .extern CFD1FLTOBJ9SET   /* 0xBF8808E8 */
  .extern CFD1FLTOBJ9INV   /* 0xBF8808EC */
  .extern CFD1MASK9        /* 0xBF8808F0 */
  .extern CFD1MASK9CLR     /* 0xBF8808F4 */
  .extern CFD1MASK9SET     /* 0xBF8808F8 */
  .extern CFD1MASK9INV     /* 0xBF8808FC */
  .extern CFD1FLTOBJ10     /* 0xBF880900 */
  .extern CFD1FLTOBJ10CLR  /* 0xBF880904 */
  .extern CFD1FLTOBJ10SET  /* 0xBF880908 */
  .extern CFD1FLTOBJ10INV  /* 0xBF88090C */
  .extern CFD1MASK10       /* 0xBF880910 */
  .extern CFD1MASK10CLR    /* 0xBF880914 */
  .extern CFD1MASK10SET    /* 0xBF880918 */
  .extern CFD1MASK10INV    /* 0xBF88091C */
  .extern CFD1FLTOBJ11     /* 0xBF880920 */
  .extern CFD1FLTOBJ11CLR  /* 0xBF880924 */
  .extern CFD1FLTOBJ11SET  /* 0xBF880928 */
  .extern CFD1FLTOBJ11INV  /* 0xBF88092C */
  .extern CFD1MASK11       /* 0xBF880930 */
  .extern CFD1MASK11CLR    /* 0xBF880934 */
  .extern CFD1MASK11SET    /* 0xBF880938 */
  .extern CFD1MASK11INV    /* 0xBF88093C */
  .extern CFD1FLTOBJ12     /* 0xBF880940 */
  .extern CFD1FLTOBJ12CLR  /* 0xBF880944 */
  .extern CFD1FLTOBJ12SET  /* 0xBF880948 */
  .extern CFD1FLTOBJ12INV  /* 0xBF88094C */
  .extern CFD1MASK12       /* 0xBF880950 */
  .extern CFD1MASK12CLR    /* 0xBF880954 */
  .extern CFD1MASK12SET    /* 0xBF880958 */
  .extern CFD1MASK12INV    /* 0xBF88095C */
  .extern CFD1FLTOBJ13     /* 0xBF880960 */
  .extern CFD1FLTOBJ13CLR  /* 0xBF880964 */
  .extern CFD1FLTOBJ13SET  /* 0xBF880968 */
  .extern CFD1FLTOBJ13INV  /* 0xBF88096C */
  .extern CFD1MASK13       /* 0xBF880970 */
  .extern CFD1MASK13CLR    /* 0xBF880974 */
  .extern CFD1MASK13SET    /* 0xBF880978 */
  .extern CFD1MASK13INV    /* 0xBF88097C */
  .extern CFD1FLTOBJ14     /* 0xBF880980 */
  .extern CFD1FLTOBJ14CLR  /* 0xBF880984 */
  .extern CFD1FLTOBJ14SET  /* 0xBF880988 */
  .extern CFD1FLTOBJ14INV  /* 0xBF88098C */
  .extern CFD1MASK14       /* 0xBF880990 */
  .extern CFD1MASK14CLR    /* 0xBF880994 */
  .extern CFD1MASK14SET    /* 0xBF880998 */
  .extern CFD1MASK14INV    /* 0xBF88099C */
  .extern CFD1FLTOBJ15     /* 0xBF8809A0 */
  .extern CFD1FLTOBJ15CLR  /* 0xBF8809A4 */
  .extern CFD1FLTOBJ15SET  /* 0xBF8809A8 */
  .extern CFD1FLTOBJ15INV  /* 0xBF8809AC */
  .extern CFD1MASK15       /* 0xBF8809B0 */
  .extern CFD1MASK15CLR    /* 0xBF8809B4 */
  .extern CFD1MASK15SET    /* 0xBF8809B8 */
  .extern CFD1MASK15INV    /* 0xBF8809BC */
  .extern CFD1FLTOBJ16     /* 0xBF8809C0 */
  .extern CFD1FLTOBJ16CLR  /* 0xBF8809C4 */
  .extern CFD1FLTOBJ16SET  /* 0xBF8809C8 */
  .extern CFD1FLTOBJ16INV  /* 0xBF8809CC */
  .extern CFD1MASK16       /* 0xBF8809D0 */
  .extern CFD1MASK16CLR    /* 0xBF8809D4 */
  .extern CFD1MASK16SET    /* 0xBF8809D8 */
  .extern CFD1MASK16INV    /* 0xBF8809DC */
  .extern CFD1FLTOBJ17     /* 0xBF8809E0 */
  .extern CFD1FLTOBJ17CLR  /* 0xBF8809E4 */
  .extern CFD1FLTOBJ17SET  /* 0xBF8809E8 */
  .extern CFD1FLTOBJ17INV  /* 0xBF8809EC */
  .extern CFD1MASK17       /* 0xBF8809F0 */
  .extern CFD1MASK17CLR    /* 0xBF8809F4 */
  .extern CFD1MASK17SET    /* 0xBF8809F8 */
  .extern CFD1MASK17INV    /* 0xBF8809FC */
  .extern CFD1FLTOBJ18     /* 0xBF880A00 */
  .extern CFD1FLTOBJ18CLR  /* 0xBF880A04 */
  .extern CFD1FLTOBJ18SET  /* 0xBF880A08 */
  .extern CFD1FLTOBJ18INV  /* 0xBF880A0C */
  .extern CFD1MASK18       /* 0xBF880A10 */
  .extern CFD1MASK18CLR    /* 0xBF880A14 */
  .extern CFD1MASK18SET    /* 0xBF880A18 */
  .extern CFD1MASK18INV    /* 0xBF880A1C */
  .extern CFD1FLTOBJ19     /* 0xBF880A20 */
  .extern CFD1FLTOBJ19CLR  /* 0xBF880A24 */
  .extern CFD1FLTOBJ19SET  /* 0xBF880A28 */
  .extern CFD1FLTOBJ19INV  /* 0xBF880A2C */
  .extern CFD1MASK19       /* 0xBF880A30 */
  .extern CFD1MASK19CLR    /* 0xBF880A34 */
  .extern CFD1MASK19SET    /* 0xBF880A38 */
  .extern CFD1MASK19INV    /* 0xBF880A3C */
  .extern CFD1FLTOBJ20     /* 0xBF880A40 */
  .extern CFD1FLTOBJ20CLR  /* 0xBF880A44 */
  .extern CFD1FLTOBJ20SET  /* 0xBF880A48 */
  .extern CFD1FLTOBJ20INV  /* 0xBF880A4C */
  .extern CFD1MASK20       /* 0xBF880A50 */
  .extern CFD1MASK20CLR    /* 0xBF880A54 */
  .extern CFD1MASK20SET    /* 0xBF880A58 */
  .extern CFD1MASK20INV    /* 0xBF880A5C */
  .extern CFD1FLTOBJ21     /* 0xBF880A60 */
  .extern CFD1FLTOBJ21CLR  /* 0xBF880A64 */
  .extern CFD1FLTOBJ21SET  /* 0xBF880A68 */
  .extern CFD1FLTOBJ21INV  /* 0xBF880A6C */
  .extern CFD1MASK21       /* 0xBF880A70 */
  .extern CFD1MASK21CLR    /* 0xBF880A74 */
  .extern CFD1MASK21SET    /* 0xBF880A78 */
  .extern CFD1MASK21INV    /* 0xBF880A7C */
  .extern CFD1FLTOBJ22     /* 0xBF880A80 */
  .extern CFD1FLTOBJ22CLR  /* 0xBF880A84 */
  .extern CFD1FLTOBJ22SET  /* 0xBF880A88 */
  .extern CFD1FLTOBJ22INV  /* 0xBF880A8C */
  .extern CFD1MASK22       /* 0xBF880A90 */
  .extern CFD1MASK22CLR    /* 0xBF880A94 */
  .extern CFD1MASK22SET    /* 0xBF880A98 */
  .extern CFD1MASK22INV    /* 0xBF880A9C */
  .extern CFD1FLTOBJ23     /* 0xBF880AA0 */
  .extern CFD1FLTOBJ23CLR  /* 0xBF880AA4 */
  .extern CFD1FLTOBJ23SET  /* 0xBF880AA8 */
  .extern CFD1FLTOBJ23INV  /* 0xBF880AAC */
  .extern CFD1MASK23       /* 0xBF880AB0 */
  .extern CFD1MASK23CLR    /* 0xBF880AB4 */
  .extern CFD1MASK23SET    /* 0xBF880AB8 */
  .extern CFD1MASK23INV    /* 0xBF880ABC */
  .extern CFD1FLTOBJ24     /* 0xBF880AC0 */
  .extern CFD1FLTOBJ24CLR  /* 0xBF880AC4 */
  .extern CFD1FLTOBJ24SET  /* 0xBF880AC8 */
  .extern CFD1FLTOBJ24INV  /* 0xBF880ACC */
  .extern CFD1MASK24       /* 0xBF880AD0 */
  .extern CFD1MASK24CLR    /* 0xBF880AD4 */
  .extern CFD1MASK24SET    /* 0xBF880AD8 */
  .extern CFD1MASK24INV    /* 0xBF880ADC */
  .extern CFD1FLTOBJ25     /* 0xBF880AE0 */
  .extern CFD1FLTOBJ25CLR  /* 0xBF880AE4 */
  .extern CFD1FLTOBJ25SET  /* 0xBF880AE8 */
  .extern CFD1FLTOBJ25INV  /* 0xBF880AEC */
  .extern CFD1MASK25       /* 0xBF880AF0 */
  .extern CFD1MASK25CLR    /* 0xBF880AF4 */
  .extern CFD1MASK25SET    /* 0xBF880AF8 */
  .extern CFD1MASK25INV    /* 0xBF880AFC */
  .extern CFD1FLTOBJ26     /* 0xBF880B00 */
  .extern CFD1FLTOBJ26CLR  /* 0xBF880B04 */
  .extern CFD1FLTOBJ26SET  /* 0xBF880B08 */
  .extern CFD1FLTOBJ26INV  /* 0xBF880B0C */
  .extern CFD1MASK26       /* 0xBF880B10 */
  .extern CFD1MASK26CLR    /* 0xBF880B14 */
  .extern CFD1MASK26SET    /* 0xBF880B18 */
  .extern CFD1MASK26INV    /* 0xBF880B1C */
  .extern CFD1FLTOBJ27     /* 0xBF880B20 */
  .extern CFD1FLTOBJ27CLR  /* 0xBF880B24 */
  .extern CFD1FLTOBJ27SET  /* 0xBF880B28 */
  .extern CFD1FLTOBJ27INV  /* 0xBF880B2C */
  .extern CFD1MASK27       /* 0xBF880B30 */
  .extern CFD1MASK27CLR    /* 0xBF880B34 */
  .extern CFD1MASK27SET    /* 0xBF880B38 */
  .extern CFD1MASK27INV    /* 0xBF880B3C */
  .extern CFD1FLTOBJ28     /* 0xBF880B40 */
  .extern CFD1FLTOBJ28CLR  /* 0xBF880B44 */
  .extern CFD1FLTOBJ28SET  /* 0xBF880B48 */
  .extern CFD1FLTOBJ28INV  /* 0xBF880B4C */
  .extern CFD1MASK28       /* 0xBF880B50 */
  .extern CFD1MASK28CLR    /* 0xBF880B54 */
  .extern CFD1MASK28SET    /* 0xBF880B58 */
  .extern CFD1MASK28INV    /* 0xBF880B5C */
  .extern CFD1FLTOBJ29     /* 0xBF880B60 */
  .extern CFD1FLTOBJ29CLR  /* 0xBF880B64 */
  .extern CFD1FLTOBJ29SET  /* 0xBF880B68 */
  .extern CFD1FLTOBJ29INV  /* 0xBF880B6C */
  .extern CFD1MASK29       /* 0xBF880B70 */
  .extern CFD1MASK29CLR    /* 0xBF880B74 */
  .extern CFD1MASK29SET    /* 0xBF880B78 */
  .extern CFD1MASK29INV    /* 0xBF880B7C */
  .extern CFD1FLTOBJ30     /* 0xBF880B80 */
  .extern CFD1FLTOBJ30CLR  /* 0xBF880B84 */
  .extern CFD1FLTOBJ30SET  /* 0xBF880B88 */
  .extern CFD1FLTOBJ30INV  /* 0xBF880B8C */
  .extern CFD1MASK30       /* 0xBF880B90 */
  .extern CFD1MASK30CLR    /* 0xBF880B94 */
  .extern CFD1MASK30SET    /* 0xBF880B98 */
  .extern CFD1MASK30INV    /* 0xBF880B9C */
  .extern CFD1FLTOBJ31     /* 0xBF880BA0 */
  .extern CFD1FLTOBJ31CLR  /* 0xBF880BA4 */
  .extern CFD1FLTOBJ31SET  /* 0xBF880BA8 */
  .extern CFD1FLTOBJ31INV  /* 0xBF880BAC */
  .extern CFD1MASK31       /* 0xBF880BB0 */
  .extern CFD1MASK31CLR    /* 0xBF880BB4 */
  .extern CFD1MASK31SET    /* 0xBF880BB8 */
  .extern CFD1MASK31INV    /* 0xBF880BBC */
  .extern CFD2CON          /* 0xBF881000 */
  .extern CFD2CONCLR       /* 0xBF881004 */
  .extern CFD2CONSET       /* 0xBF881008 */
  .extern CFD2CONINV       /* 0xBF88100C */
  .extern CFD2NBTCFG       /* 0xBF881010 */
  .extern CFD2NBTCFGCLR    /* 0xBF881014 */
  .extern CFD2NBTCFGSET    /* 0xBF881018 */
  .extern CFD2NBTCFGINV    /* 0xBF88101C */
  .extern CFD2DBTCFG       /* 0xBF881020 */
  .extern CFD2DBTCFGCLR    /* 0xBF881024 */
  .extern CFD2DBTCFGSET    /* 0xBF881028 */
  .extern CFD2DBTCFGINV    /* 0xBF88102C */
  .extern CFD2TDC          /* 0xBF881030 */
  .extern CFD2TDCCLR       /* 0xBF881034 */
  .extern CFD2TDCSET       /* 0xBF881038 */
  .extern CFD2TDCINV       /* 0xBF88103C */
  .extern CFD2TBC          /* 0xBF881040 */
  .extern CFD2TBCCLR       /* 0xBF881044 */
  .extern CFD2TBCSET       /* 0xBF881048 */
  .extern CFD2TBCINV       /* 0xBF88104C */
  .extern CFD2TSCON        /* 0xBF881050 */
  .extern CFD2TSCONCLR     /* 0xBF881054 */
  .extern CFD2TSCONSET     /* 0xBF881058 */
  .extern CFD2TSCONINV     /* 0xBF88105C */
  .extern CFD2VEC          /* 0xBF881060 */
  .extern CFD2VECCLR       /* 0xBF881064 */
  .extern CFD2VECSET       /* 0xBF881068 */
  .extern CFD2VECINV       /* 0xBF88106C */
  .extern CFD2INT          /* 0xBF881070 */
  .extern CFD2INTCLR       /* 0xBF881074 */
  .extern CFD2INTSET       /* 0xBF881078 */
  .extern CFD2INTINV       /* 0xBF88107C */
  .extern CFD2RXIF         /* 0xBF881080 */
  .extern CFD2RXIFCLR      /* 0xBF881084 */
  .extern CFD2RXIFSET      /* 0xBF881088 */
  .extern CFD2RXIFINV      /* 0xBF88108C */
  .extern CFD2TXIF         /* 0xBF881090 */
  .extern CFD2TXIFCLR      /* 0xBF881094 */
  .extern CFD2TXIFSET      /* 0xBF881098 */
  .extern CFD2TXIFINV      /* 0xBF88109C */
  .extern CFD2RXOVIF       /* 0xBF8810A0 */
  .extern CFD2RXOVIFCLR    /* 0xBF8810A4 */
  .extern CFD2RXOVIFSET    /* 0xBF8810A8 */
  .extern CFD2RXOVIFINV    /* 0xBF8810AC */
  .extern CFD2TXATIF       /* 0xBF8810B0 */
  .extern CFD2TXATIFCLR    /* 0xBF8810B4 */
  .extern CFD2TXATIFSET    /* 0xBF8810B8 */
  .extern CFD2TXATIFINV    /* 0xBF8810BC */
  .extern CFD2TXREQ        /* 0xBF8810C0 */
  .extern CFD2TXREQCLR     /* 0xBF8810C4 */
  .extern CFD2TXREQSET     /* 0xBF8810C8 */
  .extern CFD2TXREQINV     /* 0xBF8810CC */
  .extern CFD2TREC         /* 0xBF8810D0 */
  .extern CFD2TRECCLR      /* 0xBF8810D4 */
  .extern CFD2TRECSET      /* 0xBF8810D8 */
  .extern CFD2TRECINV      /* 0xBF8810DC */
  .extern CFD2BDIAG0       /* 0xBF8810E0 */
  .extern CFD2BDIAG0CLR    /* 0xBF8810E4 */
  .extern CFD2BDIAG0SET    /* 0xBF8810E8 */
  .extern CFD2BDIAG0INV    /* 0xBF8810EC */
  .extern CFD2BDIAG1       /* 0xBF8810F0 */
  .extern CFD2BDIAG1CLR    /* 0xBF8810F4 */
  .extern CFD2BDIAG1SET    /* 0xBF8810F8 */
  .extern CFD2BDIAG1INV    /* 0xBF8810FC */
  .extern CFD2TEFCON       /* 0xBF881100 */
  .extern CFD2TEFCONCLR    /* 0xBF881104 */
  .extern CFD2TEFCONSET    /* 0xBF881108 */
  .extern CFD2TEFCONINV    /* 0xBF88110C */
  .extern CFD2TEFSTA       /* 0xBF881110 */
  .extern CFD2TEFSTACLR    /* 0xBF881114 */
  .extern CFD2TEFSTASET    /* 0xBF881118 */
  .extern CFD2TEFSTAINV    /* 0xBF88111C */
  .extern CFD2TEFUA        /* 0xBF881120 */
  .extern CFD2TEFUACLR     /* 0xBF881124 */
  .extern CFD2TEFUASET     /* 0xBF881128 */
  .extern CFD2TEFUAINV     /* 0xBF88112C */
  .extern CFD2FIFOBA       /* 0xBF881130 */
  .extern CFD2FIFOBACLR    /* 0xBF881134 */
  .extern CFD2FIFOBASET    /* 0xBF881138 */
  .extern CFD2FIFOBAINV    /* 0xBF88113C */
  .extern CFD2TXQCON       /* 0xBF881140 */
  .extern CFD2TXQCONCLR    /* 0xBF881144 */
  .extern CFD2TXQCONSET    /* 0xBF881148 */
  .extern CFD2TXQCONINV    /* 0xBF88114C */
  .extern CFD2TXQSTA       /* 0xBF881150 */
  .extern CFD2TXQSTACLR    /* 0xBF881154 */
  .extern CFD2TXQSTASET    /* 0xBF881158 */
  .extern CFD2TXQSTAINV    /* 0xBF88115C */
  .extern CFD2TXQUA        /* 0xBF881160 */
  .extern CFD2TXQUACLR     /* 0xBF881164 */
  .extern CFD2TXQUASET     /* 0xBF881168 */
  .extern CFD2TXQUAINV     /* 0xBF88116C */
  .extern CFD2FIFOCON1     /* 0xBF881170 */
  .extern CFD2FIFOCON1CLR  /* 0xBF881174 */
  .extern CFD2FIFOCON1SET  /* 0xBF881178 */
  .extern CFD2FIFOCON1INV  /* 0xBF88117C */
  .extern CFD2FIFOSTA1     /* 0xBF881180 */
  .extern CFD2FIFOSTA1CLR  /* 0xBF881184 */
  .extern CFD2FIFOSTA1SET  /* 0xBF881188 */
  .extern CFD2FIFOSTA1INV  /* 0xBF88118C */
  .extern CFD2FIFOUA1      /* 0xBF881190 */
  .extern CFD2FIFOUA1CLR   /* 0xBF881194 */
  .extern CFD2FIFOUA1SET   /* 0xBF881198 */
  .extern CFD2FIFOUA1INV   /* 0xBF88119C */
  .extern CFD2FIFOCON2     /* 0xBF8811A0 */
  .extern CFD2FIFOCON2CLR  /* 0xBF8811A4 */
  .extern CFD2FIFOCON2SET  /* 0xBF8811A8 */
  .extern CFD2FIFOCON2INV  /* 0xBF8811AC */
  .extern CFD2FIFOSTA2     /* 0xBF8811B0 */
  .extern CFD2FIFOSTA2CLR  /* 0xBF8811B4 */
  .extern CFD2FIFOSTA2SET  /* 0xBF8811B8 */
  .extern CFD2FIFOSTA2INV  /* 0xBF8811BC */
  .extern CFD2FIFOUA2      /* 0xBF8811C0 */
  .extern CFD2FIFOUA2CLR   /* 0xBF8811C4 */
  .extern CFD2FIFOUA2SET   /* 0xBF8811C8 */
  .extern CFD2FIFOUA2INV   /* 0xBF8811CC */
  .extern CFD2FIFOCON3     /* 0xBF8811D0 */
  .extern CFD2FIFOCON3CLR  /* 0xBF8811D4 */
  .extern CFD2FIFOCON3SET  /* 0xBF8811D8 */
  .extern CFD2FIFOCON3INV  /* 0xBF8811DC */
  .extern CFD2FIFOSTA3     /* 0xBF8811E0 */
  .extern CFD2FIFOSTA3CLR  /* 0xBF8811E4 */
  .extern CFD2FIFOSTA3SET  /* 0xBF8811E8 */
  .extern CFD2FIFOSTA3INV  /* 0xBF8811EC */
  .extern CFD2FIFOUA3      /* 0xBF8811F0 */
  .extern CFD2FIFOUA3CLR   /* 0xBF8811F4 */
  .extern CFD2FIFOUA3SET   /* 0xBF8811F8 */
  .extern CFD2FIFOUA3INV   /* 0xBF8811FC */
  .extern CFD2FIFOCON4     /* 0xBF881200 */
  .extern CFD2FIFOCON4CLR  /* 0xBF881204 */
  .extern CFD2FIFOCON4SET  /* 0xBF881208 */
  .extern CFD2FIFOCON4INV  /* 0xBF88120C */
  .extern CFD2FIFOSTA4     /* 0xBF881210 */
  .extern CFD2FIFOSTA4CLR  /* 0xBF881214 */
  .extern CFD2FIFOSTA4SET  /* 0xBF881218 */
  .extern CFD2FIFOSTA4INV  /* 0xBF88121C */
  .extern CFD2FIFOUA4      /* 0xBF881220 */
  .extern CFD2FIFOUA4CLR   /* 0xBF881224 */
  .extern CFD2FIFOUA4SET   /* 0xBF881228 */
  .extern CFD2FIFOUA4INV   /* 0xBF88122C */
  .extern CFD2FIFOCON5     /* 0xBF881230 */
  .extern CFD2FIFOCON5CLR  /* 0xBF881234 */
  .extern CFD2FIFOCON5SET  /* 0xBF881238 */
  .extern CFD2FIFOCON5INV  /* 0xBF88123C */
  .extern CFD2FIFOSTA5     /* 0xBF881240 */
  .extern CFD2FIFOSTA5CLR  /* 0xBF881244 */
  .extern CFD2FIFOSTA5SET  /* 0xBF881248 */
  .extern CFD2FIFOSTA5INV  /* 0xBF88124C */
  .extern CFD2FIFOUA5      /* 0xBF881250 */
  .extern CFD2FIFOUA5CLR   /* 0xBF881254 */
  .extern CFD2FIFOUA5SET   /* 0xBF881258 */
  .extern CFD2FIFOUA5INV   /* 0xBF88125C */
  .extern CFD2FIFOCON6     /* 0xBF881260 */
  .extern CFD2FIFOCON6CLR  /* 0xBF881264 */
  .extern CFD2FIFOCON6SET  /* 0xBF881268 */
  .extern CFD2FIFOCON6INV  /* 0xBF88126C */
  .extern CFD2FIFOSTA6     /* 0xBF881270 */
  .extern CFD2FIFOSTA6CLR  /* 0xBF881274 */
  .extern CFD2FIFOSTA6SET  /* 0xBF881278 */
  .extern CFD2FIFOSTA6INV  /* 0xBF88127C */
  .extern CFD2FIFOUA6      /* 0xBF881280 */
