Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern CFD2FIFOUA6CLR   /* 0xBF881284 */
  .extern CFD2FIFOUA6SET   /* 0xBF881288 */
  .extern CFD2FIFOUA6INV   /* 0xBF88128C */
  .extern CFD2FIFOCON7     /* 0xBF881290 */
  .extern CFD2FIFOCON7CLR  /* 0xBF881294 */
  .extern CFD2FIFOCON7SET  /* 0xBF881298 */
  .extern CFD2FIFOCON7INV  /* 0xBF88129C */
  .extern CFD2FIFOSTA7     /* 0xBF8812A0 */
  .extern CFD2FIFOSTA7CLR  /* 0xBF8812A4 */
  .extern CFD2FIFOSTA7SET  /* 0xBF8812A8 */
  .extern CFD2FIFOSTA7INV  /* 0xBF8812AC */
  .extern CFD2FIFOUA7      /* 0xBF8812B0 */
  .extern CFD2FIFOUA7CLR   /* 0xBF8812B4 */
  .extern CFD2FIFOUA7SET   /* 0xBF8812B8 */
  .extern CFD2FIFOUA7INV   /* 0xBF8812BC */
  .extern CFD2FIFOCON8     /* 0xBF8812C0 */
  .extern CFD2FIFOCON8CLR  /* 0xBF8812C4 */
  .extern CFD2FIFOCON8SET  /* 0xBF8812C8 */
  .extern CFD2FIFOCON8INV  /* 0xBF8812CC */
  .extern CFD2FIFOSTA8     /* 0xBF8812D0 */
  .extern CFD2FIFOSTA8CLR  /* 0xBF8812D4 */
  .extern CFD2FIFOSTA8SET  /* 0xBF8812D8 */
  .extern CFD2FIFOSTA8INV  /* 0xBF8812DC */
  .extern CFD2FIFOUA8      /* 0xBF8812E0 */
  .extern CFD2FIFOUA8CLR   /* 0xBF8812E4 */
  .extern CFD2FIFOUA8SET   /* 0xBF8812E8 */
  .extern CFD2FIFOUA8INV   /* 0xBF8812EC */
  .extern CFD2FIFOCON9     /* 0xBF8812F0 */
  .extern CFD2FIFOCON9CLR  /* 0xBF8812F4 */
  .extern CFD2FIFOCON9SET  /* 0xBF8812F8 */
  .extern CFD2FIFOCON9INV  /* 0xBF8812FC */
  .extern CFD2FIFOSTA9     /* 0xBF881300 */
  .extern CFD2FIFOSTA9CLR  /* 0xBF881304 */
  .extern CFD2FIFOSTA9SET  /* 0xBF881308 */
  .extern CFD2FIFOSTA9INV  /* 0xBF88130C */
  .extern CFD2FIFOUA9      /* 0xBF881310 */
  .extern CFD2FIFOUA9CLR   /* 0xBF881314 */
  .extern CFD2FIFOUA9SET   /* 0xBF881318 */
  .extern CFD2FIFOUA9INV   /* 0xBF88131C */
  .extern CFD2FIFOCON10    /* 0xBF881320 */
  .extern CFD2FIFOCON10CLR /* 0xBF881324 */
  .extern CFD2FIFOCON10SET /* 0xBF881328 */
  .extern CFD2FIFOCON10INV /* 0xBF88132C */
  .extern CFD2FIFOSTA10    /* 0xBF881330 */
  .extern CFD2FIFOSTA10CLR /* 0xBF881334 */
  .extern CFD2FIFOSTA10SET /* 0xBF881338 */
  .extern CFD2FIFOSTA10INV /* 0xBF88133C */
  .extern CFD2FIFOUA10     /* 0xBF881340 */
  .extern CFD2FIFOUA10CLR  /* 0xBF881344 */
  .extern CFD2FIFOUA10SET  /* 0xBF881348 */
  .extern CFD2FIFOUA10INV  /* 0xBF88134C */
  .extern CFD2FIFOCON11    /* 0xBF881350 */
  .extern CFD2FIFOCON11CLR /* 0xBF881354 */
  .extern CFD2FIFOCON11SET /* 0xBF881358 */
  .extern CFD2FIFOCON11INV /* 0xBF88135C */
  .extern CFD2FIFOSTA11    /* 0xBF881360 */
  .extern CFD2FIFOSTA11CLR /* 0xBF881364 */
  .extern CFD2FIFOSTA11SET /* 0xBF881368 */
  .extern CFD2FIFOSTA11INV /* 0xBF88136C */
  .extern CFD2FIFOUA11     /* 0xBF881370 */
  .extern CFD2FIFOUA11CLR  /* 0xBF881374 */
  .extern CFD2FIFOUA11SET  /* 0xBF881378 */
  .extern CFD2FIFOUA11INV  /* 0xBF88137C */
  .extern CFD2FIFOCON12    /* 0xBF881380 */
  .extern CFD2FIFOCON12CLR /* 0xBF881384 */
  .extern CFD2FIFOCON12SET /* 0xBF881388 */
  .extern CFD2FIFOCON12INV /* 0xBF88138C */
  .extern CFD2FIFOSTA12    /* 0xBF881390 */
  .extern CFD2FIFOSTA12CLR /* 0xBF881394 */
  .extern CFD2FIFOSTA12SET /* 0xBF881398 */
  .extern CFD2FIFOSTA12INV /* 0xBF88139C */
  .extern CFD2FIFOUA12     /* 0xBF8813A0 */
  .extern CFD2FIFOUA12CLR  /* 0xBF8813A4 */
  .extern CFD2FIFOUA12SET  /* 0xBF8813A8 */
  .extern CFD2FIFOUA12INV  /* 0xBF8813AC */
  .extern CFD2FIFOCON13    /* 0xBF8813B0 */
  .extern CFD2FIFOCON13CLR /* 0xBF8813B4 */
  .extern CFD2FIFOCON13SET /* 0xBF8813B8 */
  .extern CFD2FIFOCON13INV /* 0xBF8813BC */
  .extern CFD2FIFOSTA13    /* 0xBF8813C0 */
  .extern CFD2FIFOSTA13CLR /* 0xBF8813C4 */
  .extern CFD2FIFOSTA13SET /* 0xBF8813C8 */
  .extern CFD2FIFOSTA13INV /* 0xBF8813CC */
  .extern CFD2FIFOUA13     /* 0xBF8813D0 */
  .extern CFD2FIFOUA13CLR  /* 0xBF8813D4 */
  .extern CFD2FIFOUA13SET  /* 0xBF8813D8 */
  .extern CFD2FIFOUA13INV  /* 0xBF8813DC */
  .extern CFD2FIFOCON14    /* 0xBF8813E0 */
  .extern CFD2FIFOCON14CLR /* 0xBF8813E4 */
  .extern CFD2FIFOCON14SET /* 0xBF8813E8 */
  .extern CFD2FIFOCON14INV /* 0xBF8813EC */
  .extern CFD2FIFOSTA14    /* 0xBF8813F0 */
  .extern CFD2FIFOSTA14CLR /* 0xBF8813F4 */
  .extern CFD2FIFOSTA14SET /* 0xBF8813F8 */
  .extern CFD2FIFOSTA14INV /* 0xBF8813FC */
  .extern CFD2FIFOUA14     /* 0xBF881400 */
  .extern CFD2FIFOUA14CLR  /* 0xBF881404 */
  .extern CFD2FIFOUA14SET  /* 0xBF881408 */
  .extern CFD2FIFOUA14INV  /* 0xBF88140C */
  .extern CFD2FIFOCON15    /* 0xBF881410 */
  .extern CFD2FIFOCON15CLR /* 0xBF881414 */
  .extern CFD2FIFOCON15SET /* 0xBF881418 */
  .extern CFD2FIFOCON15INV /* 0xBF88141C */
  .extern CFD2FIFOSTA15    /* 0xBF881420 */
  .extern CFD2FIFOSTA15CLR /* 0xBF881424 */
  .extern CFD2FIFOSTA15SET /* 0xBF881428 */
  .extern CFD2FIFOSTA15INV /* 0xBF88142C */
  .extern CFD2FIFOUA15     /* 0xBF881430 */
  .extern CFD2FIFOUA15CLR  /* 0xBF881434 */
  .extern CFD2FIFOUA15SET  /* 0xBF881438 */
  .extern CFD2FIFOUA15INV  /* 0xBF88143C */
  .extern CFD2FIFOCON16    /* 0xBF881440 */
  .extern CFD2FIFOCON16CLR /* 0xBF881444 */
  .extern CFD2FIFOCON16SET /* 0xBF881448 */
  .extern CFD2FIFOCON16INV /* 0xBF88144C */
  .extern CFD2FIFOSTA16    /* 0xBF881450 */
  .extern CFD2FIFOSTA16CLR /* 0xBF881454 */
  .extern CFD2FIFOSTA16SET /* 0xBF881458 */
  .extern CFD2FIFOSTA16INV /* 0xBF88145C */
  .extern CFD2FIFOUA16     /* 0xBF881460 */
  .extern CFD2FIFOUA16CLR  /* 0xBF881464 */
  .extern CFD2FIFOUA16SET  /* 0xBF881468 */
  .extern CFD2FIFOUA16INV  /* 0xBF88146C */
  .extern CFD2FIFOCON17    /* 0xBF881470 */
  .extern CFD2FIFOCON17CLR /* 0xBF881474 */
  .extern CFD2FIFOCON17SET /* 0xBF881478 */
  .extern CFD2FIFOCON17INV /* 0xBF88147C */
  .extern CFD2FIFOSTA17    /* 0xBF881480 */
  .extern CFD2FIFOSTA17CLR /* 0xBF881484 */
  .extern CFD2FIFOSTA17SET /* 0xBF881488 */
  .extern CFD2FIFOSTA17INV /* 0xBF88148C */
  .extern CFD2FIFOUA17     /* 0xBF881490 */
  .extern CFD2FIFOUA17CLR  /* 0xBF881494 */
  .extern CFD2FIFOUA17SET  /* 0xBF881498 */
  .extern CFD2FIFOUA17INV  /* 0xBF88149C */
  .extern CFD2FIFOCON18    /* 0xBF8814A0 */
  .extern CFD2FIFOCON18CLR /* 0xBF8814A4 */
  .extern CFD2FIFOCON18SET /* 0xBF8814A8 */
  .extern CFD2FIFOCON18INV /* 0xBF8814AC */
  .extern CFD2FIFOSTA18    /* 0xBF8814B0 */
  .extern CFD2FIFOSTA18CLR /* 0xBF8814B4 */
  .extern CFD2FIFOSTA18SET /* 0xBF8814B8 */
  .extern CFD2FIFOSTA18INV /* 0xBF8814BC */
  .extern CFD2FIFOUA18     /* 0xBF8814C0 */
  .extern CFD2FIFOUA18CLR  /* 0xBF8814C4 */
  .extern CFD2FIFOUA18SET  /* 0xBF8814C8 */
  .extern CFD2FIFOUA18INV  /* 0xBF8814CC */
  .extern CFD2FIFOCON19    /* 0xBF8814D0 */
  .extern CFD2FIFOCON19CLR /* 0xBF8814D4 */
  .extern CFD2FIFOCON19SET /* 0xBF8814D8 */
  .extern CFD2FIFOCON19INV /* 0xBF8814DC */
  .extern CFD2FIFOSTA19    /* 0xBF8814E0 */
  .extern CFD2FIFOSTA19CLR /* 0xBF8814E4 */
  .extern CFD2FIFOSTA19SET /* 0xBF8814E8 */
  .extern CFD2FIFOSTA19INV /* 0xBF8814EC */
  .extern CFD2FIFOUA19     /* 0xBF8814F0 */
  .extern CFD2FIFOUA19CLR  /* 0xBF8814F4 */
  .extern CFD2FIFOUA19SET  /* 0xBF8814F8 */
  .extern CFD2FIFOUA19INV  /* 0xBF8814FC */
  .extern CFD2FIFOCON20    /* 0xBF881500 */
  .extern CFD2FIFOCON20CLR /* 0xBF881504 */
  .extern CFD2FIFOCON20SET /* 0xBF881508 */
  .extern CFD2FIFOCON20INV /* 0xBF88150C */
  .extern CFD2FIFOSTA20    /* 0xBF881510 */
  .extern CFD2FIFOSTA20CLR /* 0xBF881514 */
  .extern CFD2FIFOSTA20SET /* 0xBF881518 */
  .extern CFD2FIFOSTA20INV /* 0xBF88151C */
  .extern CFD2FIFOUA20     /* 0xBF881520 */
  .extern CFD2FIFOUA20CLR  /* 0xBF881524 */
  .extern CFD2FIFOUA20SET  /* 0xBF881528 */
  .extern CFD2FIFOUA20INV  /* 0xBF88152C */
  .extern CFD2FIFOCON21    /* 0xBF881530 */
  .extern CFD2FIFOCON21CLR /* 0xBF881534 */
  .extern CFD2FIFOCON21SET /* 0xBF881538 */
  .extern CFD2FIFOCON21INV /* 0xBF88153C */
  .extern CFD2FIFOSTA21    /* 0xBF881540 */
  .extern CFD2FIFOSTA21CLR /* 0xBF881544 */
  .extern CFD2FIFOSTA21SET /* 0xBF881548 */
  .extern CFD2FIFOSTA21INV /* 0xBF88154C */
  .extern CFD2FIFOUA21     /* 0xBF881550 */
  .extern CFD2FIFOUA21CLR  /* 0xBF881554 */
  .extern CFD2FIFOUA21SET  /* 0xBF881558 */
  .extern CFD2FIFOUA21INV  /* 0xBF88155C */
  .extern CFD2FIFOCON22    /* 0xBF881560 */
  .extern CFD2FIFOCON22CLR /* 0xBF881564 */
  .extern CFD2FIFOCON22SET /* 0xBF881568 */
  .extern CFD2FIFOCON22INV /* 0xBF88156C */
  .extern CFD2FIFOSTA22    /* 0xBF881570 */
  .extern CFD2FIFOSTA22CLR /* 0xBF881574 */
  .extern CFD2FIFOSTA22SET /* 0xBF881578 */
  .extern CFD2FIFOSTA22INV /* 0xBF88157C */
  .extern CFD2FIFOUA22     /* 0xBF881580 */
  .extern CFD2FIFOUA22CLR  /* 0xBF881584 */
  .extern CFD2FIFOUA22SET  /* 0xBF881588 */
  .extern CFD2FIFOUA22INV  /* 0xBF88158C */
  .extern CFD2FIFOCON23    /* 0xBF881590 */
  .extern CFD2FIFOCON23CLR /* 0xBF881594 */
  .extern CFD2FIFOCON23SET /* 0xBF881598 */
  .extern CFD2FIFOCON23INV /* 0xBF88159C */
  .extern CFD2FIFOSTA23    /* 0xBF8815A0 */
  .extern CFD2FIFOSTA23CLR /* 0xBF8815A4 */
  .extern CFD2FIFOSTA23SET /* 0xBF8815A8 */
  .extern CFD2FIFOSTA23INV /* 0xBF8815AC */
  .extern CFD2FIFOUA23     /* 0xBF8815B0 */
  .extern CFD2FIFOUA23CLR  /* 0xBF8815B4 */
  .extern CFD2FIFOUA23SET  /* 0xBF8815B8 */
  .extern CFD2FIFOUA23INV  /* 0xBF8815BC */
  .extern CFD2FIFOCON24    /* 0xBF8815C0 */
  .extern CFD2FIFOCON24CLR /* 0xBF8815C4 */
  .extern CFD2FIFOCON24SET /* 0xBF8815C8 */
  .extern CFD2FIFOCON24INV /* 0xBF8815CC */
  .extern CFD2FIFOSTA24    /* 0xBF8815D0 */
  .extern CFD2FIFOSTA24CLR /* 0xBF8815D4 */
  .extern CFD2FIFOSTA24SET /* 0xBF8815D8 */
  .extern CFD2FIFOSTA24INV /* 0xBF8815DC */
  .extern CFD2FIFOUA24     /* 0xBF8815E0 */
  .extern CFD2FIFOUA24CLR  /* 0xBF8815E4 */
  .extern CFD2FIFOUA24SET  /* 0xBF8815E8 */
  .extern CFD2FIFOUA24INV  /* 0xBF8815EC */
  .extern CFD2FIFOCON25    /* 0xBF8815F0 */
  .extern CFD2FIFOCON25CLR /* 0xBF8815F4 */
  .extern CFD2FIFOCON25SET /* 0xBF8815F8 */
  .extern CFD2FIFOCON25INV /* 0xBF8815FC */
  .extern CFD2FIFOSTA25    /* 0xBF881600 */
  .extern CFD2FIFOSTA25CLR /* 0xBF881604 */
  .extern CFD2FIFOSTA25SET /* 0xBF881608 */
  .extern CFD2FIFOSTA25INV /* 0xBF88160C */
  .extern CFD2FIFOUA25     /* 0xBF881610 */
  .extern CFD2FIFOUA25CLR  /* 0xBF881614 */
  .extern CFD2FIFOUA25SET  /* 0xBF881618 */
  .extern CFD2FIFOUA25INV  /* 0xBF88161C */
  .extern CFD2FIFOCON26    /* 0xBF881620 */
  .extern CFD2FIFOCON26CLR /* 0xBF881624 */
  .extern CFD2FIFOCON26SET /* 0xBF881628 */
  .extern CFD2FIFOCON26INV /* 0xBF88162C */
  .extern CFD2FIFOSTA26    /* 0xBF881630 */
  .extern CFD2FIFOSTA26CLR /* 0xBF881634 */
  .extern CFD2FIFOSTA26SET /* 0xBF881638 */
  .extern CFD2FIFOSTA26INV /* 0xBF88163C */
  .extern CFD2FIFOUA26     /* 0xBF881640 */
  .extern CFD2FIFOUA26CLR  /* 0xBF881644 */
  .extern CFD2FIFOUA26SET  /* 0xBF881648 */
  .extern CFD2FIFOUA26INV  /* 0xBF88164C */
  .extern CFD2FIFOCON27    /* 0xBF881650 */
  .extern CFD2FIFOCON27CLR /* 0xBF881654 */
  .extern CFD2FIFOCON27SET /* 0xBF881658 */
  .extern CFD2FIFOCON27INV /* 0xBF88165C */
  .extern CFD2FIFOSTA27    /* 0xBF881660 */
  .extern CFD2FIFOSTA27CLR /* 0xBF881664 */
  .extern CFD2FIFOSTA27SET /* 0xBF881668 */
  .extern CFD2FIFOSTA27INV /* 0xBF88166C */
  .extern CFD2FIFOUA27     /* 0xBF881670 */
  .extern CFD2FIFOUA27CLR  /* 0xBF881674 */
  .extern CFD2FIFOUA27SET  /* 0xBF881678 */
  .extern CFD2FIFOUA27INV  /* 0xBF88167C */
  .extern CFD2FIFOCON28    /* 0xBF881680 */
  .extern CFD2FIFOCON28CLR /* 0xBF881684 */
  .extern CFD2FIFOCON28SET /* 0xBF881688 */
  .extern CFD2FIFOCON28INV /* 0xBF88168C */
  .extern CFD2FIFOSTA28    /* 0xBF881690 */
  .extern CFD2FIFOSTA28CLR /* 0xBF881694 */
  .extern CFD2FIFOSTA28SET /* 0xBF881698 */
  .extern CFD2FIFOSTA28INV /* 0xBF88169C */
  .extern CFD2FIFOUA28     /* 0xBF8816A0 */
  .extern CFD2FIFOUA28CLR  /* 0xBF8816A4 */
  .extern CFD2FIFOUA28SET  /* 0xBF8816A8 */
  .extern CFD2FIFOUA28INV  /* 0xBF8816AC */
  .extern CFD2FIFOCON29    /* 0xBF8816B0 */
  .extern CFD2FIFOCON29CLR /* 0xBF8816B4 */
  .extern CFD2FIFOCON29SET /* 0xBF8816B8 */
  .extern CFD2FIFOCON29INV /* 0xBF8816BC */
  .extern CFD2FIFOSTA29    /* 0xBF8816C0 */
  .extern CFD2FIFOSTA29CLR /* 0xBF8816C4 */
  .extern CFD2FIFOSTA29SET /* 0xBF8816C8 */
  .extern CFD2FIFOSTA29INV /* 0xBF8816CC */
  .extern CFD2FIFOUA29     /* 0xBF8816D0 */
  .extern CFD2FIFOUA29CLR  /* 0xBF8816D4 */
  .extern CFD2FIFOUA29SET  /* 0xBF8816D8 */
  .extern CFD2FIFOUA29INV  /* 0xBF8816DC */
  .extern CFD2FIFOCON30    /* 0xBF8816E0 */
  .extern CFD2FIFOCON30CLR /* 0xBF8816E4 */
  .extern CFD2FIFOCON30SET /* 0xBF8816E8 */
  .extern CFD2FIFOCON30INV /* 0xBF8816EC */
  .extern CFD2FIFOSTA30    /* 0xBF8816F0 */
  .extern CFD2FIFOSTA30CLR /* 0xBF8816F4 */
  .extern CFD2FIFOSTA30SET /* 0xBF8816F8 */
  .extern CFD2FIFOSTA30INV /* 0xBF8816FC */
  .extern CFD2FIFOUA30     /* 0xBF881700 */
  .extern CFD2FIFOUA30CLR  /* 0xBF881704 */
  .extern CFD2FIFOUA30SET  /* 0xBF881708 */
  .extern CFD2FIFOUA30INV  /* 0xBF88170C */
  .extern CFD2FIFOCON31    /* 0xBF881710 */
  .extern CFD2FIFOCON31CLR /* 0xBF881714 */
  .extern CFD2FIFOCON31SET /* 0xBF881718 */
  .extern CFD2FIFOCON31INV /* 0xBF88171C */
  .extern CFD2FIFOSTA31    /* 0xBF881720 */
  .extern CFD2FIFOSTA31CLR /* 0xBF881724 */
  .extern CFD2FIFOSTA31SET /* 0xBF881728 */
  .extern CFD2FIFOSTA31INV /* 0xBF88172C */
  .extern CFD2FIFOUA31     /* 0xBF881730 */
  .extern CFD2FIFOUA31CLR  /* 0xBF881734 */
  .extern CFD2FIFOUA31SET  /* 0xBF881738 */
  .extern CFD2FIFOUA31INV  /* 0xBF88173C */
  .extern CFD2FLTCON0      /* 0xBF881740 */
  .extern CFD2FLTCON0CLR   /* 0xBF881744 */
  .extern CFD2FLTCON0SET   /* 0xBF881748 */
  .extern CFD2FLTCON0INV   /* 0xBF88174C */
  .extern CFD2FLTCON1      /* 0xBF881750 */
  .extern CFD2FLTCON1CLR   /* 0xBF881754 */
  .extern CFD2FLTCON1SET   /* 0xBF881758 */
  .extern CFD2FLTCON1INV   /* 0xBF88175C */
  .extern CFD2FLTCON2      /* 0xBF881760 */
  .extern CFD2FLTCON2CLR   /* 0xBF881764 */
  .extern CFD2FLTCON2SET   /* 0xBF881768 */
  .extern CFD2FLTCON2INV   /* 0xBF88176C */
  .extern CFD2FLTCON3      /* 0xBF881770 */
  .extern CFD2FLTCON3CLR   /* 0xBF881774 */
  .extern CFD2FLTCON3SET   /* 0xBF881778 */
  .extern CFD2FLTCON3INV   /* 0xBF88177C */
  .extern CFD2FLTCON4      /* 0xBF881780 */
  .extern CFD2FLTCON4CLR   /* 0xBF881784 */
  .extern CFD2FLTCON4SET   /* 0xBF881788 */
  .extern CFD2FLTCON4INV   /* 0xBF88178C */
  .extern CFD2FLTCON5      /* 0xBF881790 */
  .extern CFD2FLTCON5CLR   /* 0xBF881794 */
  .extern CFD2FLTCON5SET   /* 0xBF881798 */
  .extern CFD2FLTCON5INV   /* 0xBF88179C */
  .extern CFD2FLTCON6      /* 0xBF8817A0 */
  .extern CFD2FLTCON6CLR   /* 0xBF8817A4 */
  .extern CFD2FLTCON6SET   /* 0xBF8817A8 */
  .extern CFD2FLTCON6INV   /* 0xBF8817AC */
  .extern CFD2FLTCON7      /* 0xBF8817B0 */
  .extern CFD2FLTCON7CLR   /* 0xBF8817B4 */
  .extern CFD2FLTCON7SET   /* 0xBF8817B8 */
  .extern CFD2FLTCON7INV   /* 0xBF8817BC */
  .extern CFD2FLTOBJ0      /* 0xBF8817C0 */
  .extern CFD2FLTOBJ0CLR   /* 0xBF8817C4 */
  .extern CFD2FLTOBJ0SET   /* 0xBF8817C8 */
  .extern CFD2FLTOBJ0INV   /* 0xBF8817CC */
  .extern CFD2MASK0        /* 0xBF8817D0 */
  .extern CFD2MASK0CLR     /* 0xBF8817D4 */
  .extern CFD2MASK0SET     /* 0xBF8817D8 */
  .extern CFD2MASK0INV     /* 0xBF8817DC */
  .extern CFD2FLTOBJ1      /* 0xBF8817E0 */
  .extern CFD2FLTOBJ1CLR   /* 0xBF8817E4 */
  .extern CFD2FLTOBJ1SET   /* 0xBF8817E8 */
  .extern CFD2FLTOBJ1INV   /* 0xBF8817EC */
  .extern CFD2MASK1        /* 0xBF8817F0 */
  .extern CFD2MASK1CLR     /* 0xBF8817F4 */
  .extern CFD2MASK1SET     /* 0xBF8817F8 */
  .extern CFD2MASK1INV     /* 0xBF8817FC */
  .extern CFD2FLTOBJ2      /* 0xBF881800 */
  .extern CFD2FLTOBJ2CLR   /* 0xBF881804 */
  .extern CFD2FLTOBJ2SET   /* 0xBF881808 */
  .extern CFD2FLTOBJ2INV   /* 0xBF88180C */
  .extern CFD2MASK2        /* 0xBF881810 */
  .extern CFD2MASK2CLR     /* 0xBF881814 */
  .extern CFD2MASK2SET     /* 0xBF881818 */
  .extern CFD2MASK2INV     /* 0xBF88181C */
  .extern CFD2FLTOBJ3      /* 0xBF881820 */
  .extern CFD2FLTOBJ3CLR   /* 0xBF881824 */
  .extern CFD2FLTOBJ3SET   /* 0xBF881828 */
  .extern CFD2FLTOBJ3INV   /* 0xBF88182C */
  .extern CFD2MASK3        /* 0xBF881830 */
  .extern CFD2MASK3CLR     /* 0xBF881834 */
  .extern CFD2MASK3SET     /* 0xBF881838 */
  .extern CFD2MASK3INV     /* 0xBF88183C */
  .extern CFD2FLTOBJ4      /* 0xBF881840 */
  .extern CFD2FLTOBJ4CLR   /* 0xBF881844 */
  .extern CFD2FLTOBJ4SET   /* 0xBF881848 */
  .extern CFD2FLTOBJ4INV   /* 0xBF88184C */
  .extern CFD2MASK4        /* 0xBF881850 */
  .extern CFD2MASK4CLR     /* 0xBF881854 */
  .extern CFD2MASK4SET     /* 0xBF881858 */
  .extern CFD2MASK4INV     /* 0xBF88185C */
  .extern CFD2FLTOBJ5      /* 0xBF881860 */
  .extern CFD2FLTOBJ5CLR   /* 0xBF881864 */
  .extern CFD2FLTOBJ5SET   /* 0xBF881868 */
  .extern CFD2FLTOBJ5INV   /* 0xBF88186C */
  .extern CFD2MASK5        /* 0xBF881870 */
  .extern CFD2MASK5CLR     /* 0xBF881874 */
  .extern CFD2MASK5SET     /* 0xBF881878 */
  .extern CFD2MASK5INV     /* 0xBF88187C */
  .extern CFD2FLTOBJ6      /* 0xBF881880 */
  .extern CFD2FLTOBJ6CLR   /* 0xBF881884 */
  .extern CFD2FLTOBJ6SET   /* 0xBF881888 */
  .extern CFD2FLTOBJ6INV   /* 0xBF88188C */
  .extern CFD2MASK6        /* 0xBF881890 */
  .extern CFD2MASK6CLR     /* 0xBF881894 */
  .extern CFD2MASK6SET     /* 0xBF881898 */
  .extern CFD2MASK6INV     /* 0xBF88189C */
  .extern CFD2FLTOBJ7      /* 0xBF8818A0 */
  .extern CFD2FLTOBJ7CLR   /* 0xBF8818A4 */
  .extern CFD2FLTOBJ7SET   /* 0xBF8818A8 */
  .extern CFD2FLTOBJ7INV   /* 0xBF8818AC */
  .extern CFD2MASK7        /* 0xBF8818B0 */
  .extern CFD2MASK7CLR     /* 0xBF8818B4 */
  .extern CFD2MASK7SET     /* 0xBF8818B8 */
  .extern CFD2FLTOBJ8      /* 0xBF8818C0 */
  .extern CFD2FLTOBJ8CLR   /* 0xBF8818C4 */
  .extern CFD2FLTOBJ8SET   /* 0xBF8818C8 */
  .extern CFD2FLTOBJ8INV   /* 0xBF8818CC */
  .extern CFD2MASK8        /* 0xBF8818D0 */
  .extern CFD2MASK8CLR     /* 0xBF8818D4 */
  .extern CFD2MASK8SET     /* 0xBF8818D8 */
  .extern CFD2MASK8INV     /* 0xBF8818DC */
  .extern CFD2FLTOBJ9      /* 0xBF8818E0 */
  .extern CFD2FLTOBJ9CLR   /* 0xBF8818E4 */
  .extern CFD2FLTOBJ9SET   /* 0xBF8818E8 */
  .extern CFD2FLTOBJ9INV   /* 0xBF8818EC */
  .extern CFD2MASK9        /* 0xBF8818F0 */
  .extern CFD2MASK9CLR     /* 0xBF8818F4 */
  .extern CFD2MASK9SET     /* 0xBF8818F8 */
  .extern CFD2MASK9INV     /* 0xBF8818FC */
  .extern CFD2FLTOBJ10     /* 0xBF881900 */
  .extern CFD2FLTOBJ10CLR  /* 0xBF881904 */
  .extern CFD2FLTOBJ10SET  /* 0xBF881908 */
  .extern CFD2FLTOBJ10INV  /* 0xBF88190C */
  .extern CFD2MASK10       /* 0xBF881910 */
  .extern CFD2MASK10CLR    /* 0xBF881914 */
  .extern CFD2MASK10SET    /* 0xBF881918 */
  .extern CFD2MASK10INV    /* 0xBF88191C */
  .extern CFD2FLTOBJ11     /* 0xBF881920 */
  .extern CFD2FLTOBJ11CLR  /* 0xBF881924 */
  .extern CFD2FLTOBJ11SET  /* 0xBF881928 */
  .extern CFD2FLTOBJ11INV  /* 0xBF88192C */
  .extern CFD2MASK11       /* 0xBF881930 */
  .extern CFD2MASK11CLR    /* 0xBF881934 */
  .extern CFD2MASK11SET    /* 0xBF881938 */
  .extern CFD2MASK11INV    /* 0xBF88193C */
  .extern CFD2FLTOBJ12     /* 0xBF881940 */
  .extern CFD2FLTOBJ12CLR  /* 0xBF881944 */
  .extern CFD2FLTOBJ12SET  /* 0xBF881948 */
  .extern CFD2FLTOBJ12INV  /* 0xBF88194C */
  .extern CFD2MASK12       /* 0xBF881950 */
  .extern CFD2MASK12CLR    /* 0xBF881954 */
  .extern CFD2MASK12SET    /* 0xBF881958 */
  .extern CFD2MASK12INV    /* 0xBF88195C */
  .extern CFD2FLTOBJ13     /* 0xBF881960 */
  .extern CFD2FLTOBJ13CLR  /* 0xBF881964 */
  .extern CFD2FLTOBJ13SET  /* 0xBF881968 */
  .extern CFD2FLTOBJ13INV  /* 0xBF88196C */
  .extern CFD2MASK13       /* 0xBF881970 */
  .extern CFD2MASK13CLR    /* 0xBF881974 */
  .extern CFD2MASK13SET    /* 0xBF881978 */
  .extern CFD2MASK13INV    /* 0xBF88197C */
  .extern CFD2FLTOBJ14     /* 0xBF881980 */
  .extern CFD2FLTOBJ14CLR  /* 0xBF881984 */
  .extern CFD2FLTOBJ14SET  /* 0xBF881988 */
  .extern CFD2FLTOBJ14INV  /* 0xBF88198C */
  .extern CFD2MASK14       /* 0xBF881990 */
  .extern CFD2MASK14CLR    /* 0xBF881994 */
  .extern CFD2MASK14SET    /* 0xBF881998 */
  .extern CFD2MASK14INV    /* 0xBF88199C */
  .extern CFD2FLTOBJ15     /* 0xBF8819A0 */
  .extern CFD2FLTOBJ15CLR  /* 0xBF8819A4 */
  .extern CFD2FLTOBJ15SET  /* 0xBF8819A8 */
  .extern CFD2FLTOBJ15INV  /* 0xBF8819AC */
  .extern CFD2MASK15       /* 0xBF8819B0 */
  .extern CFD2MASK15CLR    /* 0xBF8819B4 */
  .extern CFD2MASK15SET    /* 0xBF8819B8 */
  .extern CFD2MASK15INV    /* 0xBF8819BC */
  .extern CFD2FLTOBJ16     /* 0xBF8819C0 */
  .extern CFD2FLTOBJ16CLR  /* 0xBF8819C4 */
  .extern CFD2FLTOBJ16SET  /* 0xBF8819C8 */
  .extern CFD2FLTOBJ16INV  /* 0xBF8819CC */
  .extern CFD2MASK16       /* 0xBF8819D0 */
  .extern CFD2MASK16CLR    /* 0xBF8819D4 */
  .extern CFD2MASK16SET    /* 0xBF8819D8 */
  .extern CFD2MASK16INV    /* 0xBF8819DC */
  .extern CFD2FLTOBJ17     /* 0xBF8819E0 */
  .extern CFD2FLTOBJ17CLR  /* 0xBF8819E4 */
  .extern CFD2FLTOBJ17SET  /* 0xBF8819E8 */
  .extern CFD2FLTOBJ17INV  /* 0xBF8819EC */
  .extern CFD2MASK17       /* 0xBF8819F0 */
  .extern CFD2MASK17CLR    /* 0xBF8819F4 */
  .extern CFD2MASK17SET    /* 0xBF8819F8 */
  .extern CFD2MASK17INV    /* 0xBF8819FC */
  .extern CFD2FLTOBJ18     /* 0xBF881A00 */
  .extern CFD2FLTOBJ18CLR  /* 0xBF881A04 */
  .extern CFD2FLTOBJ18SET  /* 0xBF881A08 */
  .extern CFD2FLTOBJ18INV  /* 0xBF881A0C */
  .extern CFD2MASK18       /* 0xBF881A10 */
  .extern CFD2MASK18CLR    /* 0xBF881A14 */
  .extern CFD2MASK18SET    /* 0xBF881A18 */
  .extern CFD2MASK18INV    /* 0xBF881A1C */
  .extern CFD2FLTOBJ19     /* 0xBF881A20 */
  .extern CFD2FLTOBJ19CLR  /* 0xBF881A24 */
  .extern CFD2FLTOBJ19SET  /* 0xBF881A28 */
  .extern CFD2FLTOBJ19INV  /* 0xBF881A2C */
  .extern CFD2MASK19       /* 0xBF881A30 */
  .extern CFD2MASK19CLR    /* 0xBF881A34 */
  .extern CFD2MASK19SET    /* 0xBF881A38 */
  .extern CFD2MASK19INV    /* 0xBF881A3C */
  .extern CFD2FLTOBJ20     /* 0xBF881A40 */
  .extern CFD2FLTOBJ20CLR  /* 0xBF881A44 */
  .extern CFD2FLTOBJ20SET  /* 0xBF881A48 */
  .extern CFD2FLTOBJ20INV  /* 0xBF881A4C */
  .extern CFD2MASK20       /* 0xBF881A50 */
  .extern CFD2MASK20CLR    /* 0xBF881A54 */
  .extern CFD2MASK20SET    /* 0xBF881A58 */
  .extern CFD2MASK20INV    /* 0xBF881A5C */
  .extern CFD2FLTOBJ21     /* 0xBF881A60 */
  .extern CFD2FLTOBJ21CLR  /* 0xBF881A64 */
  .extern CFD2FLTOBJ21SET  /* 0xBF881A68 */
  .extern CFD2FLTOBJ21INV  /* 0xBF881A6C */
  .extern CFD2MASK21       /* 0xBF881A70 */
  .extern CFD2MASK21CLR    /* 0xBF881A74 */
  .extern CFD2MASK21SET    /* 0xBF881A78 */
  .extern CFD2MASK21INV    /* 0xBF881A7C */
  .extern CFD2FLTOBJ22     /* 0xBF881A80 */
  .extern CFD2FLTOBJ22CLR  /* 0xBF881A84 */
  .extern CFD2FLTOBJ22SET  /* 0xBF881A88 */
  .extern CFD2FLTOBJ22INV  /* 0xBF881A8C */
  .extern CFD2MASK22       /* 0xBF881A90 */
  .extern CFD2MASK22CLR    /* 0xBF881A94 */
  .extern CFD2MASK22SET    /* 0xBF881A98 */
  .extern CFD2MASK22INV    /* 0xBF881A9C */
  .extern CFD2FLTOBJ23     /* 0xBF881AA0 */
  .extern CFD2FLTOBJ23CLR  /* 0xBF881AA4 */
  .extern CFD2FLTOBJ23SET  /* 0xBF881AA8 */
  .extern CFD2FLTOBJ23INV  /* 0xBF881AAC */
  .extern CFD2MASK23       /* 0xBF881AB0 */
  .extern CFD2MASK23CLR    /* 0xBF881AB4 */
  .extern CFD2MASK23SET    /* 0xBF881AB8 */
  .extern CFD2MASK23INV    /* 0xBF881ABC */
  .extern CFD2FLTOBJ24     /* 0xBF881AC0 */
  .extern CFD2FLTOBJ24CLR  /* 0xBF881AC4 */
  .extern CFD2FLTOBJ24SET  /* 0xBF881AC8 */
  .extern CFD2FLTOBJ24INV  /* 0xBF881ACC */
  .extern CFD2MASK24       /* 0xBF881AD0 */
  .extern CFD2MASK24CLR    /* 0xBF881AD4 */
  .extern CFD2MASK24SET    /* 0xBF881AD8 */
  .extern CFD2MASK24INV    /* 0xBF881ADC */
  .extern CFD2FLTOBJ25     /* 0xBF881AE0 */
  .extern CFD2FLTOBJ25CLR  /* 0xBF881AE4 */
  .extern CFD2FLTOBJ25SET  /* 0xBF881AE8 */
  .extern CFD2FLTOBJ25INV  /* 0xBF881AEC */
  .extern CFD2MASK25       /* 0xBF881AF0 */
  .extern CFD2MASK25CLR    /* 0xBF881AF4 */
  .extern CFD2MASK25SET    /* 0xBF881AF8 */
  .extern CFD2MASK25INV    /* 0xBF881AFC */
  .extern CFD2FLTOBJ26     /* 0xBF881B00 */
  .extern CFD2FLTOBJ26CLR  /* 0xBF881B04 */
  .extern CFD2FLTOBJ26SET  /* 0xBF881B08 */
