Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern CFD2FLTOBJ26INV  /* 0xBF881B0C */
  .extern CFD2MASK26       /* 0xBF881B10 */
  .extern CFD2MASK26CLR    /* 0xBF881B14 */
  .extern CFD2MASK26SET    /* 0xBF881B18 */
  .extern CFD2MASK26INV    /* 0xBF881B1C */
  .extern CFD2FLTOBJ27     /* 0xBF881B20 */
  .extern CFD2FLTOBJ27CLR  /* 0xBF881B24 */
  .extern CFD2FLTOBJ27SET  /* 0xBF881B28 */
  .extern CFD2FLTOBJ27INV  /* 0xBF881B2C */
  .extern CFD2MASK27       /* 0xBF881B30 */
  .extern CFD2MASK27CLR    /* 0xBF881B34 */
  .extern CFD2MASK27SET    /* 0xBF881B38 */
  .extern CFD2MASK27INV    /* 0xBF881B3C */
  .extern CFD2FLTOBJ28     /* 0xBF881B40 */
  .extern CFD2FLTOBJ28CLR  /* 0xBF881B44 */
  .extern CFD2FLTOBJ28SET  /* 0xBF881B48 */
  .extern CFD2FLTOBJ28INV  /* 0xBF881B4C */
  .extern CFD2MASK28       /* 0xBF881B50 */
  .extern CFD2MASK28CLR    /* 0xBF881B54 */
  .extern CFD2MASK28SET    /* 0xBF881B58 */
  .extern CFD2MASK28INV    /* 0xBF881B5C */
  .extern CFD2FLTOBJ29     /* 0xBF881B60 */
  .extern CFD2FLTOBJ29CLR  /* 0xBF881B64 */
  .extern CFD2FLTOBJ29SET  /* 0xBF881B68 */
  .extern CFD2FLTOBJ29INV  /* 0xBF881B6C */
  .extern CFD2MASK29       /* 0xBF881B70 */
  .extern CFD2MASK29CLR    /* 0xBF881B74 */
  .extern CFD2MASK29SET    /* 0xBF881B78 */
  .extern CFD2MASK29INV    /* 0xBF881B7C */
  .extern CFD2FLTOBJ30     /* 0xBF881B80 */
  .extern CFD2FLTOBJ30CLR  /* 0xBF881B84 */
  .extern CFD2FLTOBJ30SET  /* 0xBF881B88 */
  .extern CFD2FLTOBJ30INV  /* 0xBF881B8C */
  .extern CFD2MASK30       /* 0xBF881B90 */
  .extern CFD2MASK30CLR    /* 0xBF881B94 */
  .extern CFD2MASK30SET    /* 0xBF881B98 */
  .extern CFD2MASK30INV    /* 0xBF881B9C */
  .extern CFD2FLTOBJ31     /* 0xBF881BA0 */
  .extern CFD2FLTOBJ31CLR  /* 0xBF881BA4 */
  .extern CFD2FLTOBJ31SET  /* 0xBF881BA8 */
  .extern CFD2FLTOBJ31INV  /* 0xBF881BAC */
  .extern CFD2MASK31       /* 0xBF881BB0 */
  .extern CFD2MASK31CLR    /* 0xBF881BB4 */
  .extern CFD2MASK31SET    /* 0xBF881BB8 */
  .extern CFD2MASK31INV    /* 0xBF881BBC */
  .extern CFD3CON          /* 0xBF884000 */
  .extern CFD3CONCLR       /* 0xBF884004 */
  .extern CFD3CONSET       /* 0xBF884008 */
  .extern CFD3CONINV       /* 0xBF88400C */
  .extern CFD3NBTCFG       /* 0xBF884010 */
  .extern CFD3NBTCFGCLR    /* 0xBF884014 */
  .extern CFD3NBTCFGSET    /* 0xBF884018 */
  .extern CFD3NBTCFGINV    /* 0xBF88401C */
  .extern CFD3DBTCFG       /* 0xBF884020 */
  .extern CFD3DBTCFGCLR    /* 0xBF884024 */
  .extern CFD3DBTCFGSET    /* 0xBF884028 */
  .extern CFD3DBTCFGINV    /* 0xBF88402C */
  .extern CFD3TDC          /* 0xBF884030 */
  .extern CFD3TDCCLR       /* 0xBF884034 */
  .extern CFD3TDCSET       /* 0xBF884038 */
  .extern CFD3TDCINV       /* 0xBF88403C */
  .extern CFD3TBC          /* 0xBF884040 */
  .extern CFD3TBCCLR       /* 0xBF884044 */
  .extern CFD3TBCSET       /* 0xBF884048 */
  .extern CFD3TBCINV       /* 0xBF88404C */
  .extern CFD3TSCON        /* 0xBF884050 */
  .extern CFD3TSCONCLR     /* 0xBF884054 */
  .extern CFD3TSCONSET     /* 0xBF884058 */
  .extern CFD3TSCONINV     /* 0xBF88405C */
  .extern CFD3VEC          /* 0xBF884060 */
  .extern CFD3VECCLR       /* 0xBF884064 */
  .extern CFD3VECSET       /* 0xBF884068 */
  .extern CFD3VECINV       /* 0xBF88406C */
  .extern CFD3INT          /* 0xBF884070 */
  .extern CFD3INTCLR       /* 0xBF884074 */
  .extern CFD3INTSET       /* 0xBF884078 */
  .extern CFD3INTINV       /* 0xBF88407C */
  .extern CFD3RXIF         /* 0xBF884080 */
  .extern CFD3RXIFCLR      /* 0xBF884084 */
  .extern CFD3RXIFSET      /* 0xBF884088 */
  .extern CFD3RXIFINV      /* 0xBF88408C */
  .extern CFD3TXIF         /* 0xBF884090 */
  .extern CFD3TXIFCLR      /* 0xBF884094 */
  .extern CFD3TXIFSET      /* 0xBF884098 */
  .extern CFD3TXIFINV      /* 0xBF88409C */
  .extern CFD3RXOVIF       /* 0xBF8840A0 */
  .extern CFD3RXOVIFCLR    /* 0xBF8840A4 */
  .extern CFD3RXOVIFSET    /* 0xBF8840A8 */
  .extern CFD3RXOVIFINV    /* 0xBF8840AC */
  .extern CFD3TXATIF       /* 0xBF8840B0 */
  .extern CFD3TXATIFCLR    /* 0xBF8840B4 */
  .extern CFD3TXATIFSET    /* 0xBF8840B8 */
  .extern CFD3TXATIFINV    /* 0xBF8840BC */
  .extern CFD3TXREQ        /* 0xBF8840C0 */
  .extern CFD3TXREQCLR     /* 0xBF8840C4 */
  .extern CFD3TXREQSET     /* 0xBF8840C8 */
  .extern CFD3TXREQINV     /* 0xBF8840CC */
  .extern CFD3TREC         /* 0xBF8840D0 */
  .extern CFD3TRECCLR      /* 0xBF8840D4 */
  .extern CFD3TRECSET      /* 0xBF8840D8 */
  .extern CFD3TRECINV      /* 0xBF8840DC */
  .extern CFD3BDIAG0       /* 0xBF8840E0 */
  .extern CFD3BDIAG0CLR    /* 0xBF8840E4 */
  .extern CFD3BDIAG0SET    /* 0xBF8840E8 */
  .extern CFD3BDIAG0INV    /* 0xBF8840EC */
  .extern CFD3BDIAG1       /* 0xBF8840F0 */
  .extern CFD3BDIAG1CLR    /* 0xBF8840F4 */
  .extern CFD3BDIAG1SET    /* 0xBF8840F8 */
  .extern CFD3BDIAG1INV    /* 0xBF8840FC */
  .extern CFD3TEFCON       /* 0xBF884100 */
  .extern CFD3TEFCONCLR    /* 0xBF884104 */
  .extern CFD3TEFCONSET    /* 0xBF884108 */
  .extern CFD3TEFCONINV    /* 0xBF88410C */
  .extern CFD3TEFSTA       /* 0xBF884110 */
  .extern CFD3TEFSTACLR    /* 0xBF884114 */
  .extern CFD3TEFSTASET    /* 0xBF884118 */
  .extern CFD3TEFSTAINV    /* 0xBF88411C */
  .extern CFD3TEFUA        /* 0xBF884120 */
  .extern CFD3TEFUACLR     /* 0xBF884124 */
  .extern CFD3TEFUASET     /* 0xBF884128 */
  .extern CFD3TEFUAINV     /* 0xBF88412C */
  .extern CFD3FIFOBA       /* 0xBF884130 */
  .extern CFD3FIFOBACLR    /* 0xBF884134 */
  .extern CFD3FIFOBASET    /* 0xBF884138 */
  .extern CFD3FIFOBAINV    /* 0xBF88413C */
  .extern CFD3TXQCON       /* 0xBF884140 */
  .extern CFD3TXQCONCLR    /* 0xBF884144 */
  .extern CFD3TXQCONSET    /* 0xBF884148 */
  .extern CFD3TXQCONINV    /* 0xBF88414C */
  .extern CFD3TXQSTA       /* 0xBF884150 */
  .extern CFD3TXQSTACLR    /* 0xBF884154 */
  .extern CFD3TXQSTASET    /* 0xBF884158 */
  .extern CFD3TXQSTAINV    /* 0xBF88415C */
  .extern CFD3TXQUA        /* 0xBF884160 */
  .extern CFD3TXQUACLR     /* 0xBF884164 */
  .extern CFD3TXQUASET     /* 0xBF884168 */
  .extern CFD3TXQUAINV     /* 0xBF88416C */
  .extern CFD3FIFOCON1     /* 0xBF884170 */
  .extern CFD3FIFOCON1CLR  /* 0xBF884174 */
  .extern CFD3FIFOCON1SET  /* 0xBF884178 */
  .extern CFD3FIFOCON1INV  /* 0xBF88417C */
  .extern CFD3FIFOSTA1     /* 0xBF884180 */
  .extern CFD3FIFOSTA1CLR  /* 0xBF884184 */
  .extern CFD3FIFOSTA1SET  /* 0xBF884188 */
  .extern CFD3FIFOSTA1INV  /* 0xBF88418C */
  .extern CFD3FIFOUA1      /* 0xBF884190 */
  .extern CFD3FIFOUA1CLR   /* 0xBF884194 */
  .extern CFD3FIFOUA1SET   /* 0xBF884198 */
  .extern CFD3FIFOUA1INV   /* 0xBF88419C */
  .extern CFD3FIFOCON2     /* 0xBF8841A0 */
  .extern CFD3FIFOCON2CLR  /* 0xBF8841A4 */
  .extern CFD3FIFOCON2SET  /* 0xBF8841A8 */
  .extern CFD3FIFOCON2INV  /* 0xBF8841AC */
  .extern CFD3FIFOSTA2     /* 0xBF8841B0 */
  .extern CFD3FIFOSTA2CLR  /* 0xBF8841B4 */
  .extern CFD3FIFOSTA2SET  /* 0xBF8841B8 */
  .extern CFD3FIFOSTA2INV  /* 0xBF8841BC */
  .extern CFD3FIFOUA2      /* 0xBF8841C0 */
  .extern CFD3FIFOUA2CLR   /* 0xBF8841C4 */
  .extern CFD3FIFOUA2SET   /* 0xBF8841C8 */
  .extern CFD3FIFOUA2INV   /* 0xBF8841CC */
  .extern CFD3FIFOCON3     /* 0xBF8841D0 */
  .extern CFD3FIFOCON3CLR  /* 0xBF8841D4 */
  .extern CFD3FIFOCON3SET  /* 0xBF8841D8 */
  .extern CFD3FIFOCON3INV  /* 0xBF8841DC */
  .extern CFD3FIFOSTA3     /* 0xBF8841E0 */
  .extern CFD3FIFOSTA3CLR  /* 0xBF8841E4 */
  .extern CFD3FIFOSTA3SET  /* 0xBF8841E8 */
  .extern CFD3FIFOSTA3INV  /* 0xBF8841EC */
  .extern CFD3FIFOUA3      /* 0xBF8841F0 */
  .extern CFD3FIFOUA3CLR   /* 0xBF8841F4 */
  .extern CFD3FIFOUA3SET   /* 0xBF8841F8 */
  .extern CFD3FIFOUA3INV   /* 0xBF8841FC */
  .extern CFD3FIFOCON4     /* 0xBF884200 */
  .extern CFD3FIFOCON4CLR  /* 0xBF884204 */
  .extern CFD3FIFOCON4SET  /* 0xBF884208 */
  .extern CFD3FIFOCON4INV  /* 0xBF88420C */
  .extern CFD3FIFOSTA4     /* 0xBF884210 */
  .extern CFD3FIFOSTA4CLR  /* 0xBF884214 */
  .extern CFD3FIFOSTA4SET  /* 0xBF884218 */
  .extern CFD3FIFOSTA4INV  /* 0xBF88421C */
  .extern CFD3FIFOUA4      /* 0xBF884220 */
  .extern CFD3FIFOUA4CLR   /* 0xBF884224 */
  .extern CFD3FIFOUA4SET   /* 0xBF884228 */
  .extern CFD3FIFOUA4INV   /* 0xBF88422C */
  .extern CFD3FIFOCON5     /* 0xBF884230 */
  .extern CFD3FIFOCON5CLR  /* 0xBF884234 */
  .extern CFD3FIFOCON5SET  /* 0xBF884238 */
  .extern CFD3FIFOCON5INV  /* 0xBF88423C */
  .extern CFD3FIFOSTA5     /* 0xBF884240 */
  .extern CFD3FIFOSTA5CLR  /* 0xBF884244 */
  .extern CFD3FIFOSTA5SET  /* 0xBF884248 */
  .extern CFD3FIFOSTA5INV  /* 0xBF88424C */
  .extern CFD3FIFOUA5      /* 0xBF884250 */
  .extern CFD3FIFOUA5CLR   /* 0xBF884254 */
  .extern CFD3FIFOUA5SET   /* 0xBF884258 */
  .extern CFD3FIFOUA5INV   /* 0xBF88425C */
  .extern CFD3FIFOCON6     /* 0xBF884260 */
  .extern CFD3FIFOCON6CLR  /* 0xBF884264 */
  .extern CFD3FIFOCON6SET  /* 0xBF884268 */
  .extern CFD3FIFOCON6INV  /* 0xBF88426C */
  .extern CFD3FIFOSTA6     /* 0xBF884270 */
  .extern CFD3FIFOSTA6CLR  /* 0xBF884274 */
  .extern CFD3FIFOSTA6SET  /* 0xBF884278 */
  .extern CFD3FIFOSTA6INV  /* 0xBF88427C */
  .extern CFD3FIFOUA6      /* 0xBF884280 */
  .extern CFD3FIFOUA6CLR   /* 0xBF884284 */
  .extern CFD3FIFOUA6SET   /* 0xBF884288 */
  .extern CFD3FIFOUA6INV   /* 0xBF88428C */
  .extern CFD3FIFOCON7     /* 0xBF884290 */
  .extern CFD3FIFOCON7CLR  /* 0xBF884294 */
  .extern CFD3FIFOCON7SET  /* 0xBF884298 */
  .extern CFD3FIFOCON7INV  /* 0xBF88429C */
  .extern CFD3FIFOSTA7     /* 0xBF8842A0 */
  .extern CFD3FIFOSTA7CLR  /* 0xBF8842A4 */
  .extern CFD3FIFOSTA7SET  /* 0xBF8842A8 */
  .extern CFD3FIFOSTA7INV  /* 0xBF8842AC */
  .extern CFD3FIFOUA7      /* 0xBF8842B0 */
  .extern CFD3FIFOUA7CLR   /* 0xBF8842B4 */
  .extern CFD3FIFOUA7SET   /* 0xBF8842B8 */
  .extern CFD3FIFOUA7INV   /* 0xBF8842BC */
  .extern CFD3FIFOCON8     /* 0xBF8842C0 */
  .extern CFD3FIFOCON8CLR  /* 0xBF8842C4 */
  .extern CFD3FIFOCON8SET  /* 0xBF8842C8 */
  .extern CFD3FIFOCON8INV  /* 0xBF8842CC */
  .extern CFD3FIFOSTA8     /* 0xBF8842D0 */
  .extern CFD3FIFOSTA8CLR  /* 0xBF8842D4 */
  .extern CFD3FIFOSTA8SET  /* 0xBF8842D8 */
  .extern CFD3FIFOSTA8INV  /* 0xBF8842DC */
  .extern CFD3FIFOUA8      /* 0xBF8842E0 */
  .extern CFD3FIFOUA8CLR   /* 0xBF8842E4 */
  .extern CFD3FIFOUA8SET   /* 0xBF8842E8 */
  .extern CFD3FIFOUA8INV   /* 0xBF8842EC */
  .extern CFD3FIFOCON9     /* 0xBF8842F0 */
  .extern CFD3FIFOCON9CLR  /* 0xBF8842F4 */
  .extern CFD3FIFOCON9SET  /* 0xBF8842F8 */
  .extern CFD3FIFOCON9INV  /* 0xBF8842FC */
  .extern CFD3FIFOSTA9     /* 0xBF884300 */
  .extern CFD3FIFOSTA9CLR  /* 0xBF884304 */
  .extern CFD3FIFOSTA9SET  /* 0xBF884308 */
  .extern CFD3FIFOSTA9INV  /* 0xBF88430C */
  .extern CFD3FIFOUA9      /* 0xBF884310 */
  .extern CFD3FIFOUA9CLR   /* 0xBF884314 */
  .extern CFD3FIFOUA9SET   /* 0xBF884318 */
  .extern CFD3FIFOUA9INV   /* 0xBF88431C */
  .extern CFD3FIFOCON10    /* 0xBF884320 */
  .extern CFD3FIFOCON10CLR /* 0xBF884324 */
  .extern CFD3FIFOCON10SET /* 0xBF884328 */
  .extern CFD3FIFOCON10INV /* 0xBF88432C */
  .extern CFD3FIFOSTA10    /* 0xBF884330 */
  .extern CFD3FIFOSTA10CLR /* 0xBF884334 */
  .extern CFD3FIFOSTA10SET /* 0xBF884338 */
  .extern CFD3FIFOSTA10INV /* 0xBF88433C */
  .extern CFD3FIFOUA10     /* 0xBF884340 */
  .extern CFD3FIFOUA10CLR  /* 0xBF884344 */
  .extern CFD3FIFOUA10SET  /* 0xBF884348 */
  .extern CFD3FIFOUA10INV  /* 0xBF88434C */
  .extern CFD3FIFOCON11    /* 0xBF884350 */
  .extern CFD3FIFOCON11CLR /* 0xBF884354 */
  .extern CFD3FIFOCON11SET /* 0xBF884358 */
  .extern CFD3FIFOCON11INV /* 0xBF88435C */
  .extern CFD3FIFOSTA11    /* 0xBF884360 */
  .extern CFD3FIFOSTA11CLR /* 0xBF884364 */
  .extern CFD3FIFOSTA11SET /* 0xBF884368 */
  .extern CFD3FIFOSTA11INV /* 0xBF88436C */
  .extern CFD3FIFOUA11     /* 0xBF884370 */
  .extern CFD3FIFOUA11CLR  /* 0xBF884374 */
  .extern CFD3FIFOUA11SET  /* 0xBF884378 */
  .extern CFD3FIFOUA11INV  /* 0xBF88437C */
  .extern CFD3FIFOCON12    /* 0xBF884380 */
  .extern CFD3FIFOCON12CLR /* 0xBF884384 */
  .extern CFD3FIFOCON12SET /* 0xBF884388 */
  .extern CFD3FIFOCON12INV /* 0xBF88438C */
  .extern CFD3FIFOSTA12    /* 0xBF884390 */
  .extern CFD3FIFOSTA12CLR /* 0xBF884394 */
  .extern CFD3FIFOSTA12SET /* 0xBF884398 */
  .extern CFD3FIFOSTA12INV /* 0xBF88439C */
  .extern CFD3FIFOUA12     /* 0xBF8843A0 */
  .extern CFD3FIFOUA12CLR  /* 0xBF8843A4 */
  .extern CFD3FIFOUA12SET  /* 0xBF8843A8 */
  .extern CFD3FIFOUA12INV  /* 0xBF8843AC */
  .extern CFD3FIFOCON13    /* 0xBF8843B0 */
  .extern CFD3FIFOCON13CLR /* 0xBF8843B4 */
  .extern CFD3FIFOCON13SET /* 0xBF8843B8 */
  .extern CFD3FIFOCON13INV /* 0xBF8843BC */
  .extern CFD3FIFOSTA13    /* 0xBF8843C0 */
  .extern CFD3FIFOSTA13CLR /* 0xBF8843C4 */
  .extern CFD3FIFOSTA13SET /* 0xBF8843C8 */
  .extern CFD3FIFOSTA13INV /* 0xBF8843CC */
  .extern CFD3FIFOUA13     /* 0xBF8843D0 */
  .extern CFD3FIFOUA13CLR  /* 0xBF8843D4 */
  .extern CFD3FIFOUA13SET  /* 0xBF8843D8 */
  .extern CFD3FIFOUA13INV  /* 0xBF8843DC */
  .extern CFD3FIFOCON14    /* 0xBF8843E0 */
  .extern CFD3FIFOCON14CLR /* 0xBF8843E4 */
  .extern CFD3FIFOCON14SET /* 0xBF8843E8 */
  .extern CFD3FIFOCON14INV /* 0xBF8843EC */
  .extern CFD3FIFOSTA14    /* 0xBF8843F0 */
  .extern CFD3FIFOSTA14CLR /* 0xBF8843F4 */
  .extern CFD3FIFOSTA14SET /* 0xBF8843F8 */
  .extern CFD3FIFOSTA14INV /* 0xBF8843FC */
  .extern CFD3FIFOUA14     /* 0xBF884400 */
  .extern CFD3FIFOUA14CLR  /* 0xBF884404 */
  .extern CFD3FIFOUA14SET  /* 0xBF884408 */
  .extern CFD3FIFOUA14INV  /* 0xBF88440C */
  .extern CFD3FIFOCON15    /* 0xBF884410 */
  .extern CFD3FIFOCON15CLR /* 0xBF884414 */
  .extern CFD3FIFOCON15SET /* 0xBF884418 */
  .extern CFD3FIFOCON15INV /* 0xBF88441C */
  .extern CFD3FIFOSTA15    /* 0xBF884420 */
  .extern CFD3FIFOSTA15CLR /* 0xBF884424 */
  .extern CFD3FIFOSTA15SET /* 0xBF884428 */
  .extern CFD3FIFOSTA15INV /* 0xBF88442C */
  .extern CFD3FIFOUA15     /* 0xBF884430 */
  .extern CFD3FIFOUA15CLR  /* 0xBF884434 */
  .extern CFD3FIFOUA15SET  /* 0xBF884438 */
  .extern CFD3FIFOUA15INV  /* 0xBF88443C */
  .extern CFD3FIFOCON16    /* 0xBF884440 */
  .extern CFD3FIFOCON16CLR /* 0xBF884444 */
  .extern CFD3FIFOCON16SET /* 0xBF884448 */
  .extern CFD3FIFOCON16INV /* 0xBF88444C */
  .extern CFD3FIFOSTA16    /* 0xBF884450 */
  .extern CFD3FIFOSTA16CLR /* 0xBF884454 */
  .extern CFD3FIFOSTA16SET /* 0xBF884458 */
  .extern CFD3FIFOSTA16INV /* 0xBF88445C */
  .extern CFD3FIFOUA16     /* 0xBF884460 */
  .extern CFD3FIFOUA16CLR  /* 0xBF884464 */
  .extern CFD3FIFOUA16SET  /* 0xBF884468 */
  .extern CFD3FIFOUA16INV  /* 0xBF88446C */
  .extern CFD3FIFOCON17    /* 0xBF884470 */
  .extern CFD3FIFOCON17CLR /* 0xBF884474 */
  .extern CFD3FIFOCON17SET /* 0xBF884478 */
  .extern CFD3FIFOCON17INV /* 0xBF88447C */
  .extern CFD3FIFOSTA17    /* 0xBF884480 */
  .extern CFD3FIFOSTA17CLR /* 0xBF884484 */
  .extern CFD3FIFOSTA17SET /* 0xBF884488 */
  .extern CFD3FIFOSTA17INV /* 0xBF88448C */
  .extern CFD3FIFOUA17     /* 0xBF884490 */
  .extern CFD3FIFOUA17CLR  /* 0xBF884494 */
  .extern CFD3FIFOUA17SET  /* 0xBF884498 */
  .extern CFD3FIFOUA17INV  /* 0xBF88449C */
  .extern CFD3FIFOCON18    /* 0xBF8844A0 */
  .extern CFD3FIFOCON18CLR /* 0xBF8844A4 */
  .extern CFD3FIFOCON18SET /* 0xBF8844A8 */
  .extern CFD3FIFOCON18INV /* 0xBF8844AC */
  .extern CFD3FIFOSTA18    /* 0xBF8844B0 */
  .extern CFD3FIFOSTA18CLR /* 0xBF8844B4 */
  .extern CFD3FIFOSTA18SET /* 0xBF8844B8 */
  .extern CFD3FIFOSTA18INV /* 0xBF8844BC */
  .extern CFD3FIFOUA18     /* 0xBF8844C0 */
  .extern CFD3FIFOUA18CLR  /* 0xBF8844C4 */
  .extern CFD3FIFOUA18SET  /* 0xBF8844C8 */
  .extern CFD3FIFOUA18INV  /* 0xBF8844CC */
  .extern CFD3FIFOCON19    /* 0xBF8844D0 */
  .extern CFD3FIFOCON19CLR /* 0xBF8844D4 */
  .extern CFD3FIFOCON19SET /* 0xBF8844D8 */
  .extern CFD3FIFOCON19INV /* 0xBF8844DC */
  .extern CFD3FIFOSTA19    /* 0xBF8844E0 */
  .extern CFD3FIFOSTA19CLR /* 0xBF8844E4 */
  .extern CFD3FIFOSTA19SET /* 0xBF8844E8 */
  .extern CFD3FIFOSTA19INV /* 0xBF8844EC */
  .extern CFD3FIFOUA19     /* 0xBF8844F0 */
  .extern CFD3FIFOUA19CLR  /* 0xBF8844F4 */
  .extern CFD3FIFOUA19SET  /* 0xBF8844F8 */
  .extern CFD3FIFOUA19INV  /* 0xBF8844FC */
  .extern CFD3FIFOCON20    /* 0xBF884500 */
  .extern CFD3FIFOCON20CLR /* 0xBF884504 */
  .extern CFD3FIFOCON20SET /* 0xBF884508 */
  .extern CFD3FIFOCON20INV /* 0xBF88450C */
  .extern CFD3FIFOSTA20    /* 0xBF884510 */
  .extern CFD3FIFOSTA20CLR /* 0xBF884514 */
  .extern CFD3FIFOSTA20SET /* 0xBF884518 */
  .extern CFD3FIFOSTA20INV /* 0xBF88451C */
  .extern CFD3FIFOUA20     /* 0xBF884520 */
  .extern CFD3FIFOUA20CLR  /* 0xBF884524 */
  .extern CFD3FIFOUA20SET  /* 0xBF884528 */
  .extern CFD3FIFOUA20INV  /* 0xBF88452C */
  .extern CFD3FIFOCON21    /* 0xBF884530 */
  .extern CFD3FIFOCON21CLR /* 0xBF884534 */
  .extern CFD3FIFOCON21SET /* 0xBF884538 */
  .extern CFD3FIFOCON21INV /* 0xBF88453C */
  .extern CFD3FIFOSTA21    /* 0xBF884540 */
  .extern CFD3FIFOSTA21CLR /* 0xBF884544 */
  .extern CFD3FIFOSTA21SET /* 0xBF884548 */
  .extern CFD3FIFOSTA21INV /* 0xBF88454C */
  .extern CFD3FIFOUA21     /* 0xBF884550 */
  .extern CFD3FIFOUA21CLR  /* 0xBF884554 */
  .extern CFD3FIFOUA21SET  /* 0xBF884558 */
  .extern CFD3FIFOUA21INV  /* 0xBF88455C */
  .extern CFD3FIFOCON22    /* 0xBF884560 */
  .extern CFD3FIFOCON22CLR /* 0xBF884564 */
  .extern CFD3FIFOCON22SET /* 0xBF884568 */
  .extern CFD3FIFOCON22INV /* 0xBF88456C */
  .extern CFD3FIFOSTA22    /* 0xBF884570 */
  .extern CFD3FIFOSTA22CLR /* 0xBF884574 */
  .extern CFD3FIFOSTA22SET /* 0xBF884578 */
  .extern CFD3FIFOSTA22INV /* 0xBF88457C */
  .extern CFD3FIFOUA22     /* 0xBF884580 */
  .extern CFD3FIFOUA22CLR  /* 0xBF884584 */
  .extern CFD3FIFOUA22SET  /* 0xBF884588 */
  .extern CFD3FIFOUA22INV  /* 0xBF88458C */
  .extern CFD3FIFOCON23    /* 0xBF884590 */
  .extern CFD3FIFOCON23CLR /* 0xBF884594 */
  .extern CFD3FIFOCON23SET /* 0xBF884598 */
  .extern CFD3FIFOCON23INV /* 0xBF88459C */
  .extern CFD3FIFOSTA23    /* 0xBF8845A0 */
  .extern CFD3FIFOSTA23CLR /* 0xBF8845A4 */
  .extern CFD3FIFOSTA23SET /* 0xBF8845A8 */
  .extern CFD3FIFOSTA23INV /* 0xBF8845AC */
  .extern CFD3FIFOUA23     /* 0xBF8845B0 */
  .extern CFD3FIFOUA23CLR  /* 0xBF8845B4 */
  .extern CFD3FIFOUA23SET  /* 0xBF8845B8 */
  .extern CFD3FIFOUA23INV  /* 0xBF8845BC */
  .extern CFD3FIFOCON24    /* 0xBF8845C0 */
  .extern CFD3FIFOCON24CLR /* 0xBF8845C4 */
  .extern CFD3FIFOCON24SET /* 0xBF8845C8 */
  .extern CFD3FIFOCON24INV /* 0xBF8845CC */
  .extern CFD3FIFOSTA24    /* 0xBF8845D0 */
  .extern CFD3FIFOSTA24CLR /* 0xBF8845D4 */
  .extern CFD3FIFOSTA24SET /* 0xBF8845D8 */
  .extern CFD3FIFOSTA24INV /* 0xBF8845DC */
  .extern CFD3FIFOUA24     /* 0xBF8845E0 */
  .extern CFD3FIFOUA24CLR  /* 0xBF8845E4 */
  .extern CFD3FIFOUA24SET  /* 0xBF8845E8 */
  .extern CFD3FIFOUA24INV  /* 0xBF8845EC */
  .extern CFD3FIFOCON25    /* 0xBF8845F0 */
  .extern CFD3FIFOCON25CLR /* 0xBF8845F4 */
  .extern CFD3FIFOCON25SET /* 0xBF8845F8 */
  .extern CFD3FIFOCON25INV /* 0xBF8845FC */
  .extern CFD3FIFOSTA25    /* 0xBF884600 */
  .extern CFD3FIFOSTA25CLR /* 0xBF884604 */
  .extern CFD3FIFOSTA25SET /* 0xBF884608 */
  .extern CFD3FIFOSTA25INV /* 0xBF88460C */
  .extern CFD3FIFOUA25     /* 0xBF884610 */
  .extern CFD3FIFOUA25CLR  /* 0xBF884614 */
  .extern CFD3FIFOUA25SET  /* 0xBF884618 */
  .extern CFD3FIFOUA25INV  /* 0xBF88461C */
  .extern CFD3FIFOCON26    /* 0xBF884620 */
  .extern CFD3FIFOCON26CLR /* 0xBF884624 */
  .extern CFD3FIFOCON26SET /* 0xBF884628 */
  .extern CFD3FIFOCON26INV /* 0xBF88462C */
  .extern CFD3FIFOSTA26    /* 0xBF884630 */
  .extern CFD3FIFOSTA26CLR /* 0xBF884634 */
  .extern CFD3FIFOSTA26SET /* 0xBF884638 */
  .extern CFD3FIFOSTA26INV /* 0xBF88463C */
  .extern CFD3FIFOUA26     /* 0xBF884640 */
  .extern CFD3FIFOUA26CLR  /* 0xBF884644 */
  .extern CFD3FIFOUA26SET  /* 0xBF884648 */
  .extern CFD3FIFOUA26INV  /* 0xBF88464C */
  .extern CFD3FIFOCON27    /* 0xBF884650 */
  .extern CFD3FIFOCON27CLR /* 0xBF884654 */
  .extern CFD3FIFOCON27SET /* 0xBF884658 */
  .extern CFD3FIFOCON27INV /* 0xBF88465C */
  .extern CFD3FIFOSTA27    /* 0xBF884660 */
  .extern CFD3FIFOSTA27CLR /* 0xBF884664 */
  .extern CFD3FIFOSTA27SET /* 0xBF884668 */
  .extern CFD3FIFOSTA27INV /* 0xBF88466C */
  .extern CFD3FIFOUA27     /* 0xBF884670 */
  .extern CFD3FIFOUA27CLR  /* 0xBF884674 */
  .extern CFD3FIFOUA27SET  /* 0xBF884678 */
  .extern CFD3FIFOUA27INV  /* 0xBF88467C */
  .extern CFD3FIFOCON28    /* 0xBF884680 */
  .extern CFD3FIFOCON28CLR /* 0xBF884684 */
  .extern CFD3FIFOCON28SET /* 0xBF884688 */
  .extern CFD3FIFOCON28INV /* 0xBF88468C */
  .extern CFD3FIFOSTA28    /* 0xBF884690 */
  .extern CFD3FIFOSTA28CLR /* 0xBF884694 */
  .extern CFD3FIFOSTA28SET /* 0xBF884698 */
  .extern CFD3FIFOSTA28INV /* 0xBF88469C */
  .extern CFD3FIFOUA28     /* 0xBF8846A0 */
  .extern CFD3FIFOUA28CLR  /* 0xBF8846A4 */
  .extern CFD3FIFOUA28SET  /* 0xBF8846A8 */
  .extern CFD3FIFOUA28INV  /* 0xBF8846AC */
  .extern CFD3FIFOCON29    /* 0xBF8846B0 */
  .extern CFD3FIFOCON29CLR /* 0xBF8846B4 */
  .extern CFD3FIFOCON29SET /* 0xBF8846B8 */
  .extern CFD3FIFOCON29INV /* 0xBF8846BC */
  .extern CFD3FIFOSTA29    /* 0xBF8846C0 */
  .extern CFD3FIFOSTA29CLR /* 0xBF8846C4 */
  .extern CFD3FIFOSTA29SET /* 0xBF8846C8 */
  .extern CFD3FIFOSTA29INV /* 0xBF8846CC */
  .extern CFD3FIFOUA29     /* 0xBF8846D0 */
  .extern CFD3FIFOUA29CLR  /* 0xBF8846D4 */
  .extern CFD3FIFOUA29SET  /* 0xBF8846D8 */
  .extern CFD3FIFOUA29INV  /* 0xBF8846DC */
  .extern CFD3FIFOCON30    /* 0xBF8846E0 */
  .extern CFD3FIFOCON30CLR /* 0xBF8846E4 */
  .extern CFD3FIFOCON30SET /* 0xBF8846E8 */
  .extern CFD3FIFOCON30INV /* 0xBF8846EC */
  .extern CFD3FIFOSTA30    /* 0xBF8846F0 */
  .extern CFD3FIFOSTA30CLR /* 0xBF8846F4 */
  .extern CFD3FIFOSTA30SET /* 0xBF8846F8 */
  .extern CFD3FIFOSTA30INV /* 0xBF8846FC */
  .extern CFD3FIFOUA30     /* 0xBF884700 */
  .extern CFD3FIFOUA30CLR  /* 0xBF884704 */
  .extern CFD3FIFOUA30SET  /* 0xBF884708 */
  .extern CFD3FIFOUA30INV  /* 0xBF88470C */
  .extern CFD3FIFOCON31    /* 0xBF884710 */
  .extern CFD3FIFOCON31CLR /* 0xBF884714 */
  .extern CFD3FIFOCON31SET /* 0xBF884718 */
  .extern CFD3FIFOCON31INV /* 0xBF88471C */
  .extern CFD3FIFOSTA31    /* 0xBF884720 */
  .extern CFD3FIFOSTA31CLR /* 0xBF884724 */
  .extern CFD3FIFOSTA31SET /* 0xBF884728 */
  .extern CFD3FIFOSTA31INV /* 0xBF88472C */
  .extern CFD3FIFOUA31     /* 0xBF884730 */
  .extern CFD3FIFOUA31CLR  /* 0xBF884734 */
  .extern CFD3FIFOUA31SET  /* 0xBF884738 */
  .extern CFD3FIFOUA31INV  /* 0xBF88473C */
  .extern CFD3FLTCON0      /* 0xBF884740 */
  .extern CFD3FLTCON0CLR   /* 0xBF884744 */
  .extern CFD3FLTCON0SET   /* 0xBF884748 */
  .extern CFD3FLTCON0INV   /* 0xBF88474C */
  .extern CFD3FLTCON1      /* 0xBF884750 */
  .extern CFD3FLTCON1CLR   /* 0xBF884754 */
  .extern CFD3FLTCON1SET   /* 0xBF884758 */
  .extern CFD3FLTCON1INV   /* 0xBF88475C */
  .extern CFD3FLTCON2      /* 0xBF884760 */
  .extern CFD3FLTCON2CLR   /* 0xBF884764 */
  .extern CFD3FLTCON2SET   /* 0xBF884768 */
  .extern CFD3FLTCON2INV   /* 0xBF88476C */
  .extern CFD3FLTCON3      /* 0xBF884770 */
  .extern CFD3FLTCON3CLR   /* 0xBF884774 */
  .extern CFD3FLTCON3SET   /* 0xBF884778 */
  .extern CFD3FLTCON3INV   /* 0xBF88477C */
  .extern CFD3FLTCON4      /* 0xBF884780 */
  .extern CFD3FLTCON4CLR   /* 0xBF884784 */
  .extern CFD3FLTCON4SET   /* 0xBF884788 */
  .extern CFD3FLTCON4INV   /* 0xBF88478C */
  .extern CFD3FLTCON5      /* 0xBF884790 */
  .extern CFD3FLTCON5CLR   /* 0xBF884794 */
  .extern CFD3FLTCON5SET   /* 0xBF884798 */
  .extern CFD3FLTCON5INV   /* 0xBF88479C */
  .extern CFD3FLTCON6      /* 0xBF8847A0 */
  .extern CFD3FLTCON6CLR   /* 0xBF8847A4 */
  .extern CFD3FLTCON6SET   /* 0xBF8847A8 */
  .extern CFD3FLTCON6INV   /* 0xBF8847AC */
  .extern CFD3FLTCON7      /* 0xBF8847B0 */
  .extern CFD3FLTCON7CLR   /* 0xBF8847B4 */
  .extern CFD3FLTCON7SET   /* 0xBF8847B8 */
  .extern CFD3FLTCON7INV   /* 0xBF8847BC */
  .extern CFD3FLTOBJ0      /* 0xBF8847C0 */
  .extern CFD3FLTOBJ0CLR   /* 0xBF8847C4 */
  .extern CFD3FLTOBJ0SET   /* 0xBF8847C8 */
  .extern CFD3FLTOBJ0INV   /* 0xBF8847CC */
