Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern CFD3MASK0        /* 0xBF8847D0 */
  .extern CFD3MASK0CLR     /* 0xBF8847D4 */
  .extern CFD3MASK0SET     /* 0xBF8847D8 */
  .extern CFD3MASK0INV     /* 0xBF8847DC */
  .extern CFD3FLTOBJ1      /* 0xBF8847E0 */
  .extern CFD3FLTOBJ1CLR   /* 0xBF8847E4 */
  .extern CFD3FLTOBJ1SET   /* 0xBF8847E8 */
  .extern CFD3FLTOBJ1INV   /* 0xBF8847EC */
  .extern CFD3MASK1        /* 0xBF8847F0 */
  .extern CFD3MASK1CLR     /* 0xBF8847F4 */
  .extern CFD3MASK1SET     /* 0xBF8847F8 */
  .extern CFD3MASK1INV     /* 0xBF8847FC */
  .extern CFD3FLTOBJ2      /* 0xBF884800 */
  .extern CFD3FLTOBJ2CLR   /* 0xBF884804 */
  .extern CFD3FLTOBJ2SET   /* 0xBF884808 */
  .extern CFD3FLTOBJ2INV   /* 0xBF88480C */
  .extern CFD3MASK2        /* 0xBF884810 */
  .extern CFD3MASK2CLR     /* 0xBF884814 */
  .extern CFD3MASK2SET     /* 0xBF884818 */
  .extern CFD3MASK2INV     /* 0xBF88481C */
  .extern CFD3FLTOBJ3      /* 0xBF884820 */
  .extern CFD3FLTOBJ3CLR   /* 0xBF884824 */
  .extern CFD3FLTOBJ3SET   /* 0xBF884828 */
  .extern CFD3FLTOBJ3INV   /* 0xBF88482C */
  .extern CFD3MASK3        /* 0xBF884830 */
  .extern CFD3MASK3CLR     /* 0xBF884834 */
  .extern CFD3MASK3SET     /* 0xBF884838 */
  .extern CFD3MASK3INV     /* 0xBF88483C */
  .extern CFD3FLTOBJ4      /* 0xBF884840 */
  .extern CFD3FLTOBJ4CLR   /* 0xBF884844 */
  .extern CFD3FLTOBJ4SET   /* 0xBF884848 */
  .extern CFD3FLTOBJ4INV   /* 0xBF88484C */
  .extern CFD3MASK4        /* 0xBF884850 */
  .extern CFD3MASK4CLR     /* 0xBF884854 */
  .extern CFD3MASK4SET     /* 0xBF884858 */
  .extern CFD3MASK4INV     /* 0xBF88485C */
  .extern CFD3FLTOBJ5      /* 0xBF884860 */
  .extern CFD3FLTOBJ5CLR   /* 0xBF884864 */
  .extern CFD3FLTOBJ5SET   /* 0xBF884868 */
  .extern CFD3FLTOBJ5INV   /* 0xBF88486C */
  .extern CFD3MASK5        /* 0xBF884870 */
  .extern CFD3MASK5CLR     /* 0xBF884874 */
  .extern CFD3MASK5SET     /* 0xBF884878 */
  .extern CFD3MASK5INV     /* 0xBF88487C */
  .extern CFD3FLTOBJ6      /* 0xBF884880 */
  .extern CFD3FLTOBJ6CLR   /* 0xBF884884 */
  .extern CFD3FLTOBJ6SET   /* 0xBF884888 */
  .extern CFD3FLTOBJ6INV   /* 0xBF88488C */
  .extern CFD3MASK6        /* 0xBF884890 */
  .extern CFD3MASK6CLR     /* 0xBF884894 */
  .extern CFD3MASK6SET     /* 0xBF884898 */
  .extern CFD3MASK6INV     /* 0xBF88489C */
  .extern CFD3FLTOBJ7      /* 0xBF8848A0 */
  .extern CFD3FLTOBJ7CLR   /* 0xBF8848A4 */
  .extern CFD3FLTOBJ7SET   /* 0xBF8848A8 */
  .extern CFD3FLTOBJ7INV   /* 0xBF8848AC */
  .extern CFD3MASK7        /* 0xBF8848B0 */
  .extern CFD3MASK7CLR     /* 0xBF8848B4 */
  .extern CFD3MASK7SET     /* 0xBF8848B8 */
  .extern CFD3FLTOBJ8      /* 0xBF8848C0 */
  .extern CFD3FLTOBJ8CLR   /* 0xBF8848C4 */
  .extern CFD3FLTOBJ8SET   /* 0xBF8848C8 */
  .extern CFD3FLTOBJ8INV   /* 0xBF8848CC */
  .extern CFD3MASK8        /* 0xBF8848D0 */
  .extern CFD3MASK8CLR     /* 0xBF8848D4 */
  .extern CFD3MASK8SET     /* 0xBF8848D8 */
  .extern CFD3MASK8INV     /* 0xBF8848DC */
  .extern CFD3FLTOBJ9      /* 0xBF8848E0 */
  .extern CFD3FLTOBJ9CLR   /* 0xBF8848E4 */
  .extern CFD3FLTOBJ9SET   /* 0xBF8848E8 */
  .extern CFD3FLTOBJ9INV   /* 0xBF8848EC */
  .extern CFD3MASK9        /* 0xBF8848F0 */
  .extern CFD3MASK9CLR     /* 0xBF8848F4 */
  .extern CFD3MASK9SET     /* 0xBF8848F8 */
  .extern CFD3MASK9INV     /* 0xBF8848FC */
  .extern CFD3FLTOBJ10     /* 0xBF884900 */
  .extern CFD3FLTOBJ10CLR  /* 0xBF884904 */
  .extern CFD3FLTOBJ10SET  /* 0xBF884908 */
  .extern CFD3FLTOBJ10INV  /* 0xBF88490C */
  .extern CFD3MASK10       /* 0xBF884910 */
  .extern CFD3MASK10CLR    /* 0xBF884914 */
  .extern CFD3MASK10SET    /* 0xBF884918 */
  .extern CFD3MASK10INV    /* 0xBF88491C */
  .extern CFD3FLTOBJ11     /* 0xBF884920 */
  .extern CFD3FLTOBJ11CLR  /* 0xBF884924 */
  .extern CFD3FLTOBJ11SET  /* 0xBF884928 */
  .extern CFD3FLTOBJ11INV  /* 0xBF88492C */
  .extern CFD3MASK11       /* 0xBF884930 */
  .extern CFD3MASK11CLR    /* 0xBF884934 */
  .extern CFD3MASK11SET    /* 0xBF884938 */
  .extern CFD3MASK11INV    /* 0xBF88493C */
  .extern CFD3FLTOBJ12     /* 0xBF884940 */
  .extern CFD3FLTOBJ12CLR  /* 0xBF884944 */
  .extern CFD3FLTOBJ12SET  /* 0xBF884948 */
  .extern CFD3FLTOBJ12INV  /* 0xBF88494C */
  .extern CFD3MASK12       /* 0xBF884950 */
  .extern CFD3MASK12CLR    /* 0xBF884954 */
  .extern CFD3MASK12SET    /* 0xBF884958 */
  .extern CFD3MASK12INV    /* 0xBF88495C */
  .extern CFD3FLTOBJ13     /* 0xBF884960 */
  .extern CFD3FLTOBJ13CLR  /* 0xBF884964 */
  .extern CFD3FLTOBJ13SET  /* 0xBF884968 */
  .extern CFD3FLTOBJ13INV  /* 0xBF88496C */
  .extern CFD3MASK13       /* 0xBF884970 */
  .extern CFD3MASK13CLR    /* 0xBF884974 */
  .extern CFD3MASK13SET    /* 0xBF884978 */
  .extern CFD3MASK13INV    /* 0xBF88497C */
  .extern CFD3FLTOBJ14     /* 0xBF884980 */
  .extern CFD3FLTOBJ14CLR  /* 0xBF884984 */
  .extern CFD3FLTOBJ14SET  /* 0xBF884988 */
  .extern CFD3FLTOBJ14INV  /* 0xBF88498C */
  .extern CFD3MASK14       /* 0xBF884990 */
  .extern CFD3MASK14CLR    /* 0xBF884994 */
  .extern CFD3MASK14SET    /* 0xBF884998 */
  .extern CFD3MASK14INV    /* 0xBF88499C */
  .extern CFD3FLTOBJ15     /* 0xBF8849A0 */
  .extern CFD3FLTOBJ15CLR  /* 0xBF8849A4 */
  .extern CFD3FLTOBJ15SET  /* 0xBF8849A8 */
  .extern CFD3FLTOBJ15INV  /* 0xBF8849AC */
  .extern CFD3MASK15       /* 0xBF8849B0 */
  .extern CFD3MASK15CLR    /* 0xBF8849B4 */
  .extern CFD3MASK15SET    /* 0xBF8849B8 */
  .extern CFD3MASK15INV    /* 0xBF8849BC */
  .extern CFD3FLTOBJ16     /* 0xBF8849C0 */
  .extern CFD3FLTOBJ16CLR  /* 0xBF8849C4 */
  .extern CFD3FLTOBJ16SET  /* 0xBF8849C8 */
  .extern CFD3FLTOBJ16INV  /* 0xBF8849CC */
  .extern CFD3MASK16       /* 0xBF8849D0 */
  .extern CFD3MASK16CLR    /* 0xBF8849D4 */
  .extern CFD3MASK16SET    /* 0xBF8849D8 */
  .extern CFD3MASK16INV    /* 0xBF8849DC */
  .extern CFD3FLTOBJ17     /* 0xBF8849E0 */
  .extern CFD3FLTOBJ17CLR  /* 0xBF8849E4 */
  .extern CFD3FLTOBJ17SET  /* 0xBF8849E8 */
  .extern CFD3FLTOBJ17INV  /* 0xBF8849EC */
  .extern CFD3MASK17       /* 0xBF8849F0 */
  .extern CFD3MASK17CLR    /* 0xBF8849F4 */
  .extern CFD3MASK17SET    /* 0xBF8849F8 */
  .extern CFD3MASK17INV    /* 0xBF8849FC */
  .extern CFD3FLTOBJ18     /* 0xBF884A00 */
  .extern CFD3FLTOBJ18CLR  /* 0xBF884A04 */
  .extern CFD3FLTOBJ18SET  /* 0xBF884A08 */
  .extern CFD3FLTOBJ18INV  /* 0xBF884A0C */
  .extern CFD3MASK18       /* 0xBF884A10 */
  .extern CFD3MASK18CLR    /* 0xBF884A14 */
  .extern CFD3MASK18SET    /* 0xBF884A18 */
  .extern CFD3MASK18INV    /* 0xBF884A1C */
  .extern CFD3FLTOBJ19     /* 0xBF884A20 */
  .extern CFD3FLTOBJ19CLR  /* 0xBF884A24 */
  .extern CFD3FLTOBJ19SET  /* 0xBF884A28 */
  .extern CFD3FLTOBJ19INV  /* 0xBF884A2C */
  .extern CFD3MASK19       /* 0xBF884A30 */
  .extern CFD3MASK19CLR    /* 0xBF884A34 */
  .extern CFD3MASK19SET    /* 0xBF884A38 */
  .extern CFD3MASK19INV    /* 0xBF884A3C */
  .extern CFD3FLTOBJ20     /* 0xBF884A40 */
  .extern CFD3FLTOBJ20CLR  /* 0xBF884A44 */
  .extern CFD3FLTOBJ20SET  /* 0xBF884A48 */
  .extern CFD3FLTOBJ20INV  /* 0xBF884A4C */
  .extern CFD3MASK20       /* 0xBF884A50 */
  .extern CFD3MASK20CLR    /* 0xBF884A54 */
  .extern CFD3MASK20SET    /* 0xBF884A58 */
  .extern CFD3MASK20INV    /* 0xBF884A5C */
  .extern CFD3FLTOBJ21     /* 0xBF884A60 */
  .extern CFD3FLTOBJ21CLR  /* 0xBF884A64 */
  .extern CFD3FLTOBJ21SET  /* 0xBF884A68 */
  .extern CFD3FLTOBJ21INV  /* 0xBF884A6C */
  .extern CFD3MASK21       /* 0xBF884A70 */
  .extern CFD3MASK21CLR    /* 0xBF884A74 */
  .extern CFD3MASK21SET    /* 0xBF884A78 */
  .extern CFD3MASK21INV    /* 0xBF884A7C */
  .extern CFD3FLTOBJ22     /* 0xBF884A80 */
  .extern CFD3FLTOBJ22CLR  /* 0xBF884A84 */
  .extern CFD3FLTOBJ22SET  /* 0xBF884A88 */
  .extern CFD3FLTOBJ22INV  /* 0xBF884A8C */
  .extern CFD3MASK22       /* 0xBF884A90 */
  .extern CFD3MASK22CLR    /* 0xBF884A94 */
  .extern CFD3MASK22SET    /* 0xBF884A98 */
  .extern CFD3MASK22INV    /* 0xBF884A9C */
  .extern CFD3FLTOBJ23     /* 0xBF884AA0 */
  .extern CFD3FLTOBJ23CLR  /* 0xBF884AA4 */
  .extern CFD3FLTOBJ23SET  /* 0xBF884AA8 */
  .extern CFD3FLTOBJ23INV  /* 0xBF884AAC */
  .extern CFD3MASK23       /* 0xBF884AB0 */
  .extern CFD3MASK23CLR    /* 0xBF884AB4 */
  .extern CFD3MASK23SET    /* 0xBF884AB8 */
  .extern CFD3MASK23INV    /* 0xBF884ABC */
  .extern CFD3FLTOBJ24     /* 0xBF884AC0 */
  .extern CFD3FLTOBJ24CLR  /* 0xBF884AC4 */
  .extern CFD3FLTOBJ24SET  /* 0xBF884AC8 */
  .extern CFD3FLTOBJ24INV  /* 0xBF884ACC */
  .extern CFD3MASK24       /* 0xBF884AD0 */
  .extern CFD3MASK24CLR    /* 0xBF884AD4 */
  .extern CFD3MASK24SET    /* 0xBF884AD8 */
  .extern CFD3MASK24INV    /* 0xBF884ADC */
  .extern CFD3FLTOBJ25     /* 0xBF884AE0 */
  .extern CFD3FLTOBJ25CLR  /* 0xBF884AE4 */
  .extern CFD3FLTOBJ25SET  /* 0xBF884AE8 */
  .extern CFD3FLTOBJ25INV  /* 0xBF884AEC */
  .extern CFD3MASK25       /* 0xBF884AF0 */
  .extern CFD3MASK25CLR    /* 0xBF884AF4 */
  .extern CFD3MASK25SET    /* 0xBF884AF8 */
  .extern CFD3MASK25INV    /* 0xBF884AFC */
  .extern CFD3FLTOBJ26     /* 0xBF884B00 */
  .extern CFD3FLTOBJ26CLR  /* 0xBF884B04 */
  .extern CFD3FLTOBJ26SET  /* 0xBF884B08 */
  .extern CFD3FLTOBJ26INV  /* 0xBF884B0C */
  .extern CFD3MASK26       /* 0xBF884B10 */
  .extern CFD3MASK26CLR    /* 0xBF884B14 */
  .extern CFD3MASK26SET    /* 0xBF884B18 */
  .extern CFD3MASK26INV    /* 0xBF884B1C */
  .extern CFD3FLTOBJ27     /* 0xBF884B20 */
  .extern CFD3FLTOBJ27CLR  /* 0xBF884B24 */
  .extern CFD3FLTOBJ27SET  /* 0xBF884B28 */
  .extern CFD3FLTOBJ27INV  /* 0xBF884B2C */
  .extern CFD3MASK27       /* 0xBF884B30 */
  .extern CFD3MASK27CLR    /* 0xBF884B34 */
  .extern CFD3MASK27SET    /* 0xBF884B38 */
  .extern CFD3MASK27INV    /* 0xBF884B3C */
  .extern CFD3FLTOBJ28     /* 0xBF884B40 */
  .extern CFD3FLTOBJ28CLR  /* 0xBF884B44 */
  .extern CFD3FLTOBJ28SET  /* 0xBF884B48 */
  .extern CFD3FLTOBJ28INV  /* 0xBF884B4C */
  .extern CFD3MASK28       /* 0xBF884B50 */
  .extern CFD3MASK28CLR    /* 0xBF884B54 */
  .extern CFD3MASK28SET    /* 0xBF884B58 */
  .extern CFD3MASK28INV    /* 0xBF884B5C */
  .extern CFD3FLTOBJ29     /* 0xBF884B60 */
  .extern CFD3FLTOBJ29CLR  /* 0xBF884B64 */
  .extern CFD3FLTOBJ29SET  /* 0xBF884B68 */
  .extern CFD3FLTOBJ29INV  /* 0xBF884B6C */
  .extern CFD3MASK29       /* 0xBF884B70 */
  .extern CFD3MASK29CLR    /* 0xBF884B74 */
  .extern CFD3MASK29SET    /* 0xBF884B78 */
  .extern CFD3MASK29INV    /* 0xBF884B7C */
  .extern CFD3FLTOBJ30     /* 0xBF884B80 */
  .extern CFD3FLTOBJ30CLR  /* 0xBF884B84 */
  .extern CFD3FLTOBJ30SET  /* 0xBF884B88 */
  .extern CFD3FLTOBJ30INV  /* 0xBF884B8C */
  .extern CFD3MASK30       /* 0xBF884B90 */
  .extern CFD3MASK30CLR    /* 0xBF884B94 */
  .extern CFD3MASK30SET    /* 0xBF884B98 */
  .extern CFD3MASK30INV    /* 0xBF884B9C */
  .extern CFD3FLTOBJ31     /* 0xBF884BA0 */
  .extern CFD3FLTOBJ31CLR  /* 0xBF884BA4 */
  .extern CFD3FLTOBJ31SET  /* 0xBF884BA8 */
  .extern CFD3FLTOBJ31INV  /* 0xBF884BAC */
  .extern CFD3MASK31       /* 0xBF884BB0 */
  .extern CFD3MASK31CLR    /* 0xBF884BB4 */
  .extern CFD3MASK31SET    /* 0xBF884BB8 */
  .extern CFD3MASK31INV    /* 0xBF884BBC */
  .extern CFD4CON          /* 0xBF885000 */
  .extern CFD4CONCLR       /* 0xBF885004 */
  .extern CFD4CONSET       /* 0xBF885008 */
  .extern CFD4CONINV       /* 0xBF88500C */
  .extern CFD4NBTCFG       /* 0xBF885010 */
  .extern CFD4NBTCFGCLR    /* 0xBF885014 */
  .extern CFD4NBTCFGSET    /* 0xBF885018 */
  .extern CFD4NBTCFGINV    /* 0xBF88501C */
  .extern CFD4DBTCFG       /* 0xBF885020 */
  .extern CFD4DBTCFGCLR    /* 0xBF885024 */
  .extern CFD4DBTCFGSET    /* 0xBF885028 */
  .extern CFD4DBTCFGINV    /* 0xBF88502C */
  .extern CFD4TDC          /* 0xBF885030 */
  .extern CFD4TDCCLR       /* 0xBF885034 */
  .extern CFD4TDCSET       /* 0xBF885038 */
  .extern CFD4TDCINV       /* 0xBF88503C */
  .extern CFD4TBC          /* 0xBF885040 */
  .extern CFD4TBCCLR       /* 0xBF885044 */
  .extern CFD4TBCSET       /* 0xBF885048 */
  .extern CFD4TBCINV       /* 0xBF88504C */
  .extern CFD4TSCON        /* 0xBF885050 */
  .extern CFD4TSCONCLR     /* 0xBF885054 */
  .extern CFD4TSCONSET     /* 0xBF885058 */
  .extern CFD4TSCONINV     /* 0xBF88505C */
  .extern CFD4VEC          /* 0xBF885060 */
  .extern CFD4VECCLR       /* 0xBF885064 */
  .extern CFD4VECSET       /* 0xBF885068 */
  .extern CFD4VECINV       /* 0xBF88506C */
  .extern CFD4INT          /* 0xBF885070 */
  .extern CFD4INTCLR       /* 0xBF885074 */
  .extern CFD4INTSET       /* 0xBF885078 */
  .extern CFD4INTINV       /* 0xBF88507C */
  .extern CFD4RXIF         /* 0xBF885080 */
  .extern CFD4RXIFCLR      /* 0xBF885084 */
  .extern CFD4RXIFSET      /* 0xBF885088 */
  .extern CFD4RXIFINV      /* 0xBF88508C */
  .extern CFD4TXIF         /* 0xBF885090 */
  .extern CFD4TXIFCLR      /* 0xBF885094 */
  .extern CFD4TXIFSET      /* 0xBF885098 */
  .extern CFD4TXIFINV      /* 0xBF88509C */
  .extern CFD4RXOVIF       /* 0xBF8850A0 */
  .extern CFD4RXOVIFCLR    /* 0xBF8850A4 */
  .extern CFD4RXOVIFSET    /* 0xBF8850A8 */
  .extern CFD4RXOVIFINV    /* 0xBF8850AC */
  .extern CFD4TXATIF       /* 0xBF8850B0 */
  .extern CFD4TXATIFCLR    /* 0xBF8850B4 */
  .extern CFD4TXATIFSET    /* 0xBF8850B8 */
  .extern CFD4TXATIFINV    /* 0xBF8850BC */
  .extern CFD4TXREQ        /* 0xBF8850C0 */
  .extern CFD4TXREQCLR     /* 0xBF8850C4 */
  .extern CFD4TXREQSET     /* 0xBF8850C8 */
  .extern CFD4TXREQINV     /* 0xBF8850CC */
  .extern CFD4TREC         /* 0xBF8850D0 */
  .extern CFD4TRECCLR      /* 0xBF8850D4 */
  .extern CFD4TRECSET      /* 0xBF8850D8 */
  .extern CFD4TRECINV      /* 0xBF8850DC */
  .extern CFD4BDIAG0       /* 0xBF8850E0 */
  .extern CFD4BDIAG0CLR    /* 0xBF8850E4 */
  .extern CFD4BDIAG0SET    /* 0xBF8850E8 */
  .extern CFD4BDIAG0INV    /* 0xBF8850EC */
  .extern CFD4BDIAG1       /* 0xBF8850F0 */
  .extern CFD4BDIAG1CLR    /* 0xBF8850F4 */
  .extern CFD4BDIAG1SET    /* 0xBF8850F8 */
  .extern CFD4BDIAG1INV    /* 0xBF8850FC */
  .extern CFD4TEFCON       /* 0xBF885100 */
  .extern CFD4TEFCONCLR    /* 0xBF885104 */
  .extern CFD4TEFCONSET    /* 0xBF885108 */
  .extern CFD4TEFCONINV    /* 0xBF88510C */
  .extern CFD4TEFSTA       /* 0xBF885110 */
  .extern CFD4TEFSTACLR    /* 0xBF885114 */
  .extern CFD4TEFSTASET    /* 0xBF885118 */
  .extern CFD4TEFSTAINV    /* 0xBF88511C */
  .extern CFD4TEFUA        /* 0xBF885120 */
  .extern CFD4TEFUACLR     /* 0xBF885124 */
  .extern CFD4TEFUASET     /* 0xBF885128 */
  .extern CFD4TEFUAINV     /* 0xBF88512C */
  .extern CFD4FIFOBA       /* 0xBF885130 */
  .extern CFD4FIFOBACLR    /* 0xBF885134 */
  .extern CFD4FIFOBASET    /* 0xBF885138 */
  .extern CFD4FIFOBAINV    /* 0xBF88513C */
  .extern CFD4TXQCON       /* 0xBF885140 */
  .extern CFD4TXQCONCLR    /* 0xBF885144 */
  .extern CFD4TXQCONSET    /* 0xBF885148 */
  .extern CFD4TXQCONINV    /* 0xBF88514C */
  .extern CFD4TXQSTA       /* 0xBF885150 */
  .extern CFD4TXQSTACLR    /* 0xBF885154 */
  .extern CFD4TXQSTASET    /* 0xBF885158 */
  .extern CFD4TXQSTAINV    /* 0xBF88515C */
  .extern CFD4TXQUA        /* 0xBF885160 */
  .extern CFD4TXQUACLR     /* 0xBF885164 */
  .extern CFD4TXQUASET     /* 0xBF885168 */
  .extern CFD4TXQUAINV     /* 0xBF88516C */
  .extern CFD4FIFOCON1     /* 0xBF885170 */
  .extern CFD4FIFOCON1CLR  /* 0xBF885174 */
  .extern CFD4FIFOCON1SET  /* 0xBF885178 */
  .extern CFD4FIFOCON1INV  /* 0xBF88517C */
  .extern CFD4FIFOSTA1     /* 0xBF885180 */
  .extern CFD4FIFOSTA1CLR  /* 0xBF885184 */
  .extern CFD4FIFOSTA1SET  /* 0xBF885188 */
  .extern CFD4FIFOSTA1INV  /* 0xBF88518C */
  .extern CFD4FIFOUA1      /* 0xBF885190 */
  .extern CFD4FIFOUA1CLR   /* 0xBF885194 */
  .extern CFD4FIFOUA1SET   /* 0xBF885198 */
  .extern CFD4FIFOUA1INV   /* 0xBF88519C */
  .extern CFD4FIFOCON2     /* 0xBF8851A0 */
  .extern CFD4FIFOCON2CLR  /* 0xBF8851A4 */
  .extern CFD4FIFOCON2SET  /* 0xBF8851A8 */
  .extern CFD4FIFOCON2INV  /* 0xBF8851AC */
  .extern CFD4FIFOSTA2     /* 0xBF8851B0 */
  .extern CFD4FIFOSTA2CLR  /* 0xBF8851B4 */
  .extern CFD4FIFOSTA2SET  /* 0xBF8851B8 */
  .extern CFD4FIFOSTA2INV  /* 0xBF8851BC */
  .extern CFD4FIFOUA2      /* 0xBF8851C0 */
  .extern CFD4FIFOUA2CLR   /* 0xBF8851C4 */
  .extern CFD4FIFOUA2SET   /* 0xBF8851C8 */
  .extern CFD4FIFOUA2INV   /* 0xBF8851CC */
  .extern CFD4FIFOCON3     /* 0xBF8851D0 */
  .extern CFD4FIFOCON3CLR  /* 0xBF8851D4 */
  .extern CFD4FIFOCON3SET  /* 0xBF8851D8 */
  .extern CFD4FIFOCON3INV  /* 0xBF8851DC */
  .extern CFD4FIFOSTA3     /* 0xBF8851E0 */
  .extern CFD4FIFOSTA3CLR  /* 0xBF8851E4 */
  .extern CFD4FIFOSTA3SET  /* 0xBF8851E8 */
  .extern CFD4FIFOSTA3INV  /* 0xBF8851EC */
  .extern CFD4FIFOUA3      /* 0xBF8851F0 */
  .extern CFD4FIFOUA3CLR   /* 0xBF8851F4 */
  .extern CFD4FIFOUA3SET   /* 0xBF8851F8 */
  .extern CFD4FIFOUA3INV   /* 0xBF8851FC */
  .extern CFD4FIFOCON4     /* 0xBF885200 */
  .extern CFD4FIFOCON4CLR  /* 0xBF885204 */
  .extern CFD4FIFOCON4SET  /* 0xBF885208 */
  .extern CFD4FIFOCON4INV  /* 0xBF88520C */
  .extern CFD4FIFOSTA4     /* 0xBF885210 */
  .extern CFD4FIFOSTA4CLR  /* 0xBF885214 */
  .extern CFD4FIFOSTA4SET  /* 0xBF885218 */
  .extern CFD4FIFOSTA4INV  /* 0xBF88521C */
  .extern CFD4FIFOUA4      /* 0xBF885220 */
  .extern CFD4FIFOUA4CLR   /* 0xBF885224 */
  .extern CFD4FIFOUA4SET   /* 0xBF885228 */
  .extern CFD4FIFOUA4INV   /* 0xBF88522C */
  .extern CFD4FIFOCON5     /* 0xBF885230 */
  .extern CFD4FIFOCON5CLR  /* 0xBF885234 */
  .extern CFD4FIFOCON5SET  /* 0xBF885238 */
  .extern CFD4FIFOCON5INV  /* 0xBF88523C */
  .extern CFD4FIFOSTA5     /* 0xBF885240 */
  .extern CFD4FIFOSTA5CLR  /* 0xBF885244 */
  .extern CFD4FIFOSTA5SET  /* 0xBF885248 */
  .extern CFD4FIFOSTA5INV  /* 0xBF88524C */
  .extern CFD4FIFOUA5      /* 0xBF885250 */
  .extern CFD4FIFOUA5CLR   /* 0xBF885254 */
  .extern CFD4FIFOUA5SET   /* 0xBF885258 */
  .extern CFD4FIFOUA5INV   /* 0xBF88525C */
  .extern CFD4FIFOCON6     /* 0xBF885260 */
  .extern CFD4FIFOCON6CLR  /* 0xBF885264 */
  .extern CFD4FIFOCON6SET  /* 0xBF885268 */
  .extern CFD4FIFOCON6INV  /* 0xBF88526C */
  .extern CFD4FIFOSTA6     /* 0xBF885270 */
  .extern CFD4FIFOSTA6CLR  /* 0xBF885274 */
  .extern CFD4FIFOSTA6SET  /* 0xBF885278 */
  .extern CFD4FIFOSTA6INV  /* 0xBF88527C */
  .extern CFD4FIFOUA6      /* 0xBF885280 */
  .extern CFD4FIFOUA6CLR   /* 0xBF885284 */
  .extern CFD4FIFOUA6SET   /* 0xBF885288 */
  .extern CFD4FIFOUA6INV   /* 0xBF88528C */
  .extern CFD4FIFOCON7     /* 0xBF885290 */
  .extern CFD4FIFOCON7CLR  /* 0xBF885294 */
  .extern CFD4FIFOCON7SET  /* 0xBF885298 */
  .extern CFD4FIFOCON7INV  /* 0xBF88529C */
  .extern CFD4FIFOSTA7     /* 0xBF8852A0 */
  .extern CFD4FIFOSTA7CLR  /* 0xBF8852A4 */
  .extern CFD4FIFOSTA7SET  /* 0xBF8852A8 */
  .extern CFD4FIFOSTA7INV  /* 0xBF8852AC */
  .extern CFD4FIFOUA7      /* 0xBF8852B0 */
  .extern CFD4FIFOUA7CLR   /* 0xBF8852B4 */
  .extern CFD4FIFOUA7SET   /* 0xBF8852B8 */
  .extern CFD4FIFOUA7INV   /* 0xBF8852BC */
  .extern CFD4FIFOCON8     /* 0xBF8852C0 */
  .extern CFD4FIFOCON8CLR  /* 0xBF8852C4 */
  .extern CFD4FIFOCON8SET  /* 0xBF8852C8 */
  .extern CFD4FIFOCON8INV  /* 0xBF8852CC */
  .extern CFD4FIFOSTA8     /* 0xBF8852D0 */
  .extern CFD4FIFOSTA8CLR  /* 0xBF8852D4 */
  .extern CFD4FIFOSTA8SET  /* 0xBF8852D8 */
  .extern CFD4FIFOSTA8INV  /* 0xBF8852DC */
  .extern CFD4FIFOUA8      /* 0xBF8852E0 */
  .extern CFD4FIFOUA8CLR   /* 0xBF8852E4 */
  .extern CFD4FIFOUA8SET   /* 0xBF8852E8 */
  .extern CFD4FIFOUA8INV   /* 0xBF8852EC */
  .extern CFD4FIFOCON9     /* 0xBF8852F0 */
  .extern CFD4FIFOCON9CLR  /* 0xBF8852F4 */
  .extern CFD4FIFOCON9SET  /* 0xBF8852F8 */
  .extern CFD4FIFOCON9INV  /* 0xBF8852FC */
  .extern CFD4FIFOSTA9     /* 0xBF885300 */
  .extern CFD4FIFOSTA9CLR  /* 0xBF885304 */
  .extern CFD4FIFOSTA9SET  /* 0xBF885308 */
  .extern CFD4FIFOSTA9INV  /* 0xBF88530C */
  .extern CFD4FIFOUA9      /* 0xBF885310 */
  .extern CFD4FIFOUA9CLR   /* 0xBF885314 */
  .extern CFD4FIFOUA9SET   /* 0xBF885318 */
  .extern CFD4FIFOUA9INV   /* 0xBF88531C */
  .extern CFD4FIFOCON10    /* 0xBF885320 */
  .extern CFD4FIFOCON10CLR /* 0xBF885324 */
  .extern CFD4FIFOCON10SET /* 0xBF885328 */
  .extern CFD4FIFOCON10INV /* 0xBF88532C */
  .extern CFD4FIFOSTA10    /* 0xBF885330 */
  .extern CFD4FIFOSTA10CLR /* 0xBF885334 */
  .extern CFD4FIFOSTA10SET /* 0xBF885338 */
  .extern CFD4FIFOSTA10INV /* 0xBF88533C */
  .extern CFD4FIFOUA10     /* 0xBF885340 */
  .extern CFD4FIFOUA10CLR  /* 0xBF885344 */
  .extern CFD4FIFOUA10SET  /* 0xBF885348 */
  .extern CFD4FIFOUA10INV  /* 0xBF88534C */
  .extern CFD4FIFOCON11    /* 0xBF885350 */
  .extern CFD4FIFOCON11CLR /* 0xBF885354 */
  .extern CFD4FIFOCON11SET /* 0xBF885358 */
  .extern CFD4FIFOCON11INV /* 0xBF88535C */
  .extern CFD4FIFOSTA11    /* 0xBF885360 */
  .extern CFD4FIFOSTA11CLR /* 0xBF885364 */
  .extern CFD4FIFOSTA11SET /* 0xBF885368 */
  .extern CFD4FIFOSTA11INV /* 0xBF88536C */
  .extern CFD4FIFOUA11     /* 0xBF885370 */
  .extern CFD4FIFOUA11CLR  /* 0xBF885374 */
  .extern CFD4FIFOUA11SET  /* 0xBF885378 */
  .extern CFD4FIFOUA11INV  /* 0xBF88537C */
  .extern CFD4FIFOCON12    /* 0xBF885380 */
  .extern CFD4FIFOCON12CLR /* 0xBF885384 */
  .extern CFD4FIFOCON12SET /* 0xBF885388 */
  .extern CFD4FIFOCON12INV /* 0xBF88538C */
  .extern CFD4FIFOSTA12    /* 0xBF885390 */
  .extern CFD4FIFOSTA12CLR /* 0xBF885394 */
  .extern CFD4FIFOSTA12SET /* 0xBF885398 */
  .extern CFD4FIFOSTA12INV /* 0xBF88539C */
  .extern CFD4FIFOUA12     /* 0xBF8853A0 */
  .extern CFD4FIFOUA12CLR  /* 0xBF8853A4 */
  .extern CFD4FIFOUA12SET  /* 0xBF8853A8 */
  .extern CFD4FIFOUA12INV  /* 0xBF8853AC */
  .extern CFD4FIFOCON13    /* 0xBF8853B0 */
  .extern CFD4FIFOCON13CLR /* 0xBF8853B4 */
  .extern CFD4FIFOCON13SET /* 0xBF8853B8 */
  .extern CFD4FIFOCON13INV /* 0xBF8853BC */
  .extern CFD4FIFOSTA13    /* 0xBF8853C0 */
  .extern CFD4FIFOSTA13CLR /* 0xBF8853C4 */
  .extern CFD4FIFOSTA13SET /* 0xBF8853C8 */
  .extern CFD4FIFOSTA13INV /* 0xBF8853CC */
  .extern CFD4FIFOUA13     /* 0xBF8853D0 */
  .extern CFD4FIFOUA13CLR  /* 0xBF8853D4 */
  .extern CFD4FIFOUA13SET  /* 0xBF8853D8 */
  .extern CFD4FIFOUA13INV  /* 0xBF8853DC */
  .extern CFD4FIFOCON14    /* 0xBF8853E0 */
  .extern CFD4FIFOCON14CLR /* 0xBF8853E4 */
  .extern CFD4FIFOCON14SET /* 0xBF8853E8 */
  .extern CFD4FIFOCON14INV /* 0xBF8853EC */
  .extern CFD4FIFOSTA14    /* 0xBF8853F0 */
  .extern CFD4FIFOSTA14CLR /* 0xBF8853F4 */
  .extern CFD4FIFOSTA14SET /* 0xBF8853F8 */
  .extern CFD4FIFOSTA14INV /* 0xBF8853FC */
  .extern CFD4FIFOUA14     /* 0xBF885400 */
  .extern CFD4FIFOUA14CLR  /* 0xBF885404 */
  .extern CFD4FIFOUA14SET  /* 0xBF885408 */
  .extern CFD4FIFOUA14INV  /* 0xBF88540C */
  .extern CFD4FIFOCON15    /* 0xBF885410 */
  .extern CFD4FIFOCON15CLR /* 0xBF885414 */
  .extern CFD4FIFOCON15SET /* 0xBF885418 */
  .extern CFD4FIFOCON15INV /* 0xBF88541C */
  .extern CFD4FIFOSTA15    /* 0xBF885420 */
  .extern CFD4FIFOSTA15CLR /* 0xBF885424 */
  .extern CFD4FIFOSTA15SET /* 0xBF885428 */
  .extern CFD4FIFOSTA15INV /* 0xBF88542C */
  .extern CFD4FIFOUA15     /* 0xBF885430 */
  .extern CFD4FIFOUA15CLR  /* 0xBF885434 */
  .extern CFD4FIFOUA15SET  /* 0xBF885438 */
  .extern CFD4FIFOUA15INV  /* 0xBF88543C */
  .extern CFD4FIFOCON16    /* 0xBF885440 */
  .extern CFD4FIFOCON16CLR /* 0xBF885444 */
  .extern CFD4FIFOCON16SET /* 0xBF885448 */
  .extern CFD4FIFOCON16INV /* 0xBF88544C */
  .extern CFD4FIFOSTA16    /* 0xBF885450 */
  .extern CFD4FIFOSTA16CLR /* 0xBF885454 */
  .extern CFD4FIFOSTA16SET /* 0xBF885458 */
  .extern CFD4FIFOSTA16INV /* 0xBF88545C */
  .extern CFD4FIFOUA16     /* 0xBF885460 */
  .extern CFD4FIFOUA16CLR  /* 0xBF885464 */
  .extern CFD4FIFOUA16SET  /* 0xBF885468 */
  .extern CFD4FIFOUA16INV  /* 0xBF88546C */
  .extern CFD4FIFOCON17    /* 0xBF885470 */
  .extern CFD4FIFOCON17CLR /* 0xBF885474 */
  .extern CFD4FIFOCON17SET /* 0xBF885478 */
  .extern CFD4FIFOCON17INV /* 0xBF88547C */
  .extern CFD4FIFOSTA17    /* 0xBF885480 */
  .extern CFD4FIFOSTA17CLR /* 0xBF885484 */
  .extern CFD4FIFOSTA17SET /* 0xBF885488 */
  .extern CFD4FIFOSTA17INV /* 0xBF88548C */
  .extern CFD4FIFOUA17     /* 0xBF885490 */
  .extern CFD4FIFOUA17CLR  /* 0xBF885494 */
