Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern CFD4FIFOUA17SET  /* 0xBF885498 */
  .extern CFD4FIFOUA17INV  /* 0xBF88549C */
  .extern CFD4FIFOCON18    /* 0xBF8854A0 */
  .extern CFD4FIFOCON18CLR /* 0xBF8854A4 */
  .extern CFD4FIFOCON18SET /* 0xBF8854A8 */
  .extern CFD4FIFOCON18INV /* 0xBF8854AC */
  .extern CFD4FIFOSTA18    /* 0xBF8854B0 */
  .extern CFD4FIFOSTA18CLR /* 0xBF8854B4 */
  .extern CFD4FIFOSTA18SET /* 0xBF8854B8 */
  .extern CFD4FIFOSTA18INV /* 0xBF8854BC */
  .extern CFD4FIFOUA18     /* 0xBF8854C0 */
  .extern CFD4FIFOUA18CLR  /* 0xBF8854C4 */
  .extern CFD4FIFOUA18SET  /* 0xBF8854C8 */
  .extern CFD4FIFOUA18INV  /* 0xBF8854CC */
  .extern CFD4FIFOCON19    /* 0xBF8854D0 */
  .extern CFD4FIFOCON19CLR /* 0xBF8854D4 */
  .extern CFD4FIFOCON19SET /* 0xBF8854D8 */
  .extern CFD4FIFOCON19INV /* 0xBF8854DC */
  .extern CFD4FIFOSTA19    /* 0xBF8854E0 */
  .extern CFD4FIFOSTA19CLR /* 0xBF8854E4 */
  .extern CFD4FIFOSTA19SET /* 0xBF8854E8 */
  .extern CFD4FIFOSTA19INV /* 0xBF8854EC */
  .extern CFD4FIFOUA19     /* 0xBF8854F0 */
  .extern CFD4FIFOUA19CLR  /* 0xBF8854F4 */
  .extern CFD4FIFOUA19SET  /* 0xBF8854F8 */
  .extern CFD4FIFOUA19INV  /* 0xBF8854FC */
  .extern CFD4FIFOCON20    /* 0xBF885500 */
  .extern CFD4FIFOCON20CLR /* 0xBF885504 */
  .extern CFD4FIFOCON20SET /* 0xBF885508 */
  .extern CFD4FIFOCON20INV /* 0xBF88550C */
  .extern CFD4FIFOSTA20    /* 0xBF885510 */
  .extern CFD4FIFOSTA20CLR /* 0xBF885514 */
  .extern CFD4FIFOSTA20SET /* 0xBF885518 */
  .extern CFD4FIFOSTA20INV /* 0xBF88551C */
  .extern CFD4FIFOUA20     /* 0xBF885520 */
  .extern CFD4FIFOUA20CLR  /* 0xBF885524 */
  .extern CFD4FIFOUA20SET  /* 0xBF885528 */
  .extern CFD4FIFOUA20INV  /* 0xBF88552C */
  .extern CFD4FIFOCON21    /* 0xBF885530 */
  .extern CFD4FIFOCON21CLR /* 0xBF885534 */
  .extern CFD4FIFOCON21SET /* 0xBF885538 */
  .extern CFD4FIFOCON21INV /* 0xBF88553C */
  .extern CFD4FIFOSTA21    /* 0xBF885540 */
  .extern CFD4FIFOSTA21CLR /* 0xBF885544 */
  .extern CFD4FIFOSTA21SET /* 0xBF885548 */
  .extern CFD4FIFOSTA21INV /* 0xBF88554C */
  .extern CFD4FIFOUA21     /* 0xBF885550 */
  .extern CFD4FIFOUA21CLR  /* 0xBF885554 */
  .extern CFD4FIFOUA21SET  /* 0xBF885558 */
  .extern CFD4FIFOUA21INV  /* 0xBF88555C */
  .extern CFD4FIFOCON22    /* 0xBF885560 */
  .extern CFD4FIFOCON22CLR /* 0xBF885564 */
  .extern CFD4FIFOCON22SET /* 0xBF885568 */
  .extern CFD4FIFOCON22INV /* 0xBF88556C */
  .extern CFD4FIFOSTA22    /* 0xBF885570 */
  .extern CFD4FIFOSTA22CLR /* 0xBF885574 */
  .extern CFD4FIFOSTA22SET /* 0xBF885578 */
  .extern CFD4FIFOSTA22INV /* 0xBF88557C */
  .extern CFD4FIFOUA22     /* 0xBF885580 */
  .extern CFD4FIFOUA22CLR  /* 0xBF885584 */
  .extern CFD4FIFOUA22SET  /* 0xBF885588 */
  .extern CFD4FIFOUA22INV  /* 0xBF88558C */
  .extern CFD4FIFOCON23    /* 0xBF885590 */
  .extern CFD4FIFOCON23CLR /* 0xBF885594 */
  .extern CFD4FIFOCON23SET /* 0xBF885598 */
  .extern CFD4FIFOCON23INV /* 0xBF88559C */
  .extern CFD4FIFOSTA23    /* 0xBF8855A0 */
  .extern CFD4FIFOSTA23CLR /* 0xBF8855A4 */
  .extern CFD4FIFOSTA23SET /* 0xBF8855A8 */
  .extern CFD4FIFOSTA23INV /* 0xBF8855AC */
  .extern CFD4FIFOUA23     /* 0xBF8855B0 */
  .extern CFD4FIFOUA23CLR  /* 0xBF8855B4 */
  .extern CFD4FIFOUA23SET  /* 0xBF8855B8 */
  .extern CFD4FIFOUA23INV  /* 0xBF8855BC */
  .extern CFD4FIFOCON24    /* 0xBF8855C0 */
  .extern CFD4FIFOCON24CLR /* 0xBF8855C4 */
  .extern CFD4FIFOCON24SET /* 0xBF8855C8 */
  .extern CFD4FIFOCON24INV /* 0xBF8855CC */
  .extern CFD4FIFOSTA24    /* 0xBF8855D0 */
  .extern CFD4FIFOSTA24CLR /* 0xBF8855D4 */
  .extern CFD4FIFOSTA24SET /* 0xBF8855D8 */
  .extern CFD4FIFOSTA24INV /* 0xBF8855DC */
  .extern CFD4FIFOUA24     /* 0xBF8855E0 */
  .extern CFD4FIFOUA24CLR  /* 0xBF8855E4 */
  .extern CFD4FIFOUA24SET  /* 0xBF8855E8 */
  .extern CFD4FIFOUA24INV  /* 0xBF8855EC */
  .extern CFD4FIFOCON25    /* 0xBF8855F0 */
  .extern CFD4FIFOCON25CLR /* 0xBF8855F4 */
  .extern CFD4FIFOCON25SET /* 0xBF8855F8 */
  .extern CFD4FIFOCON25INV /* 0xBF8855FC */
  .extern CFD4FIFOSTA25    /* 0xBF885600 */
  .extern CFD4FIFOSTA25CLR /* 0xBF885604 */
  .extern CFD4FIFOSTA25SET /* 0xBF885608 */
  .extern CFD4FIFOSTA25INV /* 0xBF88560C */
  .extern CFD4FIFOUA25     /* 0xBF885610 */
  .extern CFD4FIFOUA25CLR  /* 0xBF885614 */
  .extern CFD4FIFOUA25SET  /* 0xBF885618 */
  .extern CFD4FIFOUA25INV  /* 0xBF88561C */
  .extern CFD4FIFOCON26    /* 0xBF885620 */
  .extern CFD4FIFOCON26CLR /* 0xBF885624 */
  .extern CFD4FIFOCON26SET /* 0xBF885628 */
  .extern CFD4FIFOCON26INV /* 0xBF88562C */
  .extern CFD4FIFOSTA26    /* 0xBF885630 */
  .extern CFD4FIFOSTA26CLR /* 0xBF885634 */
  .extern CFD4FIFOSTA26SET /* 0xBF885638 */
  .extern CFD4FIFOSTA26INV /* 0xBF88563C */
  .extern CFD4FIFOUA26     /* 0xBF885640 */
  .extern CFD4FIFOUA26CLR  /* 0xBF885644 */
  .extern CFD4FIFOUA26SET  /* 0xBF885648 */
  .extern CFD4FIFOUA26INV  /* 0xBF88564C */
  .extern CFD4FIFOCON27    /* 0xBF885650 */
  .extern CFD4FIFOCON27CLR /* 0xBF885654 */
  .extern CFD4FIFOCON27SET /* 0xBF885658 */
  .extern CFD4FIFOCON27INV /* 0xBF88565C */
  .extern CFD4FIFOSTA27    /* 0xBF885660 */
  .extern CFD4FIFOSTA27CLR /* 0xBF885664 */
  .extern CFD4FIFOSTA27SET /* 0xBF885668 */
  .extern CFD4FIFOSTA27INV /* 0xBF88566C */
  .extern CFD4FIFOUA27     /* 0xBF885670 */
  .extern CFD4FIFOUA27CLR  /* 0xBF885674 */
  .extern CFD4FIFOUA27SET  /* 0xBF885678 */
  .extern CFD4FIFOUA27INV  /* 0xBF88567C */
  .extern CFD4FIFOCON28    /* 0xBF885680 */
  .extern CFD4FIFOCON28CLR /* 0xBF885684 */
  .extern CFD4FIFOCON28SET /* 0xBF885688 */
  .extern CFD4FIFOCON28INV /* 0xBF88568C */
  .extern CFD4FIFOSTA28    /* 0xBF885690 */
  .extern CFD4FIFOSTA28CLR /* 0xBF885694 */
  .extern CFD4FIFOSTA28SET /* 0xBF885698 */
  .extern CFD4FIFOSTA28INV /* 0xBF88569C */
  .extern CFD4FIFOUA28     /* 0xBF8856A0 */
  .extern CFD4FIFOUA28CLR  /* 0xBF8856A4 */
  .extern CFD4FIFOUA28SET  /* 0xBF8856A8 */
  .extern CFD4FIFOUA28INV  /* 0xBF8856AC */
  .extern CFD4FIFOCON29    /* 0xBF8856B0 */
  .extern CFD4FIFOCON29CLR /* 0xBF8856B4 */
  .extern CFD4FIFOCON29SET /* 0xBF8856B8 */
  .extern CFD4FIFOCON29INV /* 0xBF8856BC */
  .extern CFD4FIFOSTA29    /* 0xBF8856C0 */
  .extern CFD4FIFOSTA29CLR /* 0xBF8856C4 */
  .extern CFD4FIFOSTA29SET /* 0xBF8856C8 */
  .extern CFD4FIFOSTA29INV /* 0xBF8856CC */
  .extern CFD4FIFOUA29     /* 0xBF8856D0 */
  .extern CFD4FIFOUA29CLR  /* 0xBF8856D4 */
  .extern CFD4FIFOUA29SET  /* 0xBF8856D8 */
  .extern CFD4FIFOUA29INV  /* 0xBF8856DC */
  .extern CFD4FIFOCON30    /* 0xBF8856E0 */
  .extern CFD4FIFOCON30CLR /* 0xBF8856E4 */
  .extern CFD4FIFOCON30SET /* 0xBF8856E8 */
  .extern CFD4FIFOCON30INV /* 0xBF8856EC */
  .extern CFD4FIFOSTA30    /* 0xBF8856F0 */
  .extern CFD4FIFOSTA30CLR /* 0xBF8856F4 */
  .extern CFD4FIFOSTA30SET /* 0xBF8856F8 */
  .extern CFD4FIFOSTA30INV /* 0xBF8856FC */
  .extern CFD4FIFOUA30     /* 0xBF885700 */
  .extern CFD4FIFOUA30CLR  /* 0xBF885704 */
  .extern CFD4FIFOUA30SET  /* 0xBF885708 */
  .extern CFD4FIFOUA30INV  /* 0xBF88570C */
  .extern CFD4FIFOCON31    /* 0xBF885710 */
  .extern CFD4FIFOCON31CLR /* 0xBF885714 */
  .extern CFD4FIFOCON31SET /* 0xBF885718 */
  .extern CFD4FIFOCON31INV /* 0xBF88571C */
  .extern CFD4FIFOSTA31    /* 0xBF885720 */
  .extern CFD4FIFOSTA31CLR /* 0xBF885724 */
  .extern CFD4FIFOSTA31SET /* 0xBF885728 */
  .extern CFD4FIFOSTA31INV /* 0xBF88572C */
  .extern CFD4FIFOUA31     /* 0xBF885730 */
  .extern CFD4FIFOUA31CLR  /* 0xBF885734 */
  .extern CFD4FIFOUA31SET  /* 0xBF885738 */
  .extern CFD4FIFOUA31INV  /* 0xBF88573C */
  .extern CFD4FLTCON0      /* 0xBF885740 */
  .extern CFD4FLTCON0CLR   /* 0xBF885744 */
  .extern CFD4FLTCON0SET   /* 0xBF885748 */
  .extern CFD4FLTCON0INV   /* 0xBF88574C */
  .extern CFD4FLTCON1      /* 0xBF885750 */
  .extern CFD4FLTCON1CLR   /* 0xBF885754 */
  .extern CFD4FLTCON1SET   /* 0xBF885758 */
  .extern CFD4FLTCON1INV   /* 0xBF88575C */
  .extern CFD4FLTCON2      /* 0xBF885760 */
  .extern CFD4FLTCON2CLR   /* 0xBF885764 */
  .extern CFD4FLTCON2SET   /* 0xBF885768 */
  .extern CFD4FLTCON2INV   /* 0xBF88576C */
  .extern CFD4FLTCON3      /* 0xBF885770 */
  .extern CFD4FLTCON3CLR   /* 0xBF885774 */
  .extern CFD4FLTCON3SET   /* 0xBF885778 */
  .extern CFD4FLTCON3INV   /* 0xBF88577C */
  .extern CFD4FLTCON4      /* 0xBF885780 */
  .extern CFD4FLTCON4CLR   /* 0xBF885784 */
  .extern CFD4FLTCON4SET   /* 0xBF885788 */
  .extern CFD4FLTCON4INV   /* 0xBF88578C */
  .extern CFD4FLTCON5      /* 0xBF885790 */
  .extern CFD4FLTCON5CLR   /* 0xBF885794 */
  .extern CFD4FLTCON5SET   /* 0xBF885798 */
  .extern CFD4FLTCON5INV   /* 0xBF88579C */
  .extern CFD4FLTCON6      /* 0xBF8857A0 */
  .extern CFD4FLTCON6CLR   /* 0xBF8857A4 */
  .extern CFD4FLTCON6SET   /* 0xBF8857A8 */
  .extern CFD4FLTCON6INV   /* 0xBF8857AC */
  .extern CFD4FLTCON7      /* 0xBF8857B0 */
  .extern CFD4FLTCON7CLR   /* 0xBF8857B4 */
  .extern CFD4FLTCON7SET   /* 0xBF8857B8 */
  .extern CFD4FLTCON7INV   /* 0xBF8857BC */
  .extern CFD4FLTOBJ0      /* 0xBF8857C0 */
  .extern CFD4FLTOBJ0CLR   /* 0xBF8857C4 */
  .extern CFD4FLTOBJ0SET   /* 0xBF8857C8 */
  .extern CFD4FLTOBJ0INV   /* 0xBF8857CC */
  .extern CFD4MASK0        /* 0xBF8857D0 */
  .extern CFD4MASK0CLR     /* 0xBF8857D4 */
  .extern CFD4MASK0SET     /* 0xBF8857D8 */
  .extern CFD4MASK0INV     /* 0xBF8857DC */
  .extern CFD4FLTOBJ1      /* 0xBF8857E0 */
  .extern CFD4FLTOBJ1CLR   /* 0xBF8857E4 */
  .extern CFD4FLTOBJ1SET   /* 0xBF8857E8 */
  .extern CFD4FLTOBJ1INV   /* 0xBF8857EC */
  .extern CFD4MASK1        /* 0xBF8857F0 */
  .extern CFD4MASK1CLR     /* 0xBF8857F4 */
  .extern CFD4MASK1SET     /* 0xBF8857F8 */
  .extern CFD4MASK1INV     /* 0xBF8857FC */
  .extern CFD4FLTOBJ2      /* 0xBF885800 */
  .extern CFD4FLTOBJ2CLR   /* 0xBF885804 */
  .extern CFD4FLTOBJ2SET   /* 0xBF885808 */
  .extern CFD4FLTOBJ2INV   /* 0xBF88580C */
  .extern CFD4MASK2        /* 0xBF885810 */
  .extern CFD4MASK2CLR     /* 0xBF885814 */
  .extern CFD4MASK2SET     /* 0xBF885818 */
  .extern CFD4MASK2INV     /* 0xBF88581C */
  .extern CFD4FLTOBJ3      /* 0xBF885820 */
  .extern CFD4FLTOBJ3CLR   /* 0xBF885824 */
  .extern CFD4FLTOBJ3SET   /* 0xBF885828 */
  .extern CFD4FLTOBJ3INV   /* 0xBF88582C */
  .extern CFD4MASK3        /* 0xBF885830 */
  .extern CFD4MASK3CLR     /* 0xBF885834 */
  .extern CFD4MASK3SET     /* 0xBF885838 */
  .extern CFD4MASK3INV     /* 0xBF88583C */
  .extern CFD4FLTOBJ4      /* 0xBF885840 */
  .extern CFD4FLTOBJ4CLR   /* 0xBF885844 */
  .extern CFD4FLTOBJ4SET   /* 0xBF885848 */
  .extern CFD4FLTOBJ4INV   /* 0xBF88584C */
  .extern CFD4MASK4        /* 0xBF885850 */
  .extern CFD4MASK4CLR     /* 0xBF885854 */
  .extern CFD4MASK4SET     /* 0xBF885858 */
  .extern CFD4MASK4INV     /* 0xBF88585C */
  .extern CFD4FLTOBJ5      /* 0xBF885860 */
  .extern CFD4FLTOBJ5CLR   /* 0xBF885864 */
  .extern CFD4FLTOBJ5SET   /* 0xBF885868 */
  .extern CFD4FLTOBJ5INV   /* 0xBF88586C */
  .extern CFD4MASK5        /* 0xBF885870 */
  .extern CFD4MASK5CLR     /* 0xBF885874 */
  .extern CFD4MASK5SET     /* 0xBF885878 */
  .extern CFD4MASK5INV     /* 0xBF88587C */
  .extern CFD4FLTOBJ6      /* 0xBF885880 */
  .extern CFD4FLTOBJ6CLR   /* 0xBF885884 */
  .extern CFD4FLTOBJ6SET   /* 0xBF885888 */
  .extern CFD4FLTOBJ6INV   /* 0xBF88588C */
  .extern CFD4MASK6        /* 0xBF885890 */
  .extern CFD4MASK6CLR     /* 0xBF885894 */
  .extern CFD4MASK6SET     /* 0xBF885898 */
  .extern CFD4MASK6INV     /* 0xBF88589C */
  .extern CFD4FLTOBJ7      /* 0xBF8858A0 */
  .extern CFD4FLTOBJ7CLR   /* 0xBF8858A4 */
  .extern CFD4FLTOBJ7SET   /* 0xBF8858A8 */
  .extern CFD4FLTOBJ7INV   /* 0xBF8858AC */
  .extern CFD4MASK7        /* 0xBF8858B0 */
  .extern CFD4MASK7CLR     /* 0xBF8858B4 */
  .extern CFD4MASK7SET     /* 0xBF8858B8 */
  .extern CFD4FLTOBJ8      /* 0xBF8858C0 */
  .extern CFD4FLTOBJ8CLR   /* 0xBF8858C4 */
  .extern CFD4FLTOBJ8SET   /* 0xBF8858C8 */
  .extern CFD4FLTOBJ8INV   /* 0xBF8858CC */
  .extern CFD4MASK8        /* 0xBF8858D0 */
  .extern CFD4MASK8CLR     /* 0xBF8858D4 */
  .extern CFD4MASK8SET     /* 0xBF8858D8 */
  .extern CFD4MASK8INV     /* 0xBF8858DC */
  .extern CFD4FLTOBJ9      /* 0xBF8858E0 */
  .extern CFD4FLTOBJ9CLR   /* 0xBF8858E4 */
  .extern CFD4FLTOBJ9SET   /* 0xBF8858E8 */
  .extern CFD4FLTOBJ9INV   /* 0xBF8858EC */
  .extern CFD4MASK9        /* 0xBF8858F0 */
  .extern CFD4MASK9CLR     /* 0xBF8858F4 */
  .extern CFD4MASK9SET     /* 0xBF8858F8 */
  .extern CFD4MASK9INV     /* 0xBF8858FC */
  .extern CFD4FLTOBJ10     /* 0xBF885900 */
  .extern CFD4FLTOBJ10CLR  /* 0xBF885904 */
  .extern CFD4FLTOBJ10SET  /* 0xBF885908 */
  .extern CFD4FLTOBJ10INV  /* 0xBF88590C */
  .extern CFD4MASK10       /* 0xBF885910 */
  .extern CFD4MASK10CLR    /* 0xBF885914 */
  .extern CFD4MASK10SET    /* 0xBF885918 */
  .extern CFD4MASK10INV    /* 0xBF88591C */
  .extern CFD4FLTOBJ11     /* 0xBF885920 */
  .extern CFD4FLTOBJ11CLR  /* 0xBF885924 */
  .extern CFD4FLTOBJ11SET  /* 0xBF885928 */
  .extern CFD4FLTOBJ11INV  /* 0xBF88592C */
  .extern CFD4MASK11       /* 0xBF885930 */
  .extern CFD4MASK11CLR    /* 0xBF885934 */
  .extern CFD4MASK11SET    /* 0xBF885938 */
  .extern CFD4MASK11INV    /* 0xBF88593C */
  .extern CFD4FLTOBJ12     /* 0xBF885940 */
  .extern CFD4FLTOBJ12CLR  /* 0xBF885944 */
  .extern CFD4FLTOBJ12SET  /* 0xBF885948 */
  .extern CFD4FLTOBJ12INV  /* 0xBF88594C */
  .extern CFD4MASK12       /* 0xBF885950 */
  .extern CFD4MASK12CLR    /* 0xBF885954 */
  .extern CFD4MASK12SET    /* 0xBF885958 */
  .extern CFD4MASK12INV    /* 0xBF88595C */
  .extern CFD4FLTOBJ13     /* 0xBF885960 */
  .extern CFD4FLTOBJ13CLR  /* 0xBF885964 */
  .extern CFD4FLTOBJ13SET  /* 0xBF885968 */
  .extern CFD4FLTOBJ13INV  /* 0xBF88596C */
  .extern CFD4MASK13       /* 0xBF885970 */
  .extern CFD4MASK13CLR    /* 0xBF885974 */
  .extern CFD4MASK13SET    /* 0xBF885978 */
  .extern CFD4MASK13INV    /* 0xBF88597C */
  .extern CFD4FLTOBJ14     /* 0xBF885980 */
  .extern CFD4FLTOBJ14CLR  /* 0xBF885984 */
  .extern CFD4FLTOBJ14SET  /* 0xBF885988 */
  .extern CFD4FLTOBJ14INV  /* 0xBF88598C */
  .extern CFD4MASK14       /* 0xBF885990 */
  .extern CFD4MASK14CLR    /* 0xBF885994 */
  .extern CFD4MASK14SET    /* 0xBF885998 */
  .extern CFD4MASK14INV    /* 0xBF88599C */
  .extern CFD4FLTOBJ15     /* 0xBF8859A0 */
  .extern CFD4FLTOBJ15CLR  /* 0xBF8859A4 */
  .extern CFD4FLTOBJ15SET  /* 0xBF8859A8 */
  .extern CFD4FLTOBJ15INV  /* 0xBF8859AC */
  .extern CFD4MASK15       /* 0xBF8859B0 */
  .extern CFD4MASK15CLR    /* 0xBF8859B4 */
  .extern CFD4MASK15SET    /* 0xBF8859B8 */
  .extern CFD4MASK15INV    /* 0xBF8859BC */
  .extern CFD4FLTOBJ16     /* 0xBF8859C0 */
  .extern CFD4FLTOBJ16CLR  /* 0xBF8859C4 */
  .extern CFD4FLTOBJ16SET  /* 0xBF8859C8 */
  .extern CFD4FLTOBJ16INV  /* 0xBF8859CC */
  .extern CFD4MASK16       /* 0xBF8859D0 */
  .extern CFD4MASK16CLR    /* 0xBF8859D4 */
  .extern CFD4MASK16SET    /* 0xBF8859D8 */
  .extern CFD4MASK16INV    /* 0xBF8859DC */
  .extern CFD4FLTOBJ17     /* 0xBF8859E0 */
  .extern CFD4FLTOBJ17CLR  /* 0xBF8859E4 */
  .extern CFD4FLTOBJ17SET  /* 0xBF8859E8 */
  .extern CFD4FLTOBJ17INV  /* 0xBF8859EC */
  .extern CFD4MASK17       /* 0xBF8859F0 */
  .extern CFD4MASK17CLR    /* 0xBF8859F4 */
  .extern CFD4MASK17SET    /* 0xBF8859F8 */
  .extern CFD4MASK17INV    /* 0xBF8859FC */
  .extern CFD4FLTOBJ18     /* 0xBF885A00 */
  .extern CFD4FLTOBJ18CLR  /* 0xBF885A04 */
  .extern CFD4FLTOBJ18SET  /* 0xBF885A08 */
  .extern CFD4FLTOBJ18INV  /* 0xBF885A0C */
  .extern CFD4MASK18       /* 0xBF885A10 */
  .extern CFD4MASK18CLR    /* 0xBF885A14 */
  .extern CFD4MASK18SET    /* 0xBF885A18 */
  .extern CFD4MASK18INV    /* 0xBF885A1C */
  .extern CFD4FLTOBJ19     /* 0xBF885A20 */
  .extern CFD4FLTOBJ19CLR  /* 0xBF885A24 */
  .extern CFD4FLTOBJ19SET  /* 0xBF885A28 */
  .extern CFD4FLTOBJ19INV  /* 0xBF885A2C */
  .extern CFD4MASK19       /* 0xBF885A30 */
  .extern CFD4MASK19CLR    /* 0xBF885A34 */
  .extern CFD4MASK19SET    /* 0xBF885A38 */
  .extern CFD4MASK19INV    /* 0xBF885A3C */
  .extern CFD4FLTOBJ20     /* 0xBF885A40 */
  .extern CFD4FLTOBJ20CLR  /* 0xBF885A44 */
  .extern CFD4FLTOBJ20SET  /* 0xBF885A48 */
  .extern CFD4FLTOBJ20INV  /* 0xBF885A4C */
  .extern CFD4MASK20       /* 0xBF885A50 */
  .extern CFD4MASK20CLR    /* 0xBF885A54 */
  .extern CFD4MASK20SET    /* 0xBF885A58 */
  .extern CFD4MASK20INV    /* 0xBF885A5C */
  .extern CFD4FLTOBJ21     /* 0xBF885A60 */
  .extern CFD4FLTOBJ21CLR  /* 0xBF885A64 */
  .extern CFD4FLTOBJ21SET  /* 0xBF885A68 */
  .extern CFD4FLTOBJ21INV  /* 0xBF885A6C */
  .extern CFD4MASK21       /* 0xBF885A70 */
  .extern CFD4MASK21CLR    /* 0xBF885A74 */
  .extern CFD4MASK21SET    /* 0xBF885A78 */
  .extern CFD4MASK21INV    /* 0xBF885A7C */
  .extern CFD4FLTOBJ22     /* 0xBF885A80 */
  .extern CFD4FLTOBJ22CLR  /* 0xBF885A84 */
  .extern CFD4FLTOBJ22SET  /* 0xBF885A88 */
  .extern CFD4FLTOBJ22INV  /* 0xBF885A8C */
  .extern CFD4MASK22       /* 0xBF885A90 */
  .extern CFD4MASK22CLR    /* 0xBF885A94 */
  .extern CFD4MASK22SET    /* 0xBF885A98 */
  .extern CFD4MASK22INV    /* 0xBF885A9C */
  .extern CFD4FLTOBJ23     /* 0xBF885AA0 */
  .extern CFD4FLTOBJ23CLR  /* 0xBF885AA4 */
  .extern CFD4FLTOBJ23SET  /* 0xBF885AA8 */
  .extern CFD4FLTOBJ23INV  /* 0xBF885AAC */
  .extern CFD4MASK23       /* 0xBF885AB0 */
  .extern CFD4MASK23CLR    /* 0xBF885AB4 */
  .extern CFD4MASK23SET    /* 0xBF885AB8 */
  .extern CFD4MASK23INV    /* 0xBF885ABC */
  .extern CFD4FLTOBJ24     /* 0xBF885AC0 */
  .extern CFD4FLTOBJ24CLR  /* 0xBF885AC4 */
  .extern CFD4FLTOBJ24SET  /* 0xBF885AC8 */
  .extern CFD4FLTOBJ24INV  /* 0xBF885ACC */
  .extern CFD4MASK24       /* 0xBF885AD0 */
  .extern CFD4MASK24CLR    /* 0xBF885AD4 */
  .extern CFD4MASK24SET    /* 0xBF885AD8 */
  .extern CFD4MASK24INV    /* 0xBF885ADC */
  .extern CFD4FLTOBJ25     /* 0xBF885AE0 */
  .extern CFD4FLTOBJ25CLR  /* 0xBF885AE4 */
  .extern CFD4FLTOBJ25SET  /* 0xBF885AE8 */
  .extern CFD4FLTOBJ25INV  /* 0xBF885AEC */
  .extern CFD4MASK25       /* 0xBF885AF0 */
  .extern CFD4MASK25CLR    /* 0xBF885AF4 */
  .extern CFD4MASK25SET    /* 0xBF885AF8 */
  .extern CFD4MASK25INV    /* 0xBF885AFC */
  .extern CFD4FLTOBJ26     /* 0xBF885B00 */
  .extern CFD4FLTOBJ26CLR  /* 0xBF885B04 */
  .extern CFD4FLTOBJ26SET  /* 0xBF885B08 */
  .extern CFD4FLTOBJ26INV  /* 0xBF885B0C */
  .extern CFD4MASK26       /* 0xBF885B10 */
  .extern CFD4MASK26CLR    /* 0xBF885B14 */
  .extern CFD4MASK26SET    /* 0xBF885B18 */
  .extern CFD4MASK26INV    /* 0xBF885B1C */
  .extern CFD4FLTOBJ27     /* 0xBF885B20 */
  .extern CFD4FLTOBJ27CLR  /* 0xBF885B24 */
  .extern CFD4FLTOBJ27SET  /* 0xBF885B28 */
  .extern CFD4FLTOBJ27INV  /* 0xBF885B2C */
  .extern CFD4MASK27       /* 0xBF885B30 */
  .extern CFD4MASK27CLR    /* 0xBF885B34 */
  .extern CFD4MASK27SET    /* 0xBF885B38 */
  .extern CFD4MASK27INV    /* 0xBF885B3C */
  .extern CFD4FLTOBJ28     /* 0xBF885B40 */
  .extern CFD4FLTOBJ28CLR  /* 0xBF885B44 */
  .extern CFD4FLTOBJ28SET  /* 0xBF885B48 */
  .extern CFD4FLTOBJ28INV  /* 0xBF885B4C */
  .extern CFD4MASK28       /* 0xBF885B50 */
  .extern CFD4MASK28CLR    /* 0xBF885B54 */
  .extern CFD4MASK28SET    /* 0xBF885B58 */
  .extern CFD4MASK28INV    /* 0xBF885B5C */
  .extern CFD4FLTOBJ29     /* 0xBF885B60 */
  .extern CFD4FLTOBJ29CLR  /* 0xBF885B64 */
  .extern CFD4FLTOBJ29SET  /* 0xBF885B68 */
  .extern CFD4FLTOBJ29INV  /* 0xBF885B6C */
  .extern CFD4MASK29       /* 0xBF885B70 */
  .extern CFD4MASK29CLR    /* 0xBF885B74 */
  .extern CFD4MASK29SET    /* 0xBF885B78 */
  .extern CFD4MASK29INV    /* 0xBF885B7C */
  .extern CFD4FLTOBJ30     /* 0xBF885B80 */
  .extern CFD4FLTOBJ30CLR  /* 0xBF885B84 */
  .extern CFD4FLTOBJ30SET  /* 0xBF885B88 */
  .extern CFD4FLTOBJ30INV  /* 0xBF885B8C */
  .extern CFD4MASK30       /* 0xBF885B90 */
  .extern CFD4MASK30CLR    /* 0xBF885B94 */
  .extern CFD4MASK30SET    /* 0xBF885B98 */
  .extern CFD4MASK30INV    /* 0xBF885B9C */
  .extern CFD4FLTOBJ31     /* 0xBF885BA0 */
  .extern CFD4FLTOBJ31CLR  /* 0xBF885BA4 */
  .extern CFD4FLTOBJ31SET  /* 0xBF885BA8 */
  .extern CFD4FLTOBJ31INV  /* 0xBF885BAC */
  .extern CFD4MASK31       /* 0xBF885BB0 */
  .extern CFD4MASK31CLR    /* 0xBF885BB4 */
  .extern CFD4MASK31SET    /* 0xBF885BB8 */
  .extern CFD4MASK31INV    /* 0xBF885BBC */
  .extern ADCCON1          /* 0xBF887000 */
  .extern ADCCON1CLR       /* 0xBF887004 */
  .extern ADCCON1SET       /* 0xBF887008 */
  .extern ADCCON1INV       /* 0xBF88700C */
  .extern ADCCON2          /* 0xBF887010 */
  .extern ADCCON2CLR       /* 0xBF887014 */
  .extern ADCCON2SET       /* 0xBF887018 */
  .extern ADCCON2INV       /* 0xBF88701C */
  .extern ADCCON3          /* 0xBF887020 */
  .extern ADCCON3CLR       /* 0xBF887024 */
  .extern ADCCON3SET       /* 0xBF887028 */
  .extern ADCCON3INV       /* 0xBF88702C */
  .extern ADCTRGMODE       /* 0xBF887030 */
  .extern ADCTRGMODECLR    /* 0xBF887034 */
  .extern ADCTRGMODESET    /* 0xBF887038 */
  .extern ADCTRGMODEINV    /* 0xBF88703C */
  .extern ADCIMCON1        /* 0xBF887040 */
  .extern ADCIMCON1CLR     /* 0xBF887044 */
  .extern ADCIMCON1SET     /* 0xBF887048 */
  .extern ADCIMCON1INV     /* 0xBF88704C */
  .extern ADCIMCON2        /* 0xBF887050 */
  .extern ADCIMCON2CLR     /* 0xBF887054 */
  .extern ADCIMCON2SET     /* 0xBF887058 */
  .extern ADCIMCON2INV     /* 0xBF88705C */
  .extern ADCIMCON3        /* 0xBF887060 */
  .extern ADCIMCON3CLR     /* 0xBF887064 */
  .extern ADCIMCON3SET     /* 0xBF887068 */
  .extern ADCIMCON3INV     /* 0xBF88706C */
  .extern ADCIMCON4        /* 0xBF887070 */
  .extern ADCIMCON4CLR     /* 0xBF887074 */
  .extern ADCIMCON4SET     /* 0xBF887078 */
  .extern ADCIMCON4INV     /* 0xBF88707C */
  .extern ADCGIRQEN1       /* 0xBF887080 */
  .extern ADCGIRQEN1CLR    /* 0xBF887084 */
  .extern ADCGIRQEN1SET    /* 0xBF887088 */
  .extern ADCGIRQEN1INV    /* 0xBF88708C */
  .extern ADCGIRQEN2       /* 0xBF887090 */
  .extern ADCGIRQEN2CLR    /* 0xBF887094 */
  .extern ADCGIRQEN2SET    /* 0xBF887098 */
  .extern ADCGIRQEN2INV    /* 0xBF88709C */
  .extern ADCCSS1          /* 0xBF8870A0 */
  .extern ADCCSS1CLR       /* 0xBF8870A4 */
  .extern ADCCSS1SET       /* 0xBF8870A8 */
  .extern ADCCSS1INV       /* 0xBF8870AC */
  .extern ADCCSS2          /* 0xBF8870B0 */
  .extern ADCCSS2CLR       /* 0xBF8870B4 */
  .extern ADCCSS2SET       /* 0xBF8870B8 */
  .extern ADCCSS2INV       /* 0xBF8870BC */
  .extern ADCDSTAT1        /* 0xBF8870C0 */
  .extern ADCDSTAT1CLR     /* 0xBF8870C4 */
  .extern ADCDSTAT1SET     /* 0xBF8870C8 */
  .extern ADCDSTAT1INV     /* 0xBF8870CC */
  .extern ADCDSTAT2        /* 0xBF8870D0 */
  .extern ADCDSTAT2CLR     /* 0xBF8870D4 */
  .extern ADCDSTAT2SET     /* 0xBF8870D8 */
  .extern ADCDSTAT2INV     /* 0xBF8870DC */
  .extern ADCCMPEN1        /* 0xBF8870E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8870E4 */
  .extern ADCCMPEN1SET     /* 0xBF8870E8 */
  .extern ADCCMPEN1INV     /* 0xBF8870EC */
  .extern ADCCMP1          /* 0xBF8870F0 */
  .extern ADCCMP1CLR       /* 0xBF8870F4 */
  .extern ADCCMP1SET       /* 0xBF8870F8 */
  .extern ADCCMP1INV       /* 0xBF8870FC */
  .extern ADCCMPEN2        /* 0xBF887100 */
  .extern ADCCMPEN2CLR     /* 0xBF887104 */
  .extern ADCCMPEN2SET     /* 0xBF887108 */
  .extern ADCCMPEN2INV     /* 0xBF88710C */
  .extern ADCCMP2          /* 0xBF887110 */
  .extern ADCCMP2CLR       /* 0xBF887114 */
  .extern ADCCMP2SET       /* 0xBF887118 */
  .extern ADCCMP2INV       /* 0xBF88711C */
  .extern ADCCMPEN3        /* 0xBF887120 */
  .extern ADCCMPEN3CLR     /* 0xBF887124 */
  .extern ADCCMPEN3SET     /* 0xBF887128 */
  .extern ADCCMPEN3INV     /* 0xBF88712C */
  .extern ADCCMP3          /* 0xBF887130 */
  .extern ADCCMP3CLR       /* 0xBF887134 */
  .extern ADCCMP3SET       /* 0xBF887138 */
  .extern ADCCMP3INV       /* 0xBF88713C */
  .extern ADCCMPEN4        /* 0xBF887140 */
  .extern ADCCMPEN4CLR     /* 0xBF887144 */
  .extern ADCCMPEN4SET     /* 0xBF887148 */
  .extern ADCCMPEN4INV     /* 0xBF88714C */
  .extern ADCCMP4          /* 0xBF887150 */
  .extern ADCCMP4CLR       /* 0xBF887154 */
  .extern ADCCMP4SET       /* 0xBF887158 */
  .extern ADCCMP4INV       /* 0xBF88715C */
