Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
  .extern DEVADC0          /* 0xBFC45000 */
  .extern DEVADC1          /* 0xBFC45004 */
  .extern DEVADC2          /* 0xBFC45008 */
  .extern DEVADC3          /* 0xBFC4500C */
  .extern DEVADC4          /* 0xBFC45010 */
  .extern DEVADC5          /* 0xBFC45014 */
  .extern DEVADC7          /* 0xBFC45018 */
  .extern DEVSN0           /* 0xBFC45020 */
  .extern DEVSN1           /* 0xBFC45024 */
  .extern DEVSN2           /* 0xBFC45028 */
  .extern DEVSN3           /* 0xBFC4502C */
  .extern DEVEE0           /* 0xBFC45030 */
  .extern DEVEE1           /* 0xBFC45034 */
  .extern DEVEE2           /* 0xBFC45038 */
  .extern DEVEE3           /* 0xBFC4503C */
  .extern ADEVCFG3         /* 0xBFC03F40 */
  .extern ADEVCFG2         /* 0xBFC03F44 */
  .extern ADEVCFG1         /* 0xBFC03F48 */
  .extern ADEVCFG0         /* 0xBFC03F4C */
  .extern ADEVCP           /* 0xBFC03F5C */
  .extern ADEVSIGN         /* 0xBFC03F6C */
  .extern ASEQ             /* 0xBFC03F70 */
  .extern AUBADEVCFG3      /* 0xBFC23F40 */
  .extern AUBADEVCFG2      /* 0xBFC23F44 */
  .extern AUBADEVCFG1      /* 0xBFC23F48 */
  .extern AUBADEVCFG0      /* 0xBFC23F4C */
  .extern AUBADEVCP        /* 0xBFC23F5C */
  .extern AUBADEVSIGN      /* 0xBFC23F6C */
  .extern AUBASEQ          /* 0xBFC23F70 */
  .extern UBADEVCFG3       /* 0xBFC23FC0 */
  .extern UBADEVCFG2       /* 0xBFC23FC4 */
  .extern UBADEVCFG1       /* 0xBFC23FC8 */
  .extern UBADEVCFG0       /* 0xBFC23FCC */
  .extern UBADEVCP         /* 0xBFC23FDC */
  .extern UBADEVSIGN       /* 0xBFC23FEC */
  .extern UBASEQ           /* 0xBFC23FF0 */
  .extern ABF1DEVCFG3      /* 0xBFC43F40 */
  .extern ABF1DEVCFG2      /* 0xBFC43F44 */
  .extern ABF1DEVCFG1      /* 0xBFC43F48 */
  .extern ABF1DEVCFG0      /* 0xBFC43F4C */
  .extern ABF1DEVCP        /* 0xBFC43F5C */
  .extern ABF1DEVSIGN      /* 0xBFC43F6C */
  .extern ABF1SEQ          /* 0xBFC43F70 */
  .extern BF1DEVCFG3       /* 0xBFC43FC0 */
  .extern BF1DEVCFG2       /* 0xBFC43FC4 */
  .extern BF1DEVCFG1       /* 0xBFC43FC8 */
  .extern BF1DEVCFG0       /* 0xBFC43FCC */
  .extern BF1DEVCP         /* 0xBFC43FDC */
  .extern BF1DEVSIGN       /* 0xBFC43FEC */
  .extern BF1SEQ           /* 0xBFC43FF0 */
  .extern ABF2DEVCFG3      /* 0xBFC63F40 */
  .extern ABF2DEVCFG2      /* 0xBFC63F44 */
  .extern ABF2DEVCFG1      /* 0xBFC63F48 */
  .extern ABF2DEVCFG0      /* 0xBFC63F4C */
  .extern ABF2DEVCP        /* 0xBFC63F5C */
  .extern ABF2DEVSIGN      /* 0xBFC63F6C */
  .extern ABF2SEQ          /* 0xBFC63F70 */
  .extern BF2DEVCFG3       /* 0xBFC63FC0 */
  .extern BF2DEVCFG2       /* 0xBFC63FC4 */
  .extern BF2DEVCFG1       /* 0xBFC63FC8 */
  .extern BF2DEVCFG0       /* 0xBFC63FCC */
  .extern BF2DEVCP         /* 0xBFC63FDC */
  .extern BF2DEVSIGN       /* 0xBFC63FEC */
  .extern BF2SEQ           /* 0xBFC63FF0 */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_ECCCON_POSITION                  0x00000004
#define _CFGCON_ECCCON_MASK                      0x00000030
#define _CFGCON_ECCCON_LENGTH                    0x00000002

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

#define _CFGCON_PGLOCK_POSITION                  0x0000000B
#define _CFGCON_PGLOCK_MASK                      0x00000800
#define _CFGCON_PGLOCK_LENGTH                    0x00000001

#define _CFGCON_PMDLOCK_POSITION                 0x0000000C
#define _CFGCON_PMDLOCK_MASK                     0x00001000
#define _CFGCON_PMDLOCK_LENGTH                   0x00000001

#define _CFGCON_IOLOCK_POSITION                  0x0000000D
#define _CFGCON_IOLOCK_MASK                      0x00002000
#define _CFGCON_IOLOCK_LENGTH                    0x00000001

#define _CFGCON_OCACLK_POSITION                  0x00000010
#define _CFGCON_OCACLK_MASK                      0x00010000
#define _CFGCON_OCACLK_LENGTH                    0x00000001

#define _CFGCON_ICACLK_POSITION                  0x00000011
#define _CFGCON_ICACLK_MASK                      0x00020000
#define _CFGCON_ICACLK_LENGTH                    0x00000001

#define _CFGCON_PWMAPIN1_POSITION                0x00000012
#define _CFGCON_PWMAPIN1_MASK                    0x00040000
#define _CFGCON_PWMAPIN1_LENGTH                  0x00000001

#define _CFGCON_PWMAPIN2_POSITION                0x00000013
#define _CFGCON_PWMAPIN2_MASK                    0x00080000
#define _CFGCON_PWMAPIN2_LENGTH                  0x00000001

#define _CFGCON_PWMAPIN3_POSITION                0x00000014
#define _CFGCON_PWMAPIN3_MASK                    0x00100000
#define _CFGCON_PWMAPIN3_LENGTH                  0x00000001

#define _CFGCON_PWMAPIN4_POSITION                0x00000015
#define _CFGCON_PWMAPIN4_MASK                    0x00200000
#define _CFGCON_PWMAPIN4_LENGTH                  0x00000001

#define _CFGCON_PWMAPIN5_POSITION                0x00000016
#define _CFGCON_PWMAPIN5_MASK                    0x00400000
#define _CFGCON_PWMAPIN5_LENGTH                  0x00000001

#define _CFGCON_PWAPIN6_POSITION                 0x00000017
#define _CFGCON_PWAPIN6_MASK                     0x00800000
#define _CFGCON_PWAPIN6_LENGTH                   0x00000001

#define _CFGCON_ADCPRI_POSITION                  0x0000001A
#define _CFGCON_ADCPRI_MASK                      0x04000000
#define _CFGCON_ADCPRI_LENGTH                    0x00000001

#define _DEVID_DEVID_POSITION                    0x00000000
#define _DEVID_DEVID_MASK                        0x0FFFFFFF
#define _DEVID_DEVID_LENGTH                      0x0000001C

#define _DEVID_VER_POSITION                      0x0000001C
#define _DEVID_VER_MASK                          0xF0000000
#define _DEVID_VER_LENGTH                        0x00000004

#define _SYSKEY_SYSKEY_POSITION                  0x00000000
#define _SYSKEY_SYSKEY_MASK                      0xFFFFFFFF
#define _SYSKEY_SYSKEY_LENGTH                    0x00000020

