Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _IPC40_CMP4IP_POSITION                   0x0000000A
#define _IPC40_CMP4IP_MASK                       0x00001C00
#define _IPC40_CMP4IP_LENGTH                     0x00000003

#define _IPC40_CMP5IS_POSITION                   0x00000010
#define _IPC40_CMP5IS_MASK                       0x00030000
#define _IPC40_CMP5IS_LENGTH                     0x00000002

#define _IPC40_CMP5IP_POSITION                   0x00000012
#define _IPC40_CMP5IP_MASK                       0x001C0000
#define _IPC40_CMP5IP_LENGTH                     0x00000003

#define _IPC40_w_POSITION                        0x00000000
#define _IPC40_w_MASK                            0xFFFFFFFF
#define _IPC40_w_LENGTH                          0x00000020

#define _IPC41_U6EIS_POSITION                    0x00000000
#define _IPC41_U6EIS_MASK                        0x00000003
#define _IPC41_U6EIS_LENGTH                      0x00000002

#define _IPC41_U6EIP_POSITION                    0x00000002
#define _IPC41_U6EIP_MASK                        0x0000001C
#define _IPC41_U6EIP_LENGTH                      0x00000003

#define _IPC41_U6RXIS_POSITION                   0x00000008
#define _IPC41_U6RXIS_MASK                       0x00000300
#define _IPC41_U6RXIS_LENGTH                     0x00000002

#define _IPC41_U6RXIP_POSITION                   0x0000000A
#define _IPC41_U6RXIP_MASK                       0x00001C00
#define _IPC41_U6RXIP_LENGTH                     0x00000003

#define _IPC41_U6TXIS_POSITION                   0x00000010
#define _IPC41_U6TXIS_MASK                       0x00030000
#define _IPC41_U6TXIS_LENGTH                     0x00000002

#define _IPC41_U6TXIP_POSITION                   0x00000012
#define _IPC41_U6TXIP_MASK                       0x001C0000
#define _IPC41_U6TXIP_LENGTH                     0x00000003

#define _IPC41_CAN1IS_POSITION                   0x00000018
#define _IPC41_CAN1IS_MASK                       0x03000000
#define _IPC41_CAN1IS_LENGTH                     0x00000002

#define _IPC41_CAN1IP_POSITION                   0x0000001A
#define _IPC41_CAN1IP_MASK                       0x1C000000
#define _IPC41_CAN1IP_LENGTH                     0x00000003

#define _IPC41_w_POSITION                        0x00000000
#define _IPC41_w_MASK                            0xFFFFFFFF
#define _IPC41_w_LENGTH                          0x00000020

#define _IPC42_CAN2IS_POSITION                   0x00000000
#define _IPC42_CAN2IS_MASK                       0x00000003
#define _IPC42_CAN2IS_LENGTH                     0x00000002

#define _IPC42_CAN2IP_POSITION                   0x00000002
#define _IPC42_CAN2IP_MASK                       0x0000001C
#define _IPC42_CAN2IP_LENGTH                     0x00000003

#define _IPC42_QEI1IS_POSITION                   0x00000008
#define _IPC42_QEI1IS_MASK                       0x00000300
#define _IPC42_QEI1IS_LENGTH                     0x00000002

#define _IPC42_QEI1IP_POSITION                   0x0000000A
#define _IPC42_QEI1IP_MASK                       0x00001C00
#define _IPC42_QEI1IP_LENGTH                     0x00000003

#define _IPC42_QEI2IS_POSITION                   0x00000010
#define _IPC42_QEI2IS_MASK                       0x00030000
#define _IPC42_QEI2IS_LENGTH                     0x00000002

#define _IPC42_QEI2IP_POSITION                   0x00000012
#define _IPC42_QEI2IP_MASK                       0x001C0000
#define _IPC42_QEI2IP_LENGTH                     0x00000003

#define _IPC42_PWMPEVTIS_POSITION                0x00000018
#define _IPC42_PWMPEVTIS_MASK                    0x03000000
#define _IPC42_PWMPEVTIS_LENGTH                  0x00000002

#define _IPC42_PWMPEVTIP_POSITION                0x0000001A
#define _IPC42_PWMPEVTIP_MASK                    0x1C000000
#define _IPC42_PWMPEVTIP_LENGTH                  0x00000003

#define _IPC42_w_POSITION                        0x00000000
#define _IPC42_w_MASK                            0xFFFFFFFF
#define _IPC42_w_LENGTH                          0x00000020

#define _IPC43_PWMSEVTIS_POSITION                0x00000000
#define _IPC43_PWMSEVTIS_MASK                    0x00000003
#define _IPC43_PWMSEVTIS_LENGTH                  0x00000002

#define _IPC43_PWMSEVTIP_POSITION                0x00000002
#define _IPC43_PWMSEVTIP_MASK                    0x0000001C
#define _IPC43_PWMSEVTIP_LENGTH                  0x00000003

#define _IPC43_PWM1IS_POSITION                   0x00000008
#define _IPC43_PWM1IS_MASK                       0x00000300
#define _IPC43_PWM1IS_LENGTH                     0x00000002

#define _IPC43_PWM1IP_POSITION                   0x0000000A
#define _IPC43_PWM1IP_MASK                       0x00001C00
#define _IPC43_PWM1IP_LENGTH                     0x00000003

#define _IPC43_PWM2IS_POSITION                   0x00000010
#define _IPC43_PWM2IS_MASK                       0x00030000
#define _IPC43_PWM2IS_LENGTH                     0x00000002

#define _IPC43_PWM2IP_POSITION                   0x00000012
#define _IPC43_PWM2IP_MASK                       0x001C0000
#define _IPC43_PWM2IP_LENGTH                     0x00000003

#define _IPC43_PWM3IS_POSITION                   0x00000018
#define _IPC43_PWM3IS_MASK                       0x03000000
#define _IPC43_PWM3IS_LENGTH                     0x00000002

#define _IPC43_PWM3IP_POSITION                   0x0000001A
#define _IPC43_PWM3IP_MASK                       0x1C000000
#define _IPC43_PWM3IP_LENGTH                     0x00000003

#define _IPC43_w_POSITION                        0x00000000
#define _IPC43_w_MASK                            0xFFFFFFFF
#define _IPC43_w_LENGTH                          0x00000020

#define _IPC44_PWM4IS_POSITION                   0x00000000
#define _IPC44_PWM4IS_MASK                       0x00000003
#define _IPC44_PWM4IS_LENGTH                     0x00000002

#define _IPC44_PWM4IP_POSITION                   0x00000002
#define _IPC44_PWM4IP_MASK                       0x0000001C
#define _IPC44_PWM4IP_LENGTH                     0x00000003

#define _IPC44_PWM5IS_POSITION                   0x00000008
#define _IPC44_PWM5IS_MASK                       0x00000300
#define _IPC44_PWM5IS_LENGTH                     0x00000002

#define _IPC44_PWM5IP_POSITION                   0x0000000A
#define _IPC44_PWM5IP_MASK                       0x00001C00
#define _IPC44_PWM5IP_LENGTH                     0x00000003

