Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _OFF198_VOFF_POSITION                    0x00000001
#define _OFF198_VOFF_MASK                        0x0003FFFE
#define _OFF198_VOFF_LENGTH                      0x00000011

#define _OFF199_VOFF_POSITION                    0x00000001
#define _OFF199_VOFF_MASK                        0x0003FFFE
#define _OFF199_VOFF_LENGTH                      0x00000011

#define _OFF200_VOFF_POSITION                    0x00000001
#define _OFF200_VOFF_MASK                        0x0003FFFE
#define _OFF200_VOFF_LENGTH                      0x00000011

#define _OFF201_VOFF_POSITION                    0x00000001
#define _OFF201_VOFF_MASK                        0x0003FFFE
#define _OFF201_VOFF_LENGTH                      0x00000011

#define _OFF202_VOFF_POSITION                    0x00000001
#define _OFF202_VOFF_MASK                        0x0003FFFE
#define _OFF202_VOFF_LENGTH                      0x00000011

#define _OFF203_VOFF_POSITION                    0x00000001
#define _OFF203_VOFF_MASK                        0x0003FFFE
#define _OFF203_VOFF_LENGTH                      0x00000011

#define _OFF204_VOFF_POSITION                    0x00000001
#define _OFF204_VOFF_MASK                        0x0003FFFE
#define _OFF204_VOFF_LENGTH                      0x00000011

#define _OFF205_VOFF_POSITION                    0x00000001
#define _OFF205_VOFF_MASK                        0x0003FFFE
#define _OFF205_VOFF_LENGTH                      0x00000011

#define _OFF206_VOFF_POSITION                    0x00000001
#define _OFF206_VOFF_MASK                        0x0003FFFE
#define _OFF206_VOFF_LENGTH                      0x00000011

#define _OFF207_VOFF_POSITION                    0x00000001
#define _OFF207_VOFF_MASK                        0x0003FFFE
#define _OFF207_VOFF_LENGTH                      0x00000011

#define _OFF208_VOFF_POSITION                    0x00000001
#define _OFF208_VOFF_MASK                        0x0003FFFE
#define _OFF208_VOFF_LENGTH                      0x00000011

#define _OFF209_VOFF_POSITION                    0x00000001
#define _OFF209_VOFF_MASK                        0x0003FFFE
#define _OFF209_VOFF_LENGTH                      0x00000011

#define _OFF210_VOFF_POSITION                    0x00000001
#define _OFF210_VOFF_MASK                        0x0003FFFE
#define _OFF210_VOFF_LENGTH                      0x00000011

#define _OFF211_VOFF_POSITION                    0x00000001
#define _OFF211_VOFF_MASK                        0x0003FFFE
#define _OFF211_VOFF_LENGTH                      0x00000011

#define _OFF212_VOFF_POSITION                    0x00000001
#define _OFF212_VOFF_MASK                        0x0003FFFE
#define _OFF212_VOFF_LENGTH                      0x00000011

#define _OFF213_VOFF_POSITION                    0x00000001
#define _OFF213_VOFF_MASK                        0x0003FFFE
#define _OFF213_VOFF_LENGTH                      0x00000011

#define _OFF214_VOFF_POSITION                    0x00000001
#define _OFF214_VOFF_MASK                        0x0003FFFE
#define _OFF214_VOFF_LENGTH                      0x00000011

#define _OFF215_VOFF_POSITION                    0x00000001
#define _OFF215_VOFF_MASK                        0x0003FFFE
#define _OFF215_VOFF_LENGTH                      0x00000011

#define _OFF216_VOFF_POSITION                    0x00000001
#define _OFF216_VOFF_MASK                        0x0003FFFE
#define _OFF216_VOFF_LENGTH                      0x00000011

#define _OFF217_VOFF_POSITION                    0x00000001
#define _OFF217_VOFF_MASK                        0x0003FFFE
#define _OFF217_VOFF_LENGTH                      0x00000011

#define _OFF218_VOFF_POSITION                    0x00000001
#define _OFF218_VOFF_MASK                        0x0003FFFE
#define _OFF218_VOFF_LENGTH                      0x00000011

#define _OFF219_VOFF_POSITION                    0x00000001
#define _OFF219_VOFF_MASK                        0x0003FFFE
#define _OFF219_VOFF_LENGTH                      0x00000011

#define _OFF220_VOFF_POSITION                    0x00000001
#define _OFF220_VOFF_MASK                        0x0003FFFE
#define _OFF220_VOFF_LENGTH                      0x00000011

#define _OFF221_VOFF_POSITION                    0x00000001
#define _OFF221_VOFF_MASK                        0x0003FFFE
#define _OFF221_VOFF_LENGTH                      0x00000011

#define _OFF222_VOFF_POSITION                    0x00000001
#define _OFF222_VOFF_MASK                        0x0003FFFE
#define _OFF222_VOFF_LENGTH                      0x00000011

#define _OFF223_VOFF_POSITION                    0x00000001
#define _OFF223_VOFF_MASK                        0x0003FFFE
#define _OFF223_VOFF_LENGTH                      0x00000011

#define _OFF224_VOFF_POSITION                    0x00000001
#define _OFF224_VOFF_MASK                        0x0003FFFE
#define _OFF224_VOFF_LENGTH                      0x00000011

#define _OFF225_VOFF_POSITION                    0x00000001
#define _OFF225_VOFF_MASK                        0x0003FFFE
#define _OFF225_VOFF_LENGTH                      0x00000011

#define _OFF226_VOFF_POSITION                    0x00000001
#define _OFF226_VOFF_MASK                        0x0003FFFE
#define _OFF226_VOFF_LENGTH                      0x00000011

#define _OFF227_VOFF_POSITION                    0x00000001
#define _OFF227_VOFF_MASK                        0x0003FFFE
#define _OFF227_VOFF_LENGTH                      0x00000011

#define _OFF228_VOFF_POSITION                    0x00000001
#define _OFF228_VOFF_MASK                        0x0003FFFE
#define _OFF228_VOFF_LENGTH                      0x00000011

#define _OFF229_VOFF_POSITION                    0x00000001
#define _OFF229_VOFF_MASK                        0x0003FFFE
#define _OFF229_VOFF_LENGTH                      0x00000011

#define _OFF230_VOFF_POSITION                    0x00000001
#define _OFF230_VOFF_MASK                        0x0003FFFE
#define _OFF230_VOFF_LENGTH                      0x00000011

#define _OFF244_VOFF_POSITION                    0x00000001
#define _OFF244_VOFF_MASK                        0x0003FFFE
#define _OFF244_VOFF_LENGTH                      0x00000011

#define _OFF245_VOFF_POSITION                    0x00000001
#define _OFF245_VOFF_MASK                        0x0003FFFE
#define _OFF245_VOFF_LENGTH                      0x00000011

#define _OFF246_VOFF_POSITION                    0x00000001
#define _OFF246_VOFF_MASK                        0x0003FFFE
#define _OFF246_VOFF_LENGTH                      0x00000011

#define _OFF247_VOFF_POSITION                    0x00000001
#define _OFF247_VOFF_MASK                        0x0003FFFE
#define _OFF247_VOFF_LENGTH                      0x00000011

