Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _PWMCON7_CLIF_POSITION                   0x0000001E
#define _PWMCON7_CLIF_MASK                       0x40000000
#define _PWMCON7_CLIF_LENGTH                     0x00000001

#define _PWMCON7_FLTIF_POSITION                  0x0000001F
#define _PWMCON7_FLTIF_MASK                      0x80000000
#define _PWMCON7_FLTIF_LENGTH                    0x00000001

#define _IOCON7_OSYNC_POSITION                   0x00000000
#define _IOCON7_OSYNC_MASK                       0x00000001
#define _IOCON7_OSYNC_LENGTH                     0x00000001

#define _IOCON7_SWAP_POSITION                    0x00000001
#define _IOCON7_SWAP_MASK                        0x00000002
#define _IOCON7_SWAP_LENGTH                      0x00000001

#define _IOCON7_CLDAT_POSITION                   0x00000002
#define _IOCON7_CLDAT_MASK                       0x0000000C
#define _IOCON7_CLDAT_LENGTH                     0x00000002

#define _IOCON7_FLTDAT_POSITION                  0x00000004
#define _IOCON7_FLTDAT_MASK                      0x00000030
#define _IOCON7_FLTDAT_LENGTH                    0x00000002

#define _IOCON7_OVRDAT_POSITION                  0x00000006
#define _IOCON7_OVRDAT_MASK                      0x000000C0
#define _IOCON7_OVRDAT_LENGTH                    0x00000002

#define _IOCON7_OVRENL_POSITION                  0x00000008
#define _IOCON7_OVRENL_MASK                      0x00000100
#define _IOCON7_OVRENL_LENGTH                    0x00000001

#define _IOCON7_OVRENH_POSITION                  0x00000009
#define _IOCON7_OVRENH_MASK                      0x00000200
#define _IOCON7_OVRENH_LENGTH                    0x00000001

#define _IOCON7_PMOD_POSITION                    0x0000000A
#define _IOCON7_PMOD_MASK                        0x00000C00
#define _IOCON7_PMOD_LENGTH                      0x00000002

#define _IOCON7_POLL_POSITION                    0x0000000C
#define _IOCON7_POLL_MASK                        0x00001000
#define _IOCON7_POLL_LENGTH                      0x00000001

#define _IOCON7_POLH_POSITION                    0x0000000D
#define _IOCON7_POLH_MASK                        0x00002000
#define _IOCON7_POLH_LENGTH                      0x00000001

#define _IOCON7_PENL_POSITION                    0x0000000E
#define _IOCON7_PENL_MASK                        0x00004000
#define _IOCON7_PENL_LENGTH                      0x00000001

#define _IOCON7_PENH_POSITION                    0x0000000F
#define _IOCON7_PENH_MASK                        0x00008000
#define _IOCON7_PENH_LENGTH                      0x00000001

#define _IOCON7_FLTMOD_POSITION                  0x00000010
#define _IOCON7_FLTMOD_MASK                      0x00030000
#define _IOCON7_FLTMOD_LENGTH                    0x00000002

#define _IOCON7_FLTPOL_POSITION                  0x00000012
#define _IOCON7_FLTPOL_MASK                      0x00040000
#define _IOCON7_FLTPOL_LENGTH                    0x00000001

#define _IOCON7_FLTSRC_POSITION                  0x00000013
#define _IOCON7_FLTSRC_MASK                      0x00780000
#define _IOCON7_FLTSRC_LENGTH                    0x00000004

#define _IOCON7_CLMOD_POSITION                   0x00000018
#define _IOCON7_CLMOD_MASK                       0x01000000
#define _IOCON7_CLMOD_LENGTH                     0x00000001

#define _IOCON7_CLPOL_POSITION                   0x00000019
#define _IOCON7_CLPOL_MASK                       0x02000000
#define _IOCON7_CLPOL_LENGTH                     0x00000001

#define _IOCON7_CLSRC_POSITION                   0x0000001A
#define _IOCON7_CLSRC_MASK                       0x3C000000
#define _IOCON7_CLSRC_LENGTH                     0x00000004

#define _PDC7_PDC_POSITION                       0x00000000
#define _PDC7_PDC_MASK                           0x0000FFFF
#define _PDC7_PDC_LENGTH                         0x00000010

#define _SDC7_SDC_POSITION                       0x00000000
#define _SDC7_SDC_MASK                           0x0000FFFF
#define _SDC7_SDC_LENGTH                         0x00000010

#define _PHASE7_PHASE_POSITION                   0x00000000
#define _PHASE7_PHASE_MASK                       0x0000FFFF
#define _PHASE7_PHASE_LENGTH                     0x00000010

#define _DTR7_DTR_POSITION                       0x00000000
#define _DTR7_DTR_MASK                           0x0000FFFF
#define _DTR7_DTR_LENGTH                         0x00000010

#define _ALTDTR7_ALTDTR_POSITION                 0x00000000
#define _ALTDTR7_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR7_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP7_COMP_POSITION                   0x00000000
#define _DTCOMP7_COMP_MASK                       0x00003FFF
#define _DTCOMP7_COMP_LENGTH                     0x0000000E

#define _TRIG7_TRGCMP_POSITION                   0x00000000
#define _TRIG7_TRGCMP_MASK                       0x0000FFFF
#define _TRIG7_TRGCMP_LENGTH                     0x00000010

#define _TRGCON7_STRGIS_POSITION                 0x00000006
#define _TRGCON7_STRGIS_MASK                     0x00000040
#define _TRGCON7_STRGIS_LENGTH                   0x00000001

#define _TRGCON7_DTM_POSITION                    0x00000007
#define _TRGCON7_DTM_MASK                        0x00000080
#define _TRGCON7_DTM_LENGTH                      0x00000001

#define _TRGCON7_STRGSEL_POSITION                0x00000008
#define _TRGCON7_STRGSEL_MASK                    0x00000300
#define _TRGCON7_STRGSEL_LENGTH                  0x00000002

#define _TRGCON7_TRGSEL_POSITION                 0x0000000A
#define _TRGCON7_TRGSEL_MASK                     0x00000C00
#define _TRGCON7_TRGSEL_LENGTH                   0x00000002

#define _TRGCON7_TRGDIV_POSITION                 0x0000000C
#define _TRGCON7_TRGDIV_MASK                     0x0000F000
#define _TRGCON7_TRGDIV_LENGTH                   0x00000004

#define _STRIG7_STRGCMP_POSITION                 0x00000000
#define _STRIG7_STRGCMP_MASK                     0x0000FFFF
#define _STRIG7_STRGCMP_LENGTH                   0x00000010

#define _CAP7_CAP_POSITION                       0x00000000
#define _CAP7_CAP_MASK                           0x0000FFFF
#define _CAP7_CAP_LENGTH                         0x00000010

#define _LEBCON7_CLLEBEN_POSITION                0x0000000A
#define _LEBCON7_CLLEBEN_MASK                    0x00000400
#define _LEBCON7_CLLEBEN_LENGTH                  0x00000001

