Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _OC13CON_OCM1_POSITION                   0x00000001
#define _OC13CON_OCM1_MASK                       0x00000002
#define _OC13CON_OCM1_LENGTH                     0x00000001

#define _OC13CON_OCM2_POSITION                   0x00000002
#define _OC13CON_OCM2_MASK                       0x00000004
#define _OC13CON_OCM2_LENGTH                     0x00000001

#define _OC13CON_OCSIDL_POSITION                 0x0000000D
#define _OC13CON_OCSIDL_MASK                     0x00002000
#define _OC13CON_OCSIDL_LENGTH                   0x00000001

#define _OC13CON_w_POSITION                      0x00000000
#define _OC13CON_w_MASK                          0xFFFFFFFF
#define _OC13CON_w_LENGTH                        0x00000020

#define _OC14CON_OCM_POSITION                    0x00000000
#define _OC14CON_OCM_MASK                        0x00000007
#define _OC14CON_OCM_LENGTH                      0x00000003

#define _OC14CON_OCTSEL_POSITION                 0x00000003
#define _OC14CON_OCTSEL_MASK                     0x00000008
#define _OC14CON_OCTSEL_LENGTH                   0x00000001

#define _OC14CON_OCFLT_POSITION                  0x00000004
#define _OC14CON_OCFLT_MASK                      0x00000010
#define _OC14CON_OCFLT_LENGTH                    0x00000001

#define _OC14CON_OC32_POSITION                   0x00000005
#define _OC14CON_OC32_MASK                       0x00000020
#define _OC14CON_OC32_LENGTH                     0x00000001

#define _OC14CON_SIDL_POSITION                   0x0000000D
#define _OC14CON_SIDL_MASK                       0x00002000
#define _OC14CON_SIDL_LENGTH                     0x00000001

#define _OC14CON_ON_POSITION                     0x0000000F
#define _OC14CON_ON_MASK                         0x00008000
#define _OC14CON_ON_LENGTH                       0x00000001

#define _OC14CON_OCM0_POSITION                   0x00000000
#define _OC14CON_OCM0_MASK                       0x00000001
#define _OC14CON_OCM0_LENGTH                     0x00000001

#define _OC14CON_OCM1_POSITION                   0x00000001
#define _OC14CON_OCM1_MASK                       0x00000002
#define _OC14CON_OCM1_LENGTH                     0x00000001

#define _OC14CON_OCM2_POSITION                   0x00000002
#define _OC14CON_OCM2_MASK                       0x00000004
#define _OC14CON_OCM2_LENGTH                     0x00000001

#define _OC14CON_OCSIDL_POSITION                 0x0000000D
#define _OC14CON_OCSIDL_MASK                     0x00002000
#define _OC14CON_OCSIDL_LENGTH                   0x00000001

#define _OC14CON_w_POSITION                      0x00000000
#define _OC14CON_w_MASK                          0xFFFFFFFF
#define _OC14CON_w_LENGTH                        0x00000020

#define _OC15CON_OCM_POSITION                    0x00000000
#define _OC15CON_OCM_MASK                        0x00000007
#define _OC15CON_OCM_LENGTH                      0x00000003

#define _OC15CON_OCTSEL_POSITION                 0x00000003
#define _OC15CON_OCTSEL_MASK                     0x00000008
#define _OC15CON_OCTSEL_LENGTH                   0x00000001

#define _OC15CON_OCFLT_POSITION                  0x00000004
#define _OC15CON_OCFLT_MASK                      0x00000010
#define _OC15CON_OCFLT_LENGTH                    0x00000001

#define _OC15CON_OC32_POSITION                   0x00000005
#define _OC15CON_OC32_MASK                       0x00000020
#define _OC15CON_OC32_LENGTH                     0x00000001

#define _OC15CON_SIDL_POSITION                   0x0000000D
#define _OC15CON_SIDL_MASK                       0x00002000
#define _OC15CON_SIDL_LENGTH                     0x00000001

#define _OC15CON_ON_POSITION                     0x0000000F
#define _OC15CON_ON_MASK                         0x00008000
#define _OC15CON_ON_LENGTH                       0x00000001

#define _OC15CON_OCM0_POSITION                   0x00000000
#define _OC15CON_OCM0_MASK                       0x00000001
#define _OC15CON_OCM0_LENGTH                     0x00000001

#define _OC15CON_OCM1_POSITION                   0x00000001
#define _OC15CON_OCM1_MASK                       0x00000002
#define _OC15CON_OCM1_LENGTH                     0x00000001

#define _OC15CON_OCM2_POSITION                   0x00000002
#define _OC15CON_OCM2_MASK                       0x00000004
#define _OC15CON_OCM2_LENGTH                     0x00000001

#define _OC15CON_OCSIDL_POSITION                 0x0000000D
#define _OC15CON_OCSIDL_MASK                     0x00002000
#define _OC15CON_OCSIDL_LENGTH                   0x00000001

#define _OC15CON_w_POSITION                      0x00000000
#define _OC15CON_w_MASK                          0xFFFFFFFF
#define _OC15CON_w_LENGTH                        0x00000020

#define _OC16CON_OCM_POSITION                    0x00000000
#define _OC16CON_OCM_MASK                        0x00000007
#define _OC16CON_OCM_LENGTH                      0x00000003

#define _OC16CON_OCTSEL_POSITION                 0x00000003
#define _OC16CON_OCTSEL_MASK                     0x00000008
#define _OC16CON_OCTSEL_LENGTH                   0x00000001

#define _OC16CON_OCFLT_POSITION                  0x00000004
#define _OC16CON_OCFLT_MASK                      0x00000010
#define _OC16CON_OCFLT_LENGTH                    0x00000001

#define _OC16CON_OC32_POSITION                   0x00000005
#define _OC16CON_OC32_MASK                       0x00000020
#define _OC16CON_OC32_LENGTH                     0x00000001

#define _OC16CON_SIDL_POSITION                   0x0000000D
#define _OC16CON_SIDL_MASK                       0x00002000
#define _OC16CON_SIDL_LENGTH                     0x00000001

#define _OC16CON_ON_POSITION                     0x0000000F
#define _OC16CON_ON_MASK                         0x00008000
#define _OC16CON_ON_LENGTH                       0x00000001

#define _OC16CON_OCM0_POSITION                   0x00000000
#define _OC16CON_OCM0_MASK                       0x00000001
#define _OC16CON_OCM0_LENGTH                     0x00000001

#define _OC16CON_OCM1_POSITION                   0x00000001
#define _OC16CON_OCM1_MASK                       0x00000002
#define _OC16CON_OCM1_LENGTH                     0x00000001

#define _OC16CON_OCM2_POSITION                   0x00000002
#define _OC16CON_OCM2_MASK                       0x00000004
#define _OC16CON_OCM2_LENGTH                     0x00000001

#define _OC16CON_OCSIDL_POSITION                 0x0000000D
#define _OC16CON_OCSIDL_MASK                     0x00002000
#define _OC16CON_OCSIDL_LENGTH                   0x00000001

#define _OC16CON_w_POSITION                      0x00000000
#define _OC16CON_w_MASK                          0xFFFFFFFF
#define _OC16CON_w_LENGTH                        0x00000020

#define _I2C3CON_SEN_POSITION                    0x00000000
#define _I2C3CON_SEN_MASK                        0x00000001
#define _I2C3CON_SEN_LENGTH                      0x00000001

#define _I2C3CON_RSEN_POSITION                   0x00000001
#define _I2C3CON_RSEN_MASK                       0x00000002
#define _I2C3CON_RSEN_LENGTH                     0x00000001

#define _I2C3CON_PEN_POSITION                    0x00000002
#define _I2C3CON_PEN_MASK                        0x00000004
#define _I2C3CON_PEN_LENGTH                      0x00000001

#define _I2C3CON_RCEN_POSITION                   0x00000003
#define _I2C3CON_RCEN_MASK                       0x00000008
#define _I2C3CON_RCEN_LENGTH                     0x00000001

#define _I2C3CON_ACKEN_POSITION                  0x00000004
#define _I2C3CON_ACKEN_MASK                      0x00000010
#define _I2C3CON_ACKEN_LENGTH                    0x00000001

#define _I2C3CON_ACKDT_POSITION                  0x00000005
#define _I2C3CON_ACKDT_MASK                      0x00000020
#define _I2C3CON_ACKDT_LENGTH                    0x00000001

#define _I2C3CON_STREN_POSITION                  0x00000006
#define _I2C3CON_STREN_MASK                      0x00000040
#define _I2C3CON_STREN_LENGTH                    0x00000001

#define _I2C3CON_GCEN_POSITION                   0x00000007
#define _I2C3CON_GCEN_MASK                       0x00000080
#define _I2C3CON_GCEN_LENGTH                     0x00000001

#define _I2C3CON_SMEN_POSITION                   0x00000008
#define _I2C3CON_SMEN_MASK                       0x00000100
#define _I2C3CON_SMEN_LENGTH                     0x00000001

