Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _CFD1TXQSTA_TXQNIF_POSITION              0x00000000
#define _CFD1TXQSTA_TXQNIF_MASK                  0x00000001
#define _CFD1TXQSTA_TXQNIF_LENGTH                0x00000001

#define _CFD1TXQSTA_TXQEIF_POSITION              0x00000002
#define _CFD1TXQSTA_TXQEIF_MASK                  0x00000004
#define _CFD1TXQSTA_TXQEIF_LENGTH                0x00000001

#define _CFD1TXQSTA_TXATIF_POSITION              0x00000004
#define _CFD1TXQSTA_TXATIF_MASK                  0x00000010
#define _CFD1TXQSTA_TXATIF_LENGTH                0x00000001

#define _CFD1TXQSTA_TXERR_POSITION               0x00000005
#define _CFD1TXQSTA_TXERR_MASK                   0x00000020
#define _CFD1TXQSTA_TXERR_LENGTH                 0x00000001

#define _CFD1TXQSTA_TXLARB_POSITION              0x00000006
#define _CFD1TXQSTA_TXLARB_MASK                  0x00000040
#define _CFD1TXQSTA_TXLARB_LENGTH                0x00000001

#define _CFD1TXQSTA_TXABT_POSITION               0x00000007
#define _CFD1TXQSTA_TXABT_MASK                   0x00000080
#define _CFD1TXQSTA_TXABT_LENGTH                 0x00000001

#define _CFD1TXQSTA_TXQCI_POSITION               0x00000008
#define _CFD1TXQSTA_TXQCI_MASK                   0x00001F00
#define _CFD1TXQSTA_TXQCI_LENGTH                 0x00000005

#define _CFD1TXQUA_TXQUA_POSITION                0x00000000
#define _CFD1TXQUA_TXQUA_MASK                    0xFFFFFFFF
#define _CFD1TXQUA_TXQUA_LENGTH                  0x00000020

#define _CFD1FIFOCON1_TFNRFNIE_POSITION          0x00000000
#define _CFD1FIFOCON1_TFNRFNIE_MASK              0x00000001
#define _CFD1FIFOCON1_TFNRFNIE_LENGTH            0x00000001

#define _CFD1FIFOCON1_TFHRFHIE_POSITION          0x00000001
#define _CFD1FIFOCON1_TFHRFHIE_MASK              0x00000002
#define _CFD1FIFOCON1_TFHRFHIE_LENGTH            0x00000001

#define _CFD1FIFOCON1_TFERFFIE_POSITION          0x00000002
#define _CFD1FIFOCON1_TFERFFIE_MASK              0x00000004
#define _CFD1FIFOCON1_TFERFFIE_LENGTH            0x00000001

#define _CFD1FIFOCON1_RXOVIE_POSITION            0x00000003
#define _CFD1FIFOCON1_RXOVIE_MASK                0x00000008
#define _CFD1FIFOCON1_RXOVIE_LENGTH              0x00000001

#define _CFD1FIFOCON1_TXATIE_POSITION            0x00000004
#define _CFD1FIFOCON1_TXATIE_MASK                0x00000010
#define _CFD1FIFOCON1_TXATIE_LENGTH              0x00000001

#define _CFD1FIFOCON1_RXTSEN_POSITION            0x00000005
#define _CFD1FIFOCON1_RXTSEN_MASK                0x00000020
#define _CFD1FIFOCON1_RXTSEN_LENGTH              0x00000001

#define _CFD1FIFOCON1_RTREN_POSITION             0x00000006
#define _CFD1FIFOCON1_RTREN_MASK                 0x00000040
#define _CFD1FIFOCON1_RTREN_LENGTH               0x00000001

#define _CFD1FIFOCON1_TXEN_POSITION              0x00000007
#define _CFD1FIFOCON1_TXEN_MASK                  0x00000080
#define _CFD1FIFOCON1_TXEN_LENGTH                0x00000001

#define _CFD1FIFOCON1_UINC_POSITION              0x00000008
#define _CFD1FIFOCON1_UINC_MASK                  0x00000100
#define _CFD1FIFOCON1_UINC_LENGTH                0x00000001

#define _CFD1FIFOCON1_TXREQ_POSITION             0x00000009
#define _CFD1FIFOCON1_TXREQ_MASK                 0x00000200
#define _CFD1FIFOCON1_TXREQ_LENGTH               0x00000001

#define _CFD1FIFOCON1_FRESET_POSITION            0x0000000A
#define _CFD1FIFOCON1_FRESET_MASK                0x00000400
#define _CFD1FIFOCON1_FRESET_LENGTH              0x00000001

#define _CFD1FIFOCON1_TXPRI_POSITION             0x00000010
#define _CFD1FIFOCON1_TXPRI_MASK                 0x001F0000
#define _CFD1FIFOCON1_TXPRI_LENGTH               0x00000005

#define _CFD1FIFOCON1_TXAT_POSITION              0x00000015
#define _CFD1FIFOCON1_TXAT_MASK                  0x00600000
#define _CFD1FIFOCON1_TXAT_LENGTH                0x00000002

#define _CFD1FIFOCON1_FSIZE_POSITION             0x00000018
#define _CFD1FIFOCON1_FSIZE_MASK                 0x1F000000
#define _CFD1FIFOCON1_FSIZE_LENGTH               0x00000005

#define _CFD1FIFOCON1_PLSIZE_POSITION            0x0000001D
#define _CFD1FIFOCON1_PLSIZE_MASK                0xE0000000
#define _CFD1FIFOCON1_PLSIZE_LENGTH              0x00000003

#define _CFD1FIFOSTA1_TFNRFNIF_POSITION          0x00000000
#define _CFD1FIFOSTA1_TFNRFNIF_MASK              0x00000001
#define _CFD1FIFOSTA1_TFNRFNIF_LENGTH            0x00000001

#define _CFD1FIFOSTA1_TFHRFHIF_POSITION          0x00000001
#define _CFD1FIFOSTA1_TFHRFHIF_MASK              0x00000002
#define _CFD1FIFOSTA1_TFHRFHIF_LENGTH            0x00000001

#define _CFD1FIFOSTA1_TFERFFIF_POSITION          0x00000002
#define _CFD1FIFOSTA1_TFERFFIF_MASK              0x00000004
#define _CFD1FIFOSTA1_TFERFFIF_LENGTH            0x00000001

#define _CFD1FIFOSTA1_RXOVIF_POSITION            0x00000003
#define _CFD1FIFOSTA1_RXOVIF_MASK                0x00000008
#define _CFD1FIFOSTA1_RXOVIF_LENGTH              0x00000001

#define _CFD1FIFOSTA1_TXATIF_POSITION            0x00000004
#define _CFD1FIFOSTA1_TXATIF_MASK                0x00000010
#define _CFD1FIFOSTA1_TXATIF_LENGTH              0x00000001

#define _CFD1FIFOSTA1_TXERR_POSITION             0x00000005
#define _CFD1FIFOSTA1_TXERR_MASK                 0x00000020
#define _CFD1FIFOSTA1_TXERR_LENGTH               0x00000001

#define _CFD1FIFOSTA1_TXLARB_POSITION            0x00000006
#define _CFD1FIFOSTA1_TXLARB_MASK                0x00000040
#define _CFD1FIFOSTA1_TXLARB_LENGTH              0x00000001

#define _CFD1FIFOSTA1_TXABT_POSITION             0x00000007
#define _CFD1FIFOSTA1_TXABT_MASK                 0x00000080
#define _CFD1FIFOSTA1_TXABT_LENGTH               0x00000001

#define _CFD1FIFOSTA1_FIFOCI_POSITION            0x00000008
#define _CFD1FIFOSTA1_FIFOCI_MASK                0x00001F00
#define _CFD1FIFOSTA1_FIFOCI_LENGTH              0x00000005

#define _CFD1FIFOUA1_FIFOUA_POSITION             0x00000000
#define _CFD1FIFOUA1_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD1FIFOUA1_FIFOUA_LENGTH               0x00000020

#define _CFD1FIFOCON2_TFNRFNIE_POSITION          0x00000000
#define _CFD1FIFOCON2_TFNRFNIE_MASK              0x00000001
#define _CFD1FIFOCON2_TFNRFNIE_LENGTH            0x00000001

#define _CFD1FIFOCON2_TFHRFHIE_POSITION          0x00000001
#define _CFD1FIFOCON2_TFHRFHIE_MASK              0x00000002
#define _CFD1FIFOCON2_TFHRFHIE_LENGTH            0x00000001

#define _CFD1FIFOCON2_TFERFFIE_POSITION          0x00000002
#define _CFD1FIFOCON2_TFERFFIE_MASK              0x00000004
#define _CFD1FIFOCON2_TFERFFIE_LENGTH            0x00000001

#define _CFD1FIFOCON2_RXOVIE_POSITION            0x00000003
#define _CFD1FIFOCON2_RXOVIE_MASK                0x00000008
#define _CFD1FIFOCON2_RXOVIE_LENGTH              0x00000001

#define _CFD1FIFOCON2_TXATIE_POSITION            0x00000004
#define _CFD1FIFOCON2_TXATIE_MASK                0x00000010
#define _CFD1FIFOCON2_TXATIE_LENGTH              0x00000001

#define _CFD1FIFOCON2_RXTSEN_POSITION            0x00000005
#define _CFD1FIFOCON2_RXTSEN_MASK                0x00000020
#define _CFD1FIFOCON2_RXTSEN_LENGTH              0x00000001

#define _CFD1FIFOCON2_RTREN_POSITION             0x00000006
#define _CFD1FIFOCON2_RTREN_MASK                 0x00000040
#define _CFD1FIFOCON2_RTREN_LENGTH               0x00000001

#define _CFD1FIFOCON2_TXEN_POSITION              0x00000007
#define _CFD1FIFOCON2_TXEN_MASK                  0x00000080
#define _CFD1FIFOCON2_TXEN_LENGTH                0x00000001

#define _CFD1FIFOCON2_UINC_POSITION              0x00000008
#define _CFD1FIFOCON2_UINC_MASK                  0x00000100
#define _CFD1FIFOCON2_UINC_LENGTH                0x00000001

