Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _CFD2FIFOSTA5_TXATIF_POSITION            0x00000004
#define _CFD2FIFOSTA5_TXATIF_MASK                0x00000010
#define _CFD2FIFOSTA5_TXATIF_LENGTH              0x00000001

#define _CFD2FIFOSTA5_TXERR_POSITION             0x00000005
#define _CFD2FIFOSTA5_TXERR_MASK                 0x00000020
#define _CFD2FIFOSTA5_TXERR_LENGTH               0x00000001

#define _CFD2FIFOSTA5_TXLARB_POSITION            0x00000006
#define _CFD2FIFOSTA5_TXLARB_MASK                0x00000040
#define _CFD2FIFOSTA5_TXLARB_LENGTH              0x00000001

#define _CFD2FIFOSTA5_TXABT_POSITION             0x00000007
#define _CFD2FIFOSTA5_TXABT_MASK                 0x00000080
#define _CFD2FIFOSTA5_TXABT_LENGTH               0x00000001

#define _CFD2FIFOSTA5_FIFOCI_POSITION            0x00000008
#define _CFD2FIFOSTA5_FIFOCI_MASK                0x00001F00
#define _CFD2FIFOSTA5_FIFOCI_LENGTH              0x00000005

#define _CFD2FIFOUA5_FIFOUA_POSITION             0x00000000
#define _CFD2FIFOUA5_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD2FIFOUA5_FIFOUA_LENGTH               0x00000020

#define _CFD2FIFOCON6_TFNRFNIE_POSITION          0x00000000
#define _CFD2FIFOCON6_TFNRFNIE_MASK              0x00000001
#define _CFD2FIFOCON6_TFNRFNIE_LENGTH            0x00000001

#define _CFD2FIFOCON6_TFHRFHIE_POSITION          0x00000001
#define _CFD2FIFOCON6_TFHRFHIE_MASK              0x00000002
#define _CFD2FIFOCON6_TFHRFHIE_LENGTH            0x00000001

#define _CFD2FIFOCON6_TFERFFIE_POSITION          0x00000002
#define _CFD2FIFOCON6_TFERFFIE_MASK              0x00000004
#define _CFD2FIFOCON6_TFERFFIE_LENGTH            0x00000001

#define _CFD2FIFOCON6_RXOVIE_POSITION            0x00000003
#define _CFD2FIFOCON6_RXOVIE_MASK                0x00000008
#define _CFD2FIFOCON6_RXOVIE_LENGTH              0x00000001

#define _CFD2FIFOCON6_TXATIE_POSITION            0x00000004
#define _CFD2FIFOCON6_TXATIE_MASK                0x00000010
#define _CFD2FIFOCON6_TXATIE_LENGTH              0x00000001

#define _CFD2FIFOCON6_RXTSEN_POSITION            0x00000005
#define _CFD2FIFOCON6_RXTSEN_MASK                0x00000020
#define _CFD2FIFOCON6_RXTSEN_LENGTH              0x00000001

#define _CFD2FIFOCON6_RTREN_POSITION             0x00000006
#define _CFD2FIFOCON6_RTREN_MASK                 0x00000040
#define _CFD2FIFOCON6_RTREN_LENGTH               0x00000001

#define _CFD2FIFOCON6_TXEN_POSITION              0x00000007
#define _CFD2FIFOCON6_TXEN_MASK                  0x00000080
#define _CFD2FIFOCON6_TXEN_LENGTH                0x00000001

#define _CFD2FIFOCON6_UINC_POSITION              0x00000008
#define _CFD2FIFOCON6_UINC_MASK                  0x00000100
#define _CFD2FIFOCON6_UINC_LENGTH                0x00000001

#define _CFD2FIFOCON6_TXREQ_POSITION             0x00000009
#define _CFD2FIFOCON6_TXREQ_MASK                 0x00000200
#define _CFD2FIFOCON6_TXREQ_LENGTH               0x00000001

#define _CFD2FIFOCON6_FRESET_POSITION            0x0000000A
#define _CFD2FIFOCON6_FRESET_MASK                0x00000400
#define _CFD2FIFOCON6_FRESET_LENGTH              0x00000001

#define _CFD2FIFOCON6_TXPRI_POSITION             0x00000010
#define _CFD2FIFOCON6_TXPRI_MASK                 0x001F0000
#define _CFD2FIFOCON6_TXPRI_LENGTH               0x00000005

#define _CFD2FIFOCON6_TXAT_POSITION              0x00000015
#define _CFD2FIFOCON6_TXAT_MASK                  0x00600000
#define _CFD2FIFOCON6_TXAT_LENGTH                0x00000002

#define _CFD2FIFOCON6_FSIZE_POSITION             0x00000018
#define _CFD2FIFOCON6_FSIZE_MASK                 0x1F000000
#define _CFD2FIFOCON6_FSIZE_LENGTH               0x00000005

#define _CFD2FIFOCON6_PLSIZE_POSITION            0x0000001D
#define _CFD2FIFOCON6_PLSIZE_MASK                0xE0000000
#define _CFD2FIFOCON6_PLSIZE_LENGTH              0x00000003

#define _CFD2FIFOSTA6_TFNRFNIF_POSITION          0x00000000
#define _CFD2FIFOSTA6_TFNRFNIF_MASK              0x00000001
#define _CFD2FIFOSTA6_TFNRFNIF_LENGTH            0x00000001

#define _CFD2FIFOSTA6_TFHRFHIF_POSITION          0x00000001
#define _CFD2FIFOSTA6_TFHRFHIF_MASK              0x00000002
#define _CFD2FIFOSTA6_TFHRFHIF_LENGTH            0x00000001

#define _CFD2FIFOSTA6_TFERFFIF_POSITION          0x00000002
#define _CFD2FIFOSTA6_TFERFFIF_MASK              0x00000004
#define _CFD2FIFOSTA6_TFERFFIF_LENGTH            0x00000001

#define _CFD2FIFOSTA6_RXOVIF_POSITION            0x00000003
#define _CFD2FIFOSTA6_RXOVIF_MASK                0x00000008
#define _CFD2FIFOSTA6_RXOVIF_LENGTH              0x00000001

#define _CFD2FIFOSTA6_TXATIF_POSITION            0x00000004
#define _CFD2FIFOSTA6_TXATIF_MASK                0x00000010
#define _CFD2FIFOSTA6_TXATIF_LENGTH              0x00000001

#define _CFD2FIFOSTA6_TXERR_POSITION             0x00000005
#define _CFD2FIFOSTA6_TXERR_MASK                 0x00000020
#define _CFD2FIFOSTA6_TXERR_LENGTH               0x00000001

#define _CFD2FIFOSTA6_TXLARB_POSITION            0x00000006
#define _CFD2FIFOSTA6_TXLARB_MASK                0x00000040
#define _CFD2FIFOSTA6_TXLARB_LENGTH              0x00000001

#define _CFD2FIFOSTA6_TXABT_POSITION             0x00000007
#define _CFD2FIFOSTA6_TXABT_MASK                 0x00000080
#define _CFD2FIFOSTA6_TXABT_LENGTH               0x00000001

#define _CFD2FIFOSTA6_FIFOCI_POSITION            0x00000008
#define _CFD2FIFOSTA6_FIFOCI_MASK                0x00001F00
#define _CFD2FIFOSTA6_FIFOCI_LENGTH              0x00000005

#define _CFD2FIFOUA6_FIFOUA_POSITION             0x00000000
#define _CFD2FIFOUA6_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD2FIFOUA6_FIFOUA_LENGTH               0x00000020

#define _CFD2FIFOCON7_TFNRFNIE_POSITION          0x00000000
#define _CFD2FIFOCON7_TFNRFNIE_MASK              0x00000001
#define _CFD2FIFOCON7_TFNRFNIE_LENGTH            0x00000001

#define _CFD2FIFOCON7_TFHRFHIE_POSITION          0x00000001
#define _CFD2FIFOCON7_TFHRFHIE_MASK              0x00000002
#define _CFD2FIFOCON7_TFHRFHIE_LENGTH            0x00000001

#define _CFD2FIFOCON7_TFERFFIE_POSITION          0x00000002
#define _CFD2FIFOCON7_TFERFFIE_MASK              0x00000004
#define _CFD2FIFOCON7_TFERFFIE_LENGTH            0x00000001

