Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _CFD2FIFOCON14_FSIZE_POSITION            0x00000018
#define _CFD2FIFOCON14_FSIZE_MASK                0x1F000000
#define _CFD2FIFOCON14_FSIZE_LENGTH              0x00000005

#define _CFD2FIFOCON14_PLSIZE_POSITION           0x0000001D
#define _CFD2FIFOCON14_PLSIZE_MASK               0xE0000000
#define _CFD2FIFOCON14_PLSIZE_LENGTH             0x00000003

#define _CFD2FIFOSTA14_TFNRFNIF_POSITION         0x00000000
#define _CFD2FIFOSTA14_TFNRFNIF_MASK             0x00000001
#define _CFD2FIFOSTA14_TFNRFNIF_LENGTH           0x00000001

#define _CFD2FIFOSTA14_TFHRFHIF_POSITION         0x00000001
#define _CFD2FIFOSTA14_TFHRFHIF_MASK             0x00000002
#define _CFD2FIFOSTA14_TFHRFHIF_LENGTH           0x00000001

#define _CFD2FIFOSTA14_TFERFFIF_POSITION         0x00000002
#define _CFD2FIFOSTA14_TFERFFIF_MASK             0x00000004
#define _CFD2FIFOSTA14_TFERFFIF_LENGTH           0x00000001

#define _CFD2FIFOSTA14_RXOVIF_POSITION           0x00000003
#define _CFD2FIFOSTA14_RXOVIF_MASK               0x00000008
#define _CFD2FIFOSTA14_RXOVIF_LENGTH             0x00000001

#define _CFD2FIFOSTA14_TXATIF_POSITION           0x00000004
#define _CFD2FIFOSTA14_TXATIF_MASK               0x00000010
#define _CFD2FIFOSTA14_TXATIF_LENGTH             0x00000001

#define _CFD2FIFOSTA14_TXERR_POSITION            0x00000005
#define _CFD2FIFOSTA14_TXERR_MASK                0x00000020
#define _CFD2FIFOSTA14_TXERR_LENGTH              0x00000001

#define _CFD2FIFOSTA14_TXLARB_POSITION           0x00000006
#define _CFD2FIFOSTA14_TXLARB_MASK               0x00000040
#define _CFD2FIFOSTA14_TXLARB_LENGTH             0x00000001

#define _CFD2FIFOSTA14_TXABT_POSITION            0x00000007
#define _CFD2FIFOSTA14_TXABT_MASK                0x00000080
#define _CFD2FIFOSTA14_TXABT_LENGTH              0x00000001

#define _CFD2FIFOSTA14_FIFOCI_POSITION           0x00000008
#define _CFD2FIFOSTA14_FIFOCI_MASK               0x00001F00
#define _CFD2FIFOSTA14_FIFOCI_LENGTH             0x00000005

#define _CFD2FIFOUA14_FIFOUA_POSITION            0x00000000
#define _CFD2FIFOUA14_FIFOUA_MASK                0xFFFFFFFF
#define _CFD2FIFOUA14_FIFOUA_LENGTH              0x00000020

#define _CFD2FIFOCON15_TFNRFNIE_POSITION         0x00000000
#define _CFD2FIFOCON15_TFNRFNIE_MASK             0x00000001
#define _CFD2FIFOCON15_TFNRFNIE_LENGTH           0x00000001

#define _CFD2FIFOCON15_TFHRFHIE_POSITION         0x00000001
#define _CFD2FIFOCON15_TFHRFHIE_MASK             0x00000002
#define _CFD2FIFOCON15_TFHRFHIE_LENGTH           0x00000001

#define _CFD2FIFOCON15_TFERFFIE_POSITION         0x00000002
#define _CFD2FIFOCON15_TFERFFIE_MASK             0x00000004
#define _CFD2FIFOCON15_TFERFFIE_LENGTH           0x00000001

#define _CFD2FIFOCON15_RXOVIE_POSITION           0x00000003
#define _CFD2FIFOCON15_RXOVIE_MASK               0x00000008
#define _CFD2FIFOCON15_RXOVIE_LENGTH             0x00000001

#define _CFD2FIFOCON15_TXATIE_POSITION           0x00000004
#define _CFD2FIFOCON15_TXATIE_MASK               0x00000010
#define _CFD2FIFOCON15_TXATIE_LENGTH             0x00000001

#define _CFD2FIFOCON15_RXTSEN_POSITION           0x00000005
#define _CFD2FIFOCON15_RXTSEN_MASK               0x00000020
#define _CFD2FIFOCON15_RXTSEN_LENGTH             0x00000001

#define _CFD2FIFOCON15_RTREN_POSITION            0x00000006
#define _CFD2FIFOCON15_RTREN_MASK                0x00000040
#define _CFD2FIFOCON15_RTREN_LENGTH              0x00000001

#define _CFD2FIFOCON15_TXEN_POSITION             0x00000007
#define _CFD2FIFOCON15_TXEN_MASK                 0x00000080
#define _CFD2FIFOCON15_TXEN_LENGTH               0x00000001

#define _CFD2FIFOCON15_UINC_POSITION             0x00000008
#define _CFD2FIFOCON15_UINC_MASK                 0x00000100
#define _CFD2FIFOCON15_UINC_LENGTH               0x00000001

#define _CFD2FIFOCON15_TXREQ_POSITION            0x00000009
#define _CFD2FIFOCON15_TXREQ_MASK                0x00000200
#define _CFD2FIFOCON15_TXREQ_LENGTH              0x00000001

#define _CFD2FIFOCON15_FRESET_POSITION           0x0000000A
#define _CFD2FIFOCON15_FRESET_MASK               0x00000400
#define _CFD2FIFOCON15_FRESET_LENGTH             0x00000001

#define _CFD2FIFOCON15_TXPRI_POSITION            0x00000010
#define _CFD2FIFOCON15_TXPRI_MASK                0x001F0000
#define _CFD2FIFOCON15_TXPRI_LENGTH              0x00000005

#define _CFD2FIFOCON15_TXAT_POSITION             0x00000015
#define _CFD2FIFOCON15_TXAT_MASK                 0x00600000
#define _CFD2FIFOCON15_TXAT_LENGTH               0x00000002

#define _CFD2FIFOCON15_FSIZE_POSITION            0x00000018
#define _CFD2FIFOCON15_FSIZE_MASK                0x1F000000
#define _CFD2FIFOCON15_FSIZE_LENGTH              0x00000005

#define _CFD2FIFOCON15_PLSIZE_POSITION           0x0000001D
#define _CFD2FIFOCON15_PLSIZE_MASK               0xE0000000
#define _CFD2FIFOCON15_PLSIZE_LENGTH             0x00000003

#define _CFD2FIFOSTA15_TFNRFNIF_POSITION         0x00000000
#define _CFD2FIFOSTA15_TFNRFNIF_MASK             0x00000001
#define _CFD2FIFOSTA15_TFNRFNIF_LENGTH           0x00000001

#define _CFD2FIFOSTA15_TFHRFHIF_POSITION         0x00000001
#define _CFD2FIFOSTA15_TFHRFHIF_MASK             0x00000002
#define _CFD2FIFOSTA15_TFHRFHIF_LENGTH           0x00000001

#define _CFD2FIFOSTA15_TFERFFIF_POSITION         0x00000002
#define _CFD2FIFOSTA15_TFERFFIF_MASK             0x00000004
#define _CFD2FIFOSTA15_TFERFFIF_LENGTH           0x00000001

#define _CFD2FIFOSTA15_RXOVIF_POSITION           0x00000003
#define _CFD2FIFOSTA15_RXOVIF_MASK               0x00000008
#define _CFD2FIFOSTA15_RXOVIF_LENGTH             0x00000001

#define _CFD2FIFOSTA15_TXATIF_POSITION           0x00000004
#define _CFD2FIFOSTA15_TXATIF_MASK               0x00000010
#define _CFD2FIFOSTA15_TXATIF_LENGTH             0x00000001

#define _CFD2FIFOSTA15_TXERR_POSITION            0x00000005
#define _CFD2FIFOSTA15_TXERR_MASK                0x00000020
#define _CFD2FIFOSTA15_TXERR_LENGTH              0x00000001

#define _CFD2FIFOSTA15_TXLARB_POSITION           0x00000006
#define _CFD2FIFOSTA15_TXLARB_MASK               0x00000040
#define _CFD2FIFOSTA15_TXLARB_LENGTH             0x00000001

