Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _CFD2FIFOSTA15_TXABT_POSITION            0x00000007
#define _CFD2FIFOSTA15_TXABT_MASK                0x00000080
#define _CFD2FIFOSTA15_TXABT_LENGTH              0x00000001

#define _CFD2FIFOSTA15_FIFOCI_POSITION           0x00000008
#define _CFD2FIFOSTA15_FIFOCI_MASK               0x00001F00
#define _CFD2FIFOSTA15_FIFOCI_LENGTH             0x00000005

#define _CFD2FIFOUA15_FIFOUA_POSITION            0x00000000
#define _CFD2FIFOUA15_FIFOUA_MASK                0xFFFFFFFF
#define _CFD2FIFOUA15_FIFOUA_LENGTH              0x00000020

#define _CFD2FIFOCON16_TFNRFNIE_POSITION         0x00000000
#define _CFD2FIFOCON16_TFNRFNIE_MASK             0x00000001
#define _CFD2FIFOCON16_TFNRFNIE_LENGTH           0x00000001

#define _CFD2FIFOCON16_TFHRFHIE_POSITION         0x00000001
#define _CFD2FIFOCON16_TFHRFHIE_MASK             0x00000002
#define _CFD2FIFOCON16_TFHRFHIE_LENGTH           0x00000001

#define _CFD2FIFOCON16_TFERFFIE_POSITION         0x00000002
#define _CFD2FIFOCON16_TFERFFIE_MASK             0x00000004
#define _CFD2FIFOCON16_TFERFFIE_LENGTH           0x00000001

#define _CFD2FIFOCON16_RXOVIE_POSITION           0x00000003
#define _CFD2FIFOCON16_RXOVIE_MASK               0x00000008
#define _CFD2FIFOCON16_RXOVIE_LENGTH             0x00000001

#define _CFD2FIFOCON16_TXATIE_POSITION           0x00000004
#define _CFD2FIFOCON16_TXATIE_MASK               0x00000010
#define _CFD2FIFOCON16_TXATIE_LENGTH             0x00000001

#define _CFD2FIFOCON16_RXTSEN_POSITION           0x00000005
#define _CFD2FIFOCON16_RXTSEN_MASK               0x00000020
#define _CFD2FIFOCON16_RXTSEN_LENGTH             0x00000001

#define _CFD2FIFOCON16_RTREN_POSITION            0x00000006
#define _CFD2FIFOCON16_RTREN_MASK                0x00000040
#define _CFD2FIFOCON16_RTREN_LENGTH              0x00000001

#define _CFD2FIFOCON16_TXEN_POSITION             0x00000007
#define _CFD2FIFOCON16_TXEN_MASK                 0x00000080
#define _CFD2FIFOCON16_TXEN_LENGTH               0x00000001

#define _CFD2FIFOCON16_UINC_POSITION             0x00000008
#define _CFD2FIFOCON16_UINC_MASK                 0x00000100
#define _CFD2FIFOCON16_UINC_LENGTH               0x00000001

#define _CFD2FIFOCON16_TXREQ_POSITION            0x00000009
#define _CFD2FIFOCON16_TXREQ_MASK                0x00000200
#define _CFD2FIFOCON16_TXREQ_LENGTH              0x00000001

#define _CFD2FIFOCON16_FRESET_POSITION           0x0000000A
#define _CFD2FIFOCON16_FRESET_MASK               0x00000400
#define _CFD2FIFOCON16_FRESET_LENGTH             0x00000001

#define _CFD2FIFOCON16_TXPRI_POSITION            0x00000010
#define _CFD2FIFOCON16_TXPRI_MASK                0x001F0000
#define _CFD2FIFOCON16_TXPRI_LENGTH              0x00000005

#define _CFD2FIFOCON16_TXAT_POSITION             0x00000015
#define _CFD2FIFOCON16_TXAT_MASK                 0x00600000
#define _CFD2FIFOCON16_TXAT_LENGTH               0x00000002

#define _CFD2FIFOCON16_FSIZE_POSITION            0x00000018
#define _CFD2FIFOCON16_FSIZE_MASK                0x1F000000
#define _CFD2FIFOCON16_FSIZE_LENGTH              0x00000005

#define _CFD2FIFOCON16_PLSIZE_POSITION           0x0000001D
#define _CFD2FIFOCON16_PLSIZE_MASK               0xE0000000
#define _CFD2FIFOCON16_PLSIZE_LENGTH             0x00000003

#define _CFD2FIFOSTA16_TFNRFNIF_POSITION         0x00000000
#define _CFD2FIFOSTA16_TFNRFNIF_MASK             0x00000001
#define _CFD2FIFOSTA16_TFNRFNIF_LENGTH           0x00000001

#define _CFD2FIFOSTA16_TFHRFHIF_POSITION         0x00000001
#define _CFD2FIFOSTA16_TFHRFHIF_MASK             0x00000002
#define _CFD2FIFOSTA16_TFHRFHIF_LENGTH           0x00000001

#define _CFD2FIFOSTA16_TFERFFIF_POSITION         0x00000002
#define _CFD2FIFOSTA16_TFERFFIF_MASK             0x00000004
#define _CFD2FIFOSTA16_TFERFFIF_LENGTH           0x00000001

#define _CFD2FIFOSTA16_RXOVIF_POSITION           0x00000003
#define _CFD2FIFOSTA16_RXOVIF_MASK               0x00000008
#define _CFD2FIFOSTA16_RXOVIF_LENGTH             0x00000001

#define _CFD2FIFOSTA16_TXATIF_POSITION           0x00000004
#define _CFD2FIFOSTA16_TXATIF_MASK               0x00000010
#define _CFD2FIFOSTA16_TXATIF_LENGTH             0x00000001

#define _CFD2FIFOSTA16_TXERR_POSITION            0x00000005
#define _CFD2FIFOSTA16_TXERR_MASK                0x00000020
#define _CFD2FIFOSTA16_TXERR_LENGTH              0x00000001

#define _CFD2FIFOSTA16_TXLARB_POSITION           0x00000006
#define _CFD2FIFOSTA16_TXLARB_MASK               0x00000040
#define _CFD2FIFOSTA16_TXLARB_LENGTH             0x00000001

#define _CFD2FIFOSTA16_TXABT_POSITION            0x00000007
#define _CFD2FIFOSTA16_TXABT_MASK                0x00000080
#define _CFD2FIFOSTA16_TXABT_LENGTH              0x00000001

#define _CFD2FIFOSTA16_FIFOCI_POSITION           0x00000008
#define _CFD2FIFOSTA16_FIFOCI_MASK               0x00001F00
#define _CFD2FIFOSTA16_FIFOCI_LENGTH             0x00000005

#define _CFD2FIFOUA16_FIFOUA_POSITION            0x00000000
#define _CFD2FIFOUA16_FIFOUA_MASK                0xFFFFFFFF
#define _CFD2FIFOUA16_FIFOUA_LENGTH              0x00000020

#define _CFD2FIFOCON17_TFNRFNIE_POSITION         0x00000000
#define _CFD2FIFOCON17_TFNRFNIE_MASK             0x00000001
#define _CFD2FIFOCON17_TFNRFNIE_LENGTH           0x00000001

#define _CFD2FIFOCON17_TFHRFHIE_POSITION         0x00000001
#define _CFD2FIFOCON17_TFHRFHIE_MASK             0x00000002
#define _CFD2FIFOCON17_TFHRFHIE_LENGTH           0x00000001

#define _CFD2FIFOCON17_TFERFFIE_POSITION         0x00000002
#define _CFD2FIFOCON17_TFERFFIE_MASK             0x00000004
#define _CFD2FIFOCON17_TFERFFIE_LENGTH           0x00000001

#define _CFD2FIFOCON17_RXOVIE_POSITION           0x00000003
#define _CFD2FIFOCON17_RXOVIE_MASK               0x00000008
#define _CFD2FIFOCON17_RXOVIE_LENGTH             0x00000001

#define _CFD2FIFOCON17_TXATIE_POSITION           0x00000004
#define _CFD2FIFOCON17_TXATIE_MASK               0x00000010
#define _CFD2FIFOCON17_TXATIE_LENGTH             0x00000001

#define _CFD2FIFOCON17_RXTSEN_POSITION           0x00000005
#define _CFD2FIFOCON17_RXTSEN_MASK               0x00000020
#define _CFD2FIFOCON17_RXTSEN_LENGTH             0x00000001

