Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _CFD3FIFOCON18_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON18_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON18_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON18_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON18_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON18_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA18_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA18_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA18_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA18_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA18_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA18_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA18_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA18_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA18_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA18_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA18_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA18_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA18_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA18_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA18_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA18_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA18_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA18_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA18_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA18_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA18_TXLARB_LENGTH             0x00000001

#define _CFD3FIFOSTA18_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA18_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA18_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA18_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA18_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA18_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA18_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA18_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA18_FIFOUA_LENGTH              0x00000020

#define _CFD3FIFOCON19_TFNRFNIE_POSITION         0x00000000
#define _CFD3FIFOCON19_TFNRFNIE_MASK             0x00000001
#define _CFD3FIFOCON19_TFNRFNIE_LENGTH           0x00000001

#define _CFD3FIFOCON19_TFHRFHIE_POSITION         0x00000001
#define _CFD3FIFOCON19_TFHRFHIE_MASK             0x00000002
#define _CFD3FIFOCON19_TFHRFHIE_LENGTH           0x00000001

#define _CFD3FIFOCON19_TFERFFIE_POSITION         0x00000002
#define _CFD3FIFOCON19_TFERFFIE_MASK             0x00000004
#define _CFD3FIFOCON19_TFERFFIE_LENGTH           0x00000001

#define _CFD3FIFOCON19_RXOVIE_POSITION           0x00000003
#define _CFD3FIFOCON19_RXOVIE_MASK               0x00000008
#define _CFD3FIFOCON19_RXOVIE_LENGTH             0x00000001

#define _CFD3FIFOCON19_TXATIE_POSITION           0x00000004
#define _CFD3FIFOCON19_TXATIE_MASK               0x00000010
#define _CFD3FIFOCON19_TXATIE_LENGTH             0x00000001

#define _CFD3FIFOCON19_RXTSEN_POSITION           0x00000005
#define _CFD3FIFOCON19_RXTSEN_MASK               0x00000020
#define _CFD3FIFOCON19_RXTSEN_LENGTH             0x00000001

#define _CFD3FIFOCON19_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON19_RTREN_MASK                0x00000040
#define _CFD3FIFOCON19_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON19_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON19_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON19_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON19_UINC_POSITION             0x00000008
#define _CFD3FIFOCON19_UINC_MASK                 0x00000100
#define _CFD3FIFOCON19_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON19_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON19_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON19_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON19_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON19_FRESET_MASK               0x00000400
#define _CFD3FIFOCON19_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON19_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON19_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON19_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON19_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON19_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON19_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON19_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON19_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON19_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON19_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON19_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON19_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA19_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA19_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA19_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA19_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA19_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA19_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA19_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA19_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA19_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA19_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA19_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA19_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA19_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA19_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA19_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA19_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA19_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA19_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA19_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA19_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA19_TXLARB_LENGTH             0x00000001

