Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _CFD3FIFOCON26_RXTSEN_POSITION           0x00000005
#define _CFD3FIFOCON26_RXTSEN_MASK               0x00000020
#define _CFD3FIFOCON26_RXTSEN_LENGTH             0x00000001

#define _CFD3FIFOCON26_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON26_RTREN_MASK                0x00000040
#define _CFD3FIFOCON26_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON26_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON26_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON26_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON26_UINC_POSITION             0x00000008
#define _CFD3FIFOCON26_UINC_MASK                 0x00000100
#define _CFD3FIFOCON26_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON26_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON26_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON26_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON26_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON26_FRESET_MASK               0x00000400
#define _CFD3FIFOCON26_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON26_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON26_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON26_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON26_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON26_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON26_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON26_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON26_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON26_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON26_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON26_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON26_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA26_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA26_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA26_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA26_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA26_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA26_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA26_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA26_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA26_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA26_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA26_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA26_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA26_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA26_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA26_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA26_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA26_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA26_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA26_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA26_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA26_TXLARB_LENGTH             0x00000001

#define _CFD3FIFOSTA26_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA26_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA26_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA26_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA26_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA26_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA26_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA26_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA26_FIFOUA_LENGTH              0x00000020

#define _CFD3FIFOCON27_TFNRFNIE_POSITION         0x00000000
#define _CFD3FIFOCON27_TFNRFNIE_MASK             0x00000001
#define _CFD3FIFOCON27_TFNRFNIE_LENGTH           0x00000001

#define _CFD3FIFOCON27_TFHRFHIE_POSITION         0x00000001
#define _CFD3FIFOCON27_TFHRFHIE_MASK             0x00000002
#define _CFD3FIFOCON27_TFHRFHIE_LENGTH           0x00000001

#define _CFD3FIFOCON27_TFERFFIE_POSITION         0x00000002
#define _CFD3FIFOCON27_TFERFFIE_MASK             0x00000004
#define _CFD3FIFOCON27_TFERFFIE_LENGTH           0x00000001

#define _CFD3FIFOCON27_RXOVIE_POSITION           0x00000003
#define _CFD3FIFOCON27_RXOVIE_MASK               0x00000008
#define _CFD3FIFOCON27_RXOVIE_LENGTH             0x00000001

#define _CFD3FIFOCON27_TXATIE_POSITION           0x00000004
#define _CFD3FIFOCON27_TXATIE_MASK               0x00000010
#define _CFD3FIFOCON27_TXATIE_LENGTH             0x00000001

#define _CFD3FIFOCON27_RXTSEN_POSITION           0x00000005
#define _CFD3FIFOCON27_RXTSEN_MASK               0x00000020
#define _CFD3FIFOCON27_RXTSEN_LENGTH             0x00000001

#define _CFD3FIFOCON27_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON27_RTREN_MASK                0x00000040
#define _CFD3FIFOCON27_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON27_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON27_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON27_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON27_UINC_POSITION             0x00000008
#define _CFD3FIFOCON27_UINC_MASK                 0x00000100
#define _CFD3FIFOCON27_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON27_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON27_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON27_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON27_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON27_FRESET_MASK               0x00000400
#define _CFD3FIFOCON27_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON27_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON27_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON27_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON27_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON27_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON27_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON27_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON27_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON27_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON27_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON27_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON27_PLSIZE_LENGTH             0x00000003

