Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _ADCIMCON2_SIGN24_POSITION               0x00000010
#define _ADCIMCON2_SIGN24_MASK                   0x00010000
#define _ADCIMCON2_SIGN24_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF24_POSITION               0x00000011
#define _ADCIMCON2_DIFF24_MASK                   0x00020000
#define _ADCIMCON2_DIFF24_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN25_POSITION               0x00000012
#define _ADCIMCON2_SIGN25_MASK                   0x00040000
#define _ADCIMCON2_SIGN25_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF25_POSITION               0x00000013
#define _ADCIMCON2_DIFF25_MASK                   0x00080000
#define _ADCIMCON2_DIFF25_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN26_POSITION               0x00000014
#define _ADCIMCON2_SIGN26_MASK                   0x00100000
#define _ADCIMCON2_SIGN26_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF26_POSITION               0x00000015
#define _ADCIMCON2_DIFF26_MASK                   0x00200000
#define _ADCIMCON2_DIFF26_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN27_POSITION               0x00000016
#define _ADCIMCON2_SIGN27_MASK                   0x00400000
#define _ADCIMCON2_SIGN27_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF27_POSITION               0x00000017
#define _ADCIMCON2_DIFF27_MASK                   0x00800000
#define _ADCIMCON2_DIFF27_LENGTH                 0x00000001

#define _ADCIMCON4_SIGN48_POSITION               0x00000000
#define _ADCIMCON4_SIGN48_MASK                   0x00000001
#define _ADCIMCON4_SIGN48_LENGTH                 0x00000001

#define _ADCIMCON4_DIFF48_POSITION               0x00000001
#define _ADCIMCON4_DIFF48_MASK                   0x00000002
#define _ADCIMCON4_DIFF48_LENGTH                 0x00000001

#define _ADCIMCON4_SIGN49_POSITION               0x00000002
#define _ADCIMCON4_SIGN49_MASK                   0x00000004
#define _ADCIMCON4_SIGN49_LENGTH                 0x00000001

#define _ADCIMCON4_DIFF49_POSITION               0x00000003
#define _ADCIMCON4_DIFF49_MASK                   0x00000008
#define _ADCIMCON4_DIFF49_LENGTH                 0x00000001

#define _ADCGIRQEN1_AGIEN0_POSITION              0x00000000
#define _ADCGIRQEN1_AGIEN0_MASK                  0x00000001
#define _ADCGIRQEN1_AGIEN0_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN1_POSITION              0x00000001
#define _ADCGIRQEN1_AGIEN1_MASK                  0x00000002
#define _ADCGIRQEN1_AGIEN1_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN2_POSITION              0x00000002
#define _ADCGIRQEN1_AGIEN2_MASK                  0x00000004
#define _ADCGIRQEN1_AGIEN2_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN3_POSITION              0x00000003
#define _ADCGIRQEN1_AGIEN3_MASK                  0x00000008
#define _ADCGIRQEN1_AGIEN3_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN4_POSITION              0x00000004
#define _ADCGIRQEN1_AGIEN4_MASK                  0x00000010
#define _ADCGIRQEN1_AGIEN4_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN5_POSITION              0x00000005
#define _ADCGIRQEN1_AGIEN5_MASK                  0x00000020
#define _ADCGIRQEN1_AGIEN5_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN6_POSITION              0x00000006
#define _ADCGIRQEN1_AGIEN6_MASK                  0x00000040
#define _ADCGIRQEN1_AGIEN6_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN7_POSITION              0x00000007
#define _ADCGIRQEN1_AGIEN7_MASK                  0x00000080
#define _ADCGIRQEN1_AGIEN7_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN8_POSITION              0x00000008
#define _ADCGIRQEN1_AGIEN8_MASK                  0x00000100
#define _ADCGIRQEN1_AGIEN8_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN9_POSITION              0x00000009
#define _ADCGIRQEN1_AGIEN9_MASK                  0x00000200
#define _ADCGIRQEN1_AGIEN9_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN10_POSITION             0x0000000A
#define _ADCGIRQEN1_AGIEN10_MASK                 0x00000400
#define _ADCGIRQEN1_AGIEN10_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN11_POSITION             0x0000000B
#define _ADCGIRQEN1_AGIEN11_MASK                 0x00000800
#define _ADCGIRQEN1_AGIEN11_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN12_POSITION             0x0000000C
#define _ADCGIRQEN1_AGIEN12_MASK                 0x00001000
#define _ADCGIRQEN1_AGIEN12_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN13_POSITION             0x0000000D
#define _ADCGIRQEN1_AGIEN13_MASK                 0x00002000
#define _ADCGIRQEN1_AGIEN13_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN14_POSITION             0x0000000E
#define _ADCGIRQEN1_AGIEN14_MASK                 0x00004000
#define _ADCGIRQEN1_AGIEN14_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN15_POSITION             0x0000000F
#define _ADCGIRQEN1_AGIEN15_MASK                 0x00008000
#define _ADCGIRQEN1_AGIEN15_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN16_POSITION             0x00000010
#define _ADCGIRQEN1_AGIEN16_MASK                 0x00010000
#define _ADCGIRQEN1_AGIEN16_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN17_POSITION             0x00000011
#define _ADCGIRQEN1_AGIEN17_MASK                 0x00020000
#define _ADCGIRQEN1_AGIEN17_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN18_POSITION             0x00000012
#define _ADCGIRQEN1_AGIEN18_MASK                 0x00040000
#define _ADCGIRQEN1_AGIEN18_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN19_POSITION             0x00000013
#define _ADCGIRQEN1_AGIEN19_MASK                 0x00080000
#define _ADCGIRQEN1_AGIEN19_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN24_POSITION             0x00000018
#define _ADCGIRQEN1_AGIEN24_MASK                 0x01000000
#define _ADCGIRQEN1_AGIEN24_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN25_POSITION             0x00000019
#define _ADCGIRQEN1_AGIEN25_MASK                 0x02000000
#define _ADCGIRQEN1_AGIEN25_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN26_POSITION             0x0000001A
#define _ADCGIRQEN1_AGIEN26_MASK                 0x04000000
#define _ADCGIRQEN1_AGIEN26_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN27_POSITION             0x0000001B
#define _ADCGIRQEN1_AGIEN27_MASK                 0x08000000
#define _ADCGIRQEN1_AGIEN27_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN48_POSITION             0x00000010
#define _ADCGIRQEN2_AGIEN48_MASK                 0x00010000
#define _ADCGIRQEN2_AGIEN48_LENGTH               0x00000001

