Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm064.h
#define _ADC2TIME_ADCEIS_POSITION                0x0000001A
#define _ADC2TIME_ADCEIS_MASK                    0x1C000000
#define _ADC2TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC3TIME_SAMC_POSITION                  0x00000000
#define _ADC3TIME_SAMC_MASK                      0x000003FF
#define _ADC3TIME_SAMC_LENGTH                    0x0000000A

#define _ADC3TIME_ADCDIV_POSITION                0x00000010
#define _ADC3TIME_ADCDIV_MASK                    0x007F0000
#define _ADC3TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC3TIME_BCHEN_POSITION                 0x00000017
#define _ADC3TIME_BCHEN_MASK                     0x00800000
#define _ADC3TIME_BCHEN_LENGTH                   0x00000001

#define _ADC3TIME_SELRES_POSITION                0x00000018
#define _ADC3TIME_SELRES_MASK                    0x03000000
#define _ADC3TIME_SELRES_LENGTH                  0x00000002

#define _ADC3TIME_ADCEIS_POSITION                0x0000001A
#define _ADC3TIME_ADCEIS_MASK                    0x1C000000
#define _ADC3TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC4TIME_SAMC_POSITION                  0x00000000
#define _ADC4TIME_SAMC_MASK                      0x000003FF
#define _ADC4TIME_SAMC_LENGTH                    0x0000000A

#define _ADC4TIME_ADCDIV_POSITION                0x00000010
#define _ADC4TIME_ADCDIV_MASK                    0x007F0000
#define _ADC4TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC4TIME_BCHEN_POSITION                 0x00000017
#define _ADC4TIME_BCHEN_MASK                     0x00800000
#define _ADC4TIME_BCHEN_LENGTH                   0x00000001

#define _ADC4TIME_SELRES_POSITION                0x00000018
#define _ADC4TIME_SELRES_MASK                    0x03000000
#define _ADC4TIME_SELRES_LENGTH                  0x00000002

#define _ADC4TIME_ADCEIS_POSITION                0x0000001A
#define _ADC4TIME_ADCEIS_MASK                    0x1C000000
#define _ADC4TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC5TIME_SAMC_POSITION                  0x00000000
#define _ADC5TIME_SAMC_MASK                      0x000003FF
#define _ADC5TIME_SAMC_LENGTH                    0x0000000A

#define _ADC5TIME_ADCDIV_POSITION                0x00000010
#define _ADC5TIME_ADCDIV_MASK                    0x007F0000
#define _ADC5TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC5TIME_BCHEN_POSITION                 0x00000017
#define _ADC5TIME_BCHEN_MASK                     0x00800000
#define _ADC5TIME_BCHEN_LENGTH                   0x00000001

#define _ADC5TIME_SELRES_POSITION                0x00000018
#define _ADC5TIME_SELRES_MASK                    0x03000000
#define _ADC5TIME_SELRES_LENGTH                  0x00000002

#define _ADC5TIME_ADCEIS_POSITION                0x0000001A
#define _ADC5TIME_ADCEIS_MASK                    0x1C000000
#define _ADC5TIME_ADCEIS_LENGTH                  0x00000003

#define _ADCEIEN1_EIEN0_POSITION                 0x00000000
#define _ADCEIEN1_EIEN0_MASK                     0x00000001
#define _ADCEIEN1_EIEN0_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN1_POSITION                 0x00000001
#define _ADCEIEN1_EIEN1_MASK                     0x00000002
#define _ADCEIEN1_EIEN1_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN2_POSITION                 0x00000002
#define _ADCEIEN1_EIEN2_MASK                     0x00000004
#define _ADCEIEN1_EIEN2_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN3_POSITION                 0x00000003
#define _ADCEIEN1_EIEN3_MASK                     0x00000008
#define _ADCEIEN1_EIEN3_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN4_POSITION                 0x00000004
#define _ADCEIEN1_EIEN4_MASK                     0x00000010
#define _ADCEIEN1_EIEN4_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN5_POSITION                 0x00000005
#define _ADCEIEN1_EIEN5_MASK                     0x00000020
#define _ADCEIEN1_EIEN5_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN6_POSITION                 0x00000006
#define _ADCEIEN1_EIEN6_MASK                     0x00000040
#define _ADCEIEN1_EIEN6_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN7_POSITION                 0x00000007
#define _ADCEIEN1_EIEN7_MASK                     0x00000080
#define _ADCEIEN1_EIEN7_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN8_POSITION                 0x00000008
#define _ADCEIEN1_EIEN8_MASK                     0x00000100
#define _ADCEIEN1_EIEN8_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN9_POSITION                 0x00000009
#define _ADCEIEN1_EIEN9_MASK                     0x00000200
#define _ADCEIEN1_EIEN9_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN10_POSITION                0x0000000A
#define _ADCEIEN1_EIEN10_MASK                    0x00000400
#define _ADCEIEN1_EIEN10_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN11_POSITION                0x0000000B
#define _ADCEIEN1_EIEN11_MASK                    0x00000800
#define _ADCEIEN1_EIEN11_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN12_POSITION                0x0000000C
#define _ADCEIEN1_EIEN12_MASK                    0x00001000
#define _ADCEIEN1_EIEN12_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN13_POSITION                0x0000000D
#define _ADCEIEN1_EIEN13_MASK                    0x00002000
#define _ADCEIEN1_EIEN13_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN14_POSITION                0x0000000E
#define _ADCEIEN1_EIEN14_MASK                    0x00004000
#define _ADCEIEN1_EIEN14_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN15_POSITION                0x0000000F
#define _ADCEIEN1_EIEN15_MASK                    0x00008000
#define _ADCEIEN1_EIEN15_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN16_POSITION                0x00000010
#define _ADCEIEN1_EIEN16_MASK                    0x00010000
#define _ADCEIEN1_EIEN16_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN17_POSITION                0x00000011
#define _ADCEIEN1_EIEN17_MASK                    0x00020000
#define _ADCEIEN1_EIEN17_LENGTH                  0x00000001

